{
  "metadata": {
    "file_purpose": "Active Directory Domain SID Enumeration Commands",
    "oscp_relevance": "Essential prerequisite for Silver Ticket and Golden Ticket attacks",
    "related_techniques": [
      "Kerberos ticket forgery",
      "Silver tickets",
      "Golden tickets"
    ],
    "created_date": "2025-11-10",
    "last_updated": "2025-11-10"
  },
  "commands": [
    {
      "id": "ad-sid-whoami-extract",
      "name": "Extract Domain SID Using whoami",
      "category": "enumeration",
      "subcategory": "domain-reconnaissance",
      "command": "whoami /user",
      "description": "Extract the current user's SID, from which the Domain SID can be derived by removing the RID (last portion after final hyphen).",
      "tags": [
        "ACTIVE_DIRECTORY",
        "SID_ENUMERATION",
        "OSCP:HIGH",
        "QUICK_WIN",
        "KERBEROS_PREREQUISITE",
        "WINDOWS"
      ],
      "variables": [],
      "flag_explanations": {
        "/user": "Displays the user name along with the Security Identifier (SID) in the format S-1-5-21-DOMAIN-DOMAIN-DOMAIN-RID. This is the most reliable built-in Windows method to obtain SID information without requiring PowerShell or external tools. The Domain SID is everything except the RID (last segment). For example, if output shows 'S-1-5-21-1987370270-658905905-1781884369-1105', the Domain SID is 'S-1-5-21-1987370270-658905905-1781884369' (remove '-1105'). This works from any privilege level and doesn't require special permissions. Essential for OSCP exams when PowerShell remoting may be restricted or you need a quick, stealthy method that doesn't generate suspicious logs. Time: <5 seconds."
      },
      "success_indicators": [
        "Output displays 'User Name' and 'SID' columns",
        "SID format: S-1-5-21-XXXXXXXXXX-XXXXXXXXXX-XXXXXXXXXX-XXXX",
        "First portion is always 'S-1-5-21' (domain account)",
        "Last segment after final hyphen is the RID (Relative Identifier)",
        "Domain SID is everything before the RID"
      ],
      "failure_indicators": [
        "'whoami' is not recognized - Command Prompt may not be available (use PowerShell alternative)",
        "SID starts with S-1-5-18, S-1-5-19, S-1-5-20 - Built-in account (SYSTEM, LOCAL SERVICE, NETWORK SERVICE), not domain account",
        "SID format S-1-5-21-xxx-xxx-xxx-500 - Domain Administrator account (RID 500)",
        "No output - Session may not be properly authenticated"
      ],
      "troubleshooting": {
        "Command not recognized in PowerShell": "PowerShell wraps whoami differently. Use: cmd /c whoami /user OR use Get-LocalUser | Select Name,SID",
        "Need Domain SID from local machine account": "Computer accounts also have domain SID. Same extraction method applies - remove RID from computer account SID",
        "SID format confusion (which part is Domain SID)": "FORMULA: S-1-5-21-[KEEP]-[KEEP]-[KEEP]-[REMOVE]. The three middle segments (each 10 digits) are the Domain SID. The last segment is the user's RID (unique identifier within domain). For Silver/Golden tickets, you need ONLY the Domain SID (S-1-5-21-KEEP-KEEP-KEEP).",
        "Verifying extracted Domain SID is correct": "Use 'whoami /all' to see group SIDs. All domain groups should start with the same S-1-5-21-XXXXXXXXXX-XXXXXXXXXX-XXXXXXXXXX prefix (your Domain SID). If they don't match, you extracted incorrectly."
      },
      "notes": "OSCP METHODOLOGY:\nThis is the FASTEST and STEALTHIEST method to obtain the Domain SID during an exam.\n\nUnlike PowerView or other PowerShell tools, whoami is a native Windows binary that exists on every system since Windows XP and generates minimal security event logs.\n\nIt requires NO special permissions, NO PowerShell execution policy bypasses, and NO external tool downloads.\n\nMANUAL ALTERNATIVE:\nIf whoami is restricted (rare), use 'wmic useraccount get name,sid' to list all local and domain accounts with their SIDs.\n\nDomain accounts will share the same Domain SID prefix.\n\nWHY THIS MATTERS FOR SILVER/GOLDEN TICKETS:\nThe Domain SID is a REQUIRED parameter when forging Kerberos tickets with Mimikatz or Rubeus.\n\nMimikatz's kerberos::golden module needs '/sid:S-1-5-21-DOMAIN-DOMAIN-DOMAIN' (WITHOUT the RID).\n\nIf you include the RID by mistake, the forged ticket will be invalid and authentication will fail with 'KRB_AP_ERR_MODIFIED'.\n\nSID STRUCTURE EXPLAINED:\n- S-1:\nSID revision (always 1)\n\n- 5:\nSECURITY_NT_AUTHORITY (Windows security subsystem)\n\n- 21:\nDomain or local computer account (vs.\n\n18=SYSTEM, 32=Built-in)\n\n- Three 10-digit segments:\nDomain identifier (unique per AD domain)\n\n- Final segment (RID):\nUser/group/computer relative ID within domain\n\nCOMMON OSCP EXAM SCENARIO:\nYou've compromised a domain user account (e.g., via password spraying or AS-REP roasting).\n\nYou need to create a Silver ticket to access an HTTP SPN on a web server.\n\nFirst step:\nExtract Domain SID with whoami /user.\n\nCopy everything EXCEPT the last segment after the final hyphen.\n\nThis becomes your '/sid:' parameter.\n\nTime:\n<10 seconds total (5 sec to run command, 5 sec to extract Domain SID by removing RID)\n\nDETECTION EVASION:\nwhoami /user generates Event ID 4688 (Process Creation) but this is extremely common and typically not monitored.\n\nUnlike PowerShell cmdlets that may trigger AMSI or script block logging, whoami is a compiled binary that bypasses these defenses.\n\nOSCP EXAM TIP:\nWrite the Domain SID down immediately after extraction and store it in your enumeration notes.\n\nYou'll need it multiple times if you perform Silver tickets, Golden tickets, or SID history attacks.\n\nDon't waste time re-extracting it.\n\nCROSS-REFERENCE WITH OTHER ENUMERATION:\nIf you've run PowerView's Get-NetDomain, verify the Domain SID matches.\n\nIf they differ, you may be on a child domain or in a forest trust situation.\n\nAlways use the Domain SID of the target domain where you're forging tickets.",
      "oscp_relevance": "high",
      "alternatives": [
        "ad-sid-powerview-domain",
        "ad-sid-wmic-extract"
      ],
      "next_steps": [
        "ad-silver-ticket-mimikatz-create",
        "ad-golden-ticket-mimikatz-create"
      ],
      "prerequisites": [
        "crackmapexec-validate-admin"
      ]
    },
    {
      "id": "ad-sid-powerview-domain",
      "name": "Extract Domain SID Using PowerView",
      "category": "enumeration",
      "subcategory": "domain-reconnaissance",
      "command": "Get-DomainSID",
      "description": "Directly retrieve the Domain SID of the current or specified domain using PowerView. Returns only the Domain SID without user RID, ready for use in ticket forgery.",
      "tags": [
        "ACTIVE_DIRECTORY",
        "SID_ENUMERATION",
        "OSCP:HIGH",
        "POWERVIEW",
        "KERBEROS_PREREQUISITE",
        "WINDOWS",
        "POWERSHELL"
      ],
      "variables": [],
      "flag_explanations": {
        "Get-DomainSID": "PowerView function that directly returns the Domain SID (S-1-5-21-XXXXXXXXXX-XXXXXXXXXX-XXXXXXXXXX) without the user RID appended. This is the CLEANEST method because it outputs ONLY the Domain SID - no parsing required. Internally, it queries the 'ObjectSID' attribute of the domain object in Active Directory via LDAP. Unlike whoami /user which requires manual RID removal, this returns the exact value needed for Mimikatz's '/sid:' parameter. Requires PowerView to be imported (Import-Module PowerView.ps1). Optional parameter: -Domain <domain.com> to query a different domain in a multi-domain forest. Time: <2 seconds after PowerView is loaded."
      },
      "success_indicators": [
        "Output is a single SID string: S-1-5-21-XXXXXXXXXX-XXXXXXXXXX-XXXXXXXXXX",
        "SID contains exactly 4 hyphens (S-1-5-21-DOMAIN-DOMAIN-DOMAIN)",
        "No RID appended (ends with 10-digit domain identifier, not user RID)",
        "Matches Domain SID extracted from whoami /user (after RID removal)",
        "Can be directly copied into Mimikatz /sid: parameter"
      ],
      "failure_indicators": [
        "'Get-DomainSID' is not recognized - PowerView not imported (use Import-Module)",
        "Exception calling LDAP - Network connectivity issue or DC unreachable",
        "Access denied - Current user lacks LDAP query permissions (rare, even low-priv users can query domain object)",
        "Returns $null - Domain query failed (verify domain membership with whoami /all)"
      ],
      "troubleshooting": {
        "PowerView not loaded": "Import PowerView: Import-Module C:\\Tools\\PowerView.ps1 OR dot-source it: . .\\PowerView.ps1. If AMSI blocks, use obfuscation: Invoke-Obfuscation with AST method OR manually rename functions.",
        "LDAP query timeout": "DC may be unreachable. Verify DC connectivity: Test-NetConnection -ComputerName DC1.corp.com -Port 389 (LDAP). If firewall blocks LDAP, fall back to ad-sid-whoami-extract method.",
        "Need SID of different domain in forest": "Use -Domain parameter: Get-DomainSID -Domain child.corp.com. Requires trust relationship and query permissions on target domain.",
        "PowerShell execution policy blocking": "Bypass: powershell -ExecutionPolicy Bypass -File script.ps1 OR powershell -c \"IEX (Get-Content PowerView.ps1 -Raw); Get-DomainSID\""
      },
      "notes": "OSCP METHODOLOGY:\nPowerView's Get-DomainSID is the MOST EFFICIENT method when PowerShell is available and AMSI is not blocking.\n\nIt eliminates manual parsing and reduces operator error.\n\nHowever, it requires importing PowerView, which may trigger AV/EDR in realistic environments.\n\nFor OSCP exams, this is typically safe as exam machines are not running EDR, but always have a fallback method (whoami /user).\n\nMANUAL ALTERNATIVE:\nIf PowerView unavailable, use ADSI directly in PowerShell:\n  $root = [ADSI]\"LDAP://RootDSE\"\n  $domain = [ADSI]\"LDAP://$($root.defaultNamingContext)\"\n  $domain.objectSid | ForEach-Object { (New-Object Security.Principal.SecurityIdentifier($_, 0)).Value }\n\nThis achieves the same result without PowerView dependency.\n\nWHEN TO USE THIS VS whoami /user:\n- USE Get-DomainSID:\n  When you have PowerShell access, PowerView is already loaded (e.g., during enumeration phase), or you need to query multiple domains in a forest.\n\n- USE whoami /user:\n  When PowerShell is restricted, AMSI is blocking, PowerView is unavailable, or you need maximum stealth (native binary, minimal logs).\n\nPOWERVIEW CONTEXT:\nGet-DomainSID is part of PowerView's domain enumeration suite.\n\nIf you're already running Get-NetDomain, Get-NetUser, Get-NetComputer for reconnaissance, adding Get-DomainSID is a natural extension.\n\nPowerView functions are designed to chain together - output from Get-DomainSID can be piped into ticket forgery automation scripts.\n\nCROSS-DOMAIN FORESTS:\nIn environments with parent/child domains or forest trusts, you may encounter different Domain SIDs.\n\nGet-DomainSID defaults to the current user's domain.\n\nTo target a specific domain:\n  Get-DomainSID -Domain child.corp.com\n\nVerify the correct domain with Get-NetDomain to see DomainName property.\n\nOSCP EXAM TIP:\nIf you're using PowerView for enumeration, cache the Domain SID in a variable immediately:\n  $DomainSID = Get-DomainSID\n  Write-Host \"[+] Domain SID:\n$DomainSID\" -ForegroundColor Green\n\nThis prevents re-querying and speeds up ticket forgery later.\n\nTime:\n<5 seconds (2 sec if PowerView pre-loaded, +10 sec if you need to import PowerView first)\n\nDETECTION:\nGenerates LDAP queries to the domain controller (Event ID 4662 on DC:\nDirectory Service Access).\n\nModern EDR may flag PowerView import (AMSI scan), but LDAP queries themselves are common and rarely alerted.\n\nIf stealth is critical, use whoami /user instead.\n\nCOMPARISON WITH Get-NetDomain:\nGet-NetDomain returns a DomainSID property among many others (DomainControllers, Forest, DomainName, etc.).\n\nGet-DomainSID extracts ONLY the SID.\n\nUse Get-NetDomain for comprehensive enumeration, Get-DomainSID for quick SID extraction.",
      "oscp_relevance": "high",
      "alternatives": [
        "ad-sid-whoami-extract",
        "ad-sid-wmic-extract"
      ],
      "next_steps": [
        "ad-silver-ticket-mimikatz-create",
        "ad-golden-ticket-mimikatz-create"
      ],
      "prerequisites": []
    },
    {
      "id": "ad-sid-wmic-extract",
      "name": "Extract Domain SID Using WMIC",
      "category": "enumeration",
      "subcategory": "domain-reconnaissance",
      "command": "wmic useraccount get name,sid",
      "description": "List all local and domain user accounts with their SIDs using Windows Management Instrumentation Command-line (WMIC). Domain accounts share the same Domain SID prefix.",
      "tags": [
        "ACTIVE_DIRECTORY",
        "SID_ENUMERATION",
        "OSCP:MEDIUM",
        "QUICK_WIN",
        "KERBEROS_PREREQUISITE",
        "WINDOWS",
        "LEGACY"
      ],
      "variables": [],
      "flag_explanations": {
        "wmic": "Windows Management Instrumentation Command-line tool - built-in utility for querying WMI classes. Available on all Windows systems since Windows XP (deprecated in Windows 10 21H1 but still functional for backward compatibility). Requires local administrator or equivalent WMI permissions in most configurations. Generates Event ID 4688 (Process Creation) - same as whoami, minimal suspicion.",
        "useraccount": "WMI class representing user accounts (both local and domain). Queries Win32_UserAccount WMI class which enumerates all user accounts visible to the system. This includes local SAM accounts AND cached domain accounts. Each account entry includes Name, SID, Domain, AccountType, and other properties.",
        "get name,sid": "Retrieves only the 'Name' and 'SID' properties from the useraccount class. This filters output to show just username and Security Identifier, making it easier to parse. Alternative: 'wmic useraccount list full' shows all properties but is verbose. The SID property displays the full SID including RID - you must manually remove the RID (last segment after final hyphen) to extract Domain SID."
      },
      "success_indicators": [
        "Table output with 'Name' and 'SID' columns",
        "Multiple accounts listed (both local and domain accounts)",
        "Domain accounts have SID format S-1-5-21-XXXXXXXXXX-XXXXXXXXXX-XXXXXXXXXX-XXXX",
        "Local accounts have different SID prefixes (S-1-5-21-YYYYYYY-YYYYYYY-YYYYYYY-XXXX)",
        "Domain accounts share the same first four segments (S-1-5-21-DOMAIN-DOMAIN-DOMAIN)",
        "Distinct RIDs for each account (last segment differs per user)"
      ],
      "failure_indicators": [
        "'wmic' is not recognized - Command not in PATH (check C:\\Windows\\System32\\wbem\\WMIC.exe)",
        "Access denied - Insufficient WMI permissions (requires local admin in most cases)",
        "Invalid query - Syntax error (ensure exact spacing: 'get name,sid' not 'get name, sid')",
        "No domain accounts listed - Machine may not be domain-joined (verify with: wmic computersystem get domain)"
      ],
      "troubleshooting": {
        "WMIC deprecated warning (Windows 10 21H1+)": "WMIC still functions but Microsoft recommends PowerShell alternatives. If WMIC is removed (rare), use: Get-LocalUser | Select-Object Name, SID OR Get-ADUser -Filter * -Properties SID | Select-Object Name, SID",
        "Too many accounts listed (parse domain accounts only)": "Filter domain accounts: wmic useraccount where \"domain='CORP'\" get name,sid. Replace 'CORP' with your NetBIOS domain name. This excludes local SAM accounts.",
        "Extract Domain SID from multiple accounts": "Compare SIDs of domain accounts. The first four hyphen-separated segments (S-1-5-21-XXXXXXXXXX-XXXXXXXXXX-XXXXXXXXXX) should be identical for all domain accounts. This is your Domain SID. The final segment (RID) will differ per account: 500=Administrator, 501=Guest, 502=krbtgt, 1000+ custom users.",
        "WMIC hangs or times out": "WMI service (winmgmt) may be stopped. Check: sc query winmgmt. Start if needed: net start winmgmt. If remote WMI query, verify firewall allows WMI (port 135 + dynamic RPC ports)."
      },
      "notes": "OSCP METHODOLOGY:\nWMIC is a LEGACY method that's useful when whoami is unavailable and PowerShell is restricted.\n\nIt's slower than whoami /user and requires more parsing, but it provides a comprehensive view of all accounts on the system.\n\nMain advantage:\nYou can see ALL domain accounts at once and verify the Domain SID is consistent across them (good for validation).\n\nMANUAL ALTERNATIVE:\nIf WMIC deprecated/removed, use PowerShell equivalent:\n  Get-WmiObject -Class Win32_UserAccount | Select-Object Name, SID, Domain | Format-Table\n\nThis achieves identical results using PowerShell's WMI cmdlets.\n\nWHEN TO USE THIS METHOD:\n- VALIDATION:\n  When you've extracted Domain SID with whoami /user and want to verify it's correct by comparing against other domain accounts\n\n- BULK EXTRACTION:\n  When you need SIDs for multiple domain users (e.g., building a target list)\n\n- LEGACY SYSTEMS:\n  Older Windows servers (2008/2012) where PowerShell may be limited but WMIC is fully functional\n\nWHEN NOT TO USE:\n- SPEED:\n  whoami /user is faster (single account vs.\n\nall accounts)\n\n- STEALTH:\n  WMIC generates more WMI events than whoami\n\n- MODERN SYSTEMS:\n  Windows 10 21H1+ shows deprecation warning\n\nPARSING DOMAIN SID FROM OUTPUT:\n1.\n\nIdentify domain accounts (exclude local SAM accounts like 'Administrator', 'Guest' if they have different SID prefix)\n\n2.\n\nPick any domain account's SID (e.g., CORP\\jeff:\nS-1-5-21-1987370270-658905905-1781884369-1105)\n\n3.\n\nRemove RID (last segment):\nS-1-5-21-1987370270-658905905-1781884369\n\n4.\n\nThis is the Domain SID\n\nVALIDATION TECHNIQUE:\nAll domain accounts should have the SAME Domain SID (first four segments).\n\nIf you see different Domain SIDs, you may be dealing with:\n- Local vs.\n\ndomain accounts (local accounts have machine-specific SID)\n- Multi-domain forest (child domain accounts have different Domain SID)\n- Migrated accounts (SID history may show old SIDs)\n\nOSCP EXAM TIP:\nWMIC is NOT the first choice for Domain SID extraction (use whoami /user or Get-DomainSID instead).\n\nHowever, it's valuable when you need to enumerate multiple domain user SIDs simultaneously (e.g., for SID history analysis or identifying high-value targets like RID 500 domain admin).\n\nTime:\n5-10 seconds (slower than whoami due to WMI query overhead and parsing all accounts)\n\nDETECTION:\nGenerates Event ID 4688 (Process Creation for WMIC.exe) and WMI activity logs (Event ID 5857-5861 in Microsoft-Windows-WMI-Activity/Operational).\n\nMore verbose than whoami but still common activity.\n\nEDR may flag unusual WMI queries, but useraccount enumeration is standard.\n\nCOMPATIBILITY NOTE:\nWMIC was deprecated in Windows 10 version 21H1 (August 2021) and removed in some Windows 11 builds.\n\nAlways test availability with 'wmic /?'.\n\nIf unavailable, use PowerShell or whoami alternatives.",
      "oscp_relevance": "medium",
      "alternatives": [
        "ad-sid-whoami-extract",
        "ad-sid-powerview-domain"
      ],
      "next_steps": [
        "ad-silver-ticket-mimikatz-create",
        "ad-golden-ticket-mimikatz-create"
      ],
      "prerequisites": []
    }
  ]
}
