{
  "cheatsheets": [
    {
      "id": "ad-account-policy-discovery",
      "name": "Active Directory Account Policy Discovery",
      "description": "Methods for discovering Active Directory password and account lockout policies from different network positions - critical for safe password spraying",
      "educational_header": {
        "how_to_recognize": [
          "You're about to perform password spraying or brute force attacks against Active Directory",
          "You need to know the lockout threshold to avoid locking accounts",
          "You want to calculate safe spray timing (attempts per observation window)",
          "You need password complexity requirements for targeted password list creation"
        ],
        "when_to_look_for": [
          "IMMEDIATELY before any password attack (spraying, brute force, credential stuffing)",
          "During initial reconnaissance of Active Directory environment",
          "Before testing default credentials against multiple accounts",
          "security assessment: Before attempting any authentication against domain accounts (lockouts = failed objective)"
        ]
      },
      "scenarios": [
        {
          "title": "Scenario 1: Policy Check from Domain-Joined Windows System",
          "context": "You've compromised a Windows 10 workstation CLIENT75 via web exploitation. You have command execution as domain user corp\\webuser (standard user, non-admin). The system is domain-joined to corp.com. You need to discover the password policy quickly before attempting password spraying. You have PowerShell access.",
          "approach": "Use built-in net.exe command to query domain password policy. This is the FASTEST and SIMPLEST method when you have access to any domain-joined Windows system. Works from cmd.exe or PowerShell, requires no special privileges (any domain user can read password policy), and completes in <5 seconds. This is your go-to method during security assessment when you compromise a Windows box.",
          "commands": [
            "net-accounts-policy"
          ],
          "expected_outcome": "OUTPUT INTERPRETATION: Force user logoff: Never (users not forced to logout). Minimum password age: 1 day (can't change password more than once per day). Maximum password age: 42 days (password expires after 42 days). Minimum password length: 7 characters (passwords must be at least 7 chars). Password history: 24 (can't reuse last 24 passwords). CRITICAL LOCKOUT SETTINGS: Lockout threshold: 5 (5 failed attempts locks account). Lockout duration: 30 minutes (account locked for 30min after threshold reached). Lockout observation window: 30 minutes (failed attempt counter resets 30min after last failed attempt). SAFE SPRAY CALCULATION: 5 threshold = max 4 attempts per user safely. 30min observation window = wait 30min between spray rounds. Result: Spray 4 passwords, wait 30min, spray 4 more, repeat. TIME ESTIMATE: <5 seconds.",
          "why_this_works": "net accounts queries the domain controller's password policy via MS-SAMR RPC over SMB. This information is stored in the domain's Default Domain Policy GPO (Group Policy Object) and is readable by ANY authenticated domain user - no special permissions required. The policy applies domain-wide to all user accounts. Windows automatically contacts the domain controller when you run this command (you don't need to specify DC name). CRITICAL for security work: This is the most reliable method when you have Windows access. No tools to upload, no PowerShell modules to import, works even with AppLocker restrictions. MANUAL ALTERNATIVE: Open gpedit.msc → Computer Configuration → Windows Settings → Security Settings → Account Policies → Account Lockout Policy (requires GUI access). AUTOMATION: Parse output with PowerShell: (net accounts) -match 'Lockout threshold' | %{$_.Split(':')[1].Trim()} returns just the number (5)."
        },
        {
          "title": "Scenario 2: Policy Check from Linux with NULL Session (External/No Credentials)",
          "context": "You're performing an external penetration test. You've discovered a domain controller at 192.168.50.70 via port scanning (ports 139/445 SMB are open). You have NO credentials yet but want to discover the password policy before attempting password spraying. You're on a Kali Linux attack box. The domain is corp.com (determined via SMB enumeration).",
          "approach": "Attempt NULL SESSION enumeration with enum4linux. Null sessions are anonymous SMB connections that were enabled by default on older Windows versions for backward compatibility. Many organizations still allow null sessions for legacy application support. This is a PRIVILEGE-FREE method - no credentials required. If null sessions are blocked, move to Scenario 3 (with credentials).",
          "commands": [
            "enum4linux-policy"
          ],
          "expected_outcome": "SUCCESS CASE (null session allowed): OUTPUT shows [+] Password Info for Domain: corp.com. Password Complexity: Enabled. Minimum Password Length: 7. Lockout Threshold: 5. Account Lockout Duration: 30 minutes. Reset Account Lockout Counter: 30 minutes. FAILURE CASE (null session blocked): NT_STATUS_ACCESS_DENIED or NT_STATUS_INVALID_PARAMETER. Error means null sessions are disabled (common on modern domains). NEXT STEP if blocked: Get ANY valid credentials (even guest account) and retry with enum4linux -u guest -p '' -P 192.168.50.70 OR use crackmapexec-policy with credentials. TIME ESTIMATE: 10-30 seconds. MODERN DOMAINS: Windows Server 2008 R2+ block null sessions by default. Success rate: ~20% on modern networks, ~60% on legacy networks.",
          "why_this_works": "NULL SESSION = anonymous SMB connection using empty username and password. Enabled via registry: HKLM\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters\\RestrictNullSessAccess=0. When allowed, you can connect to IPC$ share anonymously and query MS-SAMR RPC interface for password policy. WHY SOMETIMES ALLOWED: Legacy applications (old network printers, backup software, monitoring tools) may require null session access. Administrators enable it for compatibility and forget to disable. DETECTION EVASION: Null session enumeration is VERY stealthy - appears as normal SMB anonymous bind, often not logged or alerted. ALTERNATIVE SYNTAX: rpcclient -N -U '' 192.168.50.70 then run 'getdompwinfo' command (manual method). pentest TIP: Always TRY null session first before using credentials - you might not need authentication at all."
        },
        {
          "title": "Scenario 3: Policy Check from Linux with Valid Credentials",
          "context": "You're on Kali Linux with network access to corp.com domain. You've obtained credentials jeff:HenchmanPutridBonbon11 via password spraying (lucky guess or OSINT). You need to retrieve the password policy to calculate safe spray limits for additional passwords. Domain controller is at 192.168.50.70. SMB null sessions are blocked (verified via enum4linux failure).",
          "approach": "Use CrackMapExec with the --pass-pol flag to dump password policy via authenticated SMB. This is the MODERN method that works when null sessions are disabled. Any valid domain user credentials work - even guest account with blank password. CrackMapExec supports SMBv2/SMBv3 (enum4linux requires SMBv1). This is your fallback when Scenario 2 fails.",
          "commands": [
            "crackmapexec-policy"
          ],
          "expected_outcome": "OUTPUT: [+] Dumping password policy. Minimum password length: 7. Password complexity: Enabled. Lockout threshold: 5. Lockout duration (minutes): 30. Lockout observation window (minutes): 30. INTERPRETATION: Complexity enabled = password must contain 3 of 4 categories (uppercase, lowercase, numbers, symbols). Minimum length 7 = shortest allowed password. Lockout 5 = max 4 safe attempts per observation window. SAFE SPRAY STRATEGY: Test 4 common passwords (Password123!, Welcome2023!, Summer2023!, Winter2023!), wait 30min for observation window reset, test 4 more. Over 24 hours = 192 safe attempts per user (4 attempts × 48 thirty-minute windows). TIME ESTIMATE: 5-15 seconds.",
          "why_this_works": "CrackMapExec authenticates to domain controller via SMB using provided credentials. After successful authentication, it queries password policy via MS-SAMR RPC interface (same as net accounts but over SMB from Linux). Password policy is stored in Default Domain Policy GPO and readable by ANY authenticated user. ADVANTAGES OVER ENUM4LINUX: (1) Supports SMBv2/SMBv3 (enum4linux requires SMBv1, often disabled). (2) Supports Kerberos authentication (not just NTLM). (3) Better error messages. (4) Actively maintained. GUEST ACCOUNT TRY: Many domains have guest account enabled with blank password. Try: crackmapexec smb 192.168.50.70 -u 'guest' -p '' --pass-pol. If successful, you got policy without burning your real credentials. pentest TIP: Use CrackMapExec as default policy check tool on Linux. More reliable than enum4linux on modern domains."
        },
        {
          "title": "Scenario 4: Policy Check via LDAP - Detailed Attribute Extraction",
          "context": "You're on Kali Linux performing deep enumeration of corp.com. You have credentials corp\\jeff:HenchmanPutridBonbon11. You want to extract password policy AND additional attributes (password age, complexity settings, Kerberos policy) that SMB-based tools don't show. Domain controller is at 192.168.50.70. You need detailed policy information for advanced attacks (AS-REP roasting timing, password complexity patterns).",
          "approach": "Use ldapsearch to query password policy attributes directly from Active Directory LDAP. This provides RAW LDAP attributes with most detail but requires manual interpretation. Use this when you need complete policy information beyond basic lockout settings. Requires LDAP port 389 access and valid credentials (anonymous LDAP rarely allowed on modern domains).",
          "commands": [
            "ldapsearch-policy"
          ],
          "expected_outcome": "OUTPUT (raw LDAP attributes): lockoutThreshold: 5. lockoutDuration: -18000000000 (100-nanosecond intervals, NEGATIVE value). lockOutObservationWindow: -18000000000. minPwdLength: 7. pwdProperties: 1 (bitmask: 1=complexity enabled). CONVERSION REQUIRED: lockoutDuration and lockOutObservationWindow are in 100-nanosecond intervals and NEGATIVE (Windows FILETIME format). Convert: -18000000000 ÷ 600000000 = 30 minutes. MANUAL CALCULATION: Take absolute value (18000000000) → divide by 600000000 → result in minutes (30). BITMASK: pwdProperties is bitmask: 0=no complexity, 1=complexity enabled. ADDITIONAL ATTRIBUTES (query separately): maxPwdAge: maximum password age. minPwdAge: minimum password age. pwdHistoryLength: password history count. TIME ESTIMATE: 5-10 seconds plus manual conversion time.",
          "why_this_works": "Password policy is stored in the domain root object in Active Directory LDAP database. The object DN is DC=corp,DC=com (domain root). It contains password policy attributes readable by any authenticated user. ldapsearch with -s base scope queries single object (domain root) with filter (objectClass=*) matching all, then retrieves specified attributes. TIME CONVERSION MATH: Windows stores time in 100-nanosecond intervals since Jan 1, 1601 (FILETIME). Negative values for lockout settings indicate duration FROM current time. Conversion formula: nanoseconds ÷ 10,000,000 = seconds, seconds ÷ 60 = minutes. Example: 18000000000 ÷ 10000000 = 1800 seconds ÷ 60 = 30 minutes. WHEN TO USE: (1) Need exact numerical values for scripting. (2) SMB-based tools are failing. (3) Want additional attributes (password age policies). (4) Learning LDAP for advanced enumeration. pentest REALITY: Rarely needed - CrackMapExec provides policy in readable format. Use ldapsearch when you want to practice LDAP or troubleshoot SMB failures."
        }
      ],
      "sections": [
        {
          "title": "Quick Reference: Lockout Threshold Interpretation",
          "notes": "LOCKOUT THRESHOLD is the number that determines safe spray limits. COMMON VALUES: 0 = no lockout (unlimited attempts, extremely rare). 3 = very strict (max 2 safe attempts). 5 = common default (max 4 safe attempts). 10 = lenient (max 9 safe attempts). SAFE ATTEMPT CALCULATION: Always use (threshold - 1) to leave safety margin. Why subtract 1? Users might fail login attempts themselves, consuming lockout counter. If threshold is 5 and you use 5 attempts, a single user mistype locks the account. Using threshold - 1 provides safety buffer. certification STRATEGY: With threshold 5, spray maximum 3-4 passwords per observation window for absolute safety.",
          "commands": []
        },
        {
          "title": "Quick Reference: Observation Window Timing",
          "notes": "OBSERVATION WINDOW is the time period for counting failed attempts. CRITICAL UNDERSTANDING: Failed attempt counter RESETS after observation window expires from LAST failed attempt (not first). EXAMPLE TIMELINE: User fails login at 10:00am (counter=1). User fails again at 10:10am (counter=2). Observation window is 30min. Counter resets at 10:40am (30min after LAST failure at 10:10am, not 30min after first at 10:00am). You can safely spray again at 10:41am. COMMON VALUES: 15 minutes = wait 16min between spray rounds. 30 minutes = wait 31min between spray rounds. 60 minutes = wait 61min between spray rounds. AUTOMATION: Use sleep command between rounds: spray_passwords.sh; sleep 1860 (31 minutes); spray_passwords.sh. certification TIP: Set timer on your phone when starting spray round. When timer expires (observation window + 1min), safe to spray next password.",
          "commands": []
        },
        {
          "title": "Quick Reference: Lockout Duration vs Observation Window",
          "notes": "LOCKOUT DURATION = how long account STAYS locked after threshold reached. OBSERVATION WINDOW = how long to wait between spray rounds to reset counter. THESE ARE DIFFERENT CONCEPTS: LOCKOUT DURATION only matters AFTER you've locked an account (threshold exceeded). OBSERVATION WINDOW is what you use to calculate safe spray timing (prevents lockout). EXAMPLE: Threshold 5, Observation window 30min, Lockout duration 60min. SAFE BEHAVIOR: Spray 4 attempts, wait 30min (observation window), spray 4 more, repeat = never lock accounts. LOCKED ACCOUNT: If you exceed 5 attempts within 30min window, account locks for 60min. COMMON CONFUSION: Admins sometimes set lockout duration = observation window (both 30min) or lockout duration longer (60min). Always use OBSERVATION WINDOW for spray timing calculations, not lockout duration. certification SCENARIO: If you accidentally lock an account, you must wait lockout duration (30min-60min typically) before that account is usable again. This wastes exam time and may alert administrators.",
          "commands": []
        },
        {
          "title": "Tool Selection Guide: Which Method to Use When",
          "notes": "DECISION TREE FOR POLICY DISCOVERY: [1] Do you have Windows access (RDP/WinRM/shell)? → YES: Use net-accounts-policy (fastest, most reliable, <5 seconds). NO: Continue to [2]. [2] Are you on Linux/Mac? → YES: Continue to [3]. [3] Do you have ANY valid credentials (even guest account)? → YES: Use crackmapexec-policy (modern, reliable, works with SMBv2/v3). NO: Try enum4linux-policy (null session attempt). [4] Did enum4linux fail with ACCESS_DENIED? → YES: You MUST obtain credentials first. Try: password spraying with common defaults, OSINT for credentials, guest account (try -u guest -p ''). ADVANCED CASE: Need detailed LDAP attributes or SMB is blocked but LDAP works? → Use ldapsearch-policy. TIME COMPARISON: net accounts (Windows): <5 sec. CrackMapExec (Linux+creds): 5-15 sec. enum4linux (Linux+null): 10-30 sec. ldapsearch (Linux+creds): 5-10 sec (+conversion time). RELIABILITY RANKING: net accounts (99%) > CrackMapExec (95%) > ldapsearch (90%) > enum4linux null session (20% success on modern domains). certification RECOMMENDATION: Always prioritize net accounts if you have Windows access. Use CrackMapExec as fallback from Linux with credentials.",
          "commands": [
            {
              "id": "net-accounts-policy",
              "example": "net accounts",
              "shows": "Force user logoff how long after time expires?"
            },
            {
              "id": "crackmapexec-policy",
              "example": "crackmapexec smb 192.168.50.70 -u guest -p '' --pass-pol",
              "shows": "[+] Dumping password policy"
            },
            {
              "id": "enum4linux-policy",
              "example": "enum4linux -P 192.168.50.70",
              "shows": "Password Complexity"
            },
            {
              "id": "ldapsearch-policy",
              "example": "ldapsearch -x -H ldap://192.168.50.70 -b 'DC=corp,DC=com' -s base '(objectClass=*)' lockoutThreshold lockoutDuration lockOutObservationWindow minPwdLength pwdProperties",
              "shows": "lockoutThreshold:"
            }
          ]
        }
      ],
      "tags": [
        "ACTIVE_DIRECTORY",
        "PASSWORD_POLICY",
        "ENUMERATION",
        "WORKFLOW"
      ]
    }
  ]
}