{
  "cheatsheets": [
    {
      "id": "ad-password-spraying-methodology",
      "name": "Active Directory Password Spraying Methodology",
      "description": "Complete methodology for safe and effective password spraying attacks against Active Directory - from policy discovery through credential validation to privilege escalation",
      "educational_header": {
        "how_to_recognize": [
          "You have network access to a domain controller (port 88 Kerberos, 389 LDAP, or 445 SMB)",
          "You've identified an Active Directory environment but lack valid credentials",
          "You have a list of potential usernames from OSINT, enumeration, or username wordlists",
          "You want to test a common password across many users without locking accounts"
        ],
        "when_to_look_for": [
          "During external penetration tests when you've identified AD but have no credentials",
          "After gaining initial access to a network but before obtaining domain credentials",
          "When you've found a potential default/common password and want to test it domain-wide",
          "OSCP exam: When you need valid AD credentials and brute force is not practical due to lockout policies"
        ]
      },
      "scenarios": [
        {
          "title": "Scenario 1: External Password Spray - No Domain Access",
          "context": "You're performing an external penetration test. You've identified a domain controller at 192.168.50.70 (domain: corp.com) via port scanning. You can reach Kerberos port 88/UDP but have NO credentials and NO network access to internal resources. You want to spray a common password (Nexus123!) to gain initial domain access.",
          "approach": "Use Kerbrute for external password spraying. This is the ONLY method that works without domain access - requires only UDP 88 to DC. First enumerate valid usernames with a wordlist, then spray a single common password. This generates minimal network traffic (2 UDP packets per attempt) and is extremely stealthy.",
          "commands": [
            "kerbrute-userenum-ad",
            "kerbrute-passwordspray",
            "kerbrute-validate-creds",
            "crackmapexec-validate-admin"
          ],
          "expected_outcome": "Kerbrute userenum identifies 5-20 valid usernames from your wordlist (e.g., pete, jen, dave). Password spray with 'Nexus123!' reveals 2 valid credentials: pete:Nexus123! and jen:Nexus123!. You now have domain credentials for initial access. Next step: test if these users have local admin rights on any systems with crackmapexec.",
          "why_this_works": "Kerberos pre-authentication (AS-REQ) validates usernames and passwords without requiring full domain login or network access. The domain controller responds differently for valid users (PREAUTH_REQUIRED) vs invalid users (PRINCIPAL_UNKNOWN), and for correct passwords (TGT issued) vs wrong passwords (PREAUTH_FAILED). This is by-design Kerberos behavior, not a vulnerability. No SMB, RDP, or LDAP access needed - only UDP 88 to DC. TIME ESTIMATE: 5 minutes for username enum (10k usernames) + 30 seconds for password spray (50 valid users). STEALTH: Minimal logging - Event ID 4768 for valid creds, 4771 for wrong passwords (normal AD traffic)."
        },
        {
          "title": "Scenario 2: Internal Password Spray from Windows - Policy-Aware LDAP Method",
          "context": "You've compromised a Windows 10 workstation via web exploitation and have a PowerShell session as domain user corp\\webuser. You're on CLIENT75 (192.168.50.75) in the corp.com domain. You want to spray passwords safely without locking accounts. The password policy shows: 5 attempt lockout threshold, 30 minute observation window, 30 minute lockout duration.",
          "approach": "Use PowerShell LDAP password spraying (Spray-Passwords.ps1) from the compromised Windows system. This method automatically reads the password policy and respects lockout settings. It generates minimal network traffic and appears as normal LDAP authentication. Execute from PowerShell with bypass to avoid execution policy blocks.",
          "commands": [
            "net-accounts-policy",
            "spray-passwords-ldap",
            "crackmapexec-validate-admin"
          ],
          "expected_outcome": "net accounts confirms policy: 5 attempt threshold, 30min window. Spray-Passwords.ps1 with 'Nexus123!' identifies valid credentials: pete:Nexus123! and jen:Nexus123! (automatically tested -Admin flag to include admin accounts). Script automatically limits attempts to stay under lockout threshold. Validate with CrackMapExec to check for local admin rights across network. TIME ESTIMATE: Check policy (5 seconds) + spray 100 users (2-3 minutes) + validate (30 seconds) = ~4 minutes total.",
          "why_this_works": "PowerShell DirectoryEntry uses System.DirectoryServices to create LDAP connections. The constructor new DirectoryEntry(LDAP_PATH, USERNAME, PASSWORD) attempts authentication. Success = object created with distinguishedName property. Failure = exception thrown. The script enumerates all domain users via LDAP query, then attempts authentication for each user. It respects the password policy by automatically spacing attempts according to lockout threshold and observation window. Generates Event ID 4776 (NTLM auth) for each attempt - looks like normal user logins."
        },
        {
          "title": "Scenario 3: Internal Password Spray from Linux - Comparing All Three Methods",
          "context": "You're on a Kali Linux attack box inside the corp.com network. You have network access to DC at 192.168.50.70 and workstation CLIENT75 at 192.168.50.75. You've already obtained the password policy (5 attempt threshold, 30min window) and have a list of 50 valid usernames. You want to spray the password 'Nexus123!' and understand the trade-offs between SMB (CrackMapExec), Kerberos (kerbrute), and LDAP methods.",
          "approach": "Compare all three password spraying methods to understand their characteristics. Use Kerbrute for speed and stealth (FASTEST, 2 UDP packets), CrackMapExec SMB for admin detection (NOISIEST but shows Pwn3d!), and test understanding of when to use each. In practice, prefer Kerbrute for initial spray, then CrackMapExec for validation and admin checking.",
          "commands": [
            "crackmapexec-policy",
            "kerbrute-userenum-ad",
            "kerbrute-passwordspray",
            "crackmapexec-smb-spray",
            "crackmapexec-validate-admin"
          ],
          "expected_outcome": "METHOD COMPARISON: (1) Kerbrute: Completes in 10 seconds, finds pete:Nexus123! and jen:Nexus123!, minimal noise. (2) CrackMapExec SMB: Completes in 2 minutes (slower), finds same credentials, shows dave:Flowers1 (Pwn3d!) = local admin. (3) Decision: Use Kerbrute for bulk spraying (fast, stealthy), then CrackMapExec for privilege checking. TRADE-OFFS: Kerbrute = Speed/Stealth, CME = Admin Detection, PowerShell LDAP = Policy-Aware.",
          "why_this_works": "KERBRUTE: Uses Kerberos AS-REQ (2 UDP packets per attempt). Response time: <50ms. Network traffic: ~500 bytes total. Events: 4768/4771 (normal). CRACKMAPEXEC SMB: Uses full SMB connection + NTLM auth (10+ packets per attempt). Response time: 2-3 seconds. Network traffic: ~5KB per attempt. Events: 4625 (failed logon) or 4624 (success) - highly visible. Pwn3d! = admin check via ADMIN$ share access. POWERSHELL LDAP: Uses LDAP bind (4-6 packets per attempt). Response time: ~1 second. Network traffic: ~2KB per attempt. Events: 4776 (credential validation) - looks like normal auth. SUMMARY: Pick method based on: External access? → Kerbrute only. Need admin detection? → CrackMapExec. Maximum stealth? → Kerbrute. Policy-aware automation? → PowerShell LDAP. TIME ESTIMATE: Kerbrute (50 users): 10 sec. CME SMB (50 users): 2 min. PS LDAP (50 users): 1 min."
        },
        {
          "title": "Scenario 4: Lockout-Safe Time-Delayed Spraying - Avoiding Account Locks",
          "context": "You're testing corp.com domain with STRICT password policy: 3 attempt lockout threshold, 15 minute observation window, 60 minute lockout duration. You have 200 users and want to test 5 common passwords without locking ANY accounts. Standard tools don't check policy automatically. You need to manually calculate safe spray timing and track attempts.",
          "approach": "Manually implement lockout-safe spraying strategy. CALCULATION: 3 threshold = max 2 attempts per user per 15min window. Strategy: Spray password 1 against all users (2 attempts used), wait 16 minutes for observation window to reset, spray password 2 (2 more attempts), wait 16 minutes, repeat. Use Kerbrute for speed. Track progress to avoid confusion. This is CRITICAL for OSCP exam - locking accounts alerts admins and may fail the exam.",
          "commands": [
            "crackmapexec-policy",
            "kerbrute-userenum-ad",
            "kerbrute-passwordspray",
            "kerbrute-validate-creds"
          ],
          "expected_outcome": "SAFE SPRAY TIMELINE: T+0min: Check policy (3 threshold, 15min window). T+1min: Spray password 'Winter2023!' (200 users, 30 seconds). T+16min: Spray password 'Summer2023!' (200 users, 30 seconds). T+32min: Spray password 'Spring2023!'. Pattern: 2 attempts used per cycle, 15min wait between cycles. RESULT: Tested 5 passwords across 200 users (1000 total attempts) in 65 minutes with ZERO lockouts. Found credentials: alice:Winter2023!, bob:Summer2023!. LOCKOUT MATH: 2 attempts / 15min window = 8 attempts/hour safely. Over 24 hours = 192 safe attempts per user (assuming users don't fail logins themselves).",
          "why_this_works": "Account lockout counter RESETS after the observation window expires. Example: User fails login at 10:00, 10:05, 10:10 (2 attempts). Counter = 2. At 10:25 (15min after LAST failure at 10:10), observation window expires and counter resets to 0. You can safely attempt again at 10:26. CRITICAL: Observation window is measured from LAST failed attempt, not first. So spread attempts within window (10:00, 10:05, 10:10 all count toward same window) but wait 15min after LAST attempt (10:10 + 15min = 10:25) before next attempt. AUTOMATION: Tools like Spray-Passwords.ps1 do this automatically. Manual spraying with Kerbrute/CME requires YOU to track timing. Use script: for pwd in pwd1 pwd2 pwd3; do kerbrute passwordspray -d corp.com --dc DC_IP users.txt \"$pwd\"; sleep 960; done (960 seconds = 16 minutes). TIME ESTIMATE: (passwords × spray_time) + ((passwords - 1) × observation_window). Example: 5 passwords × 30sec + 4 × 16min = 2.5min + 64min = 66.5 minutes total."
        },
        {
          "title": "Scenario 5: Post-Spray Validation and Privilege Escalation Path",
          "context": "You've successfully sprayed 'Nexus123!' against corp.com and found 3 valid credentials: pete:Nexus123!, jen:Nexus123!, dave:Flowers1 (dave was from a different spray). Now you need to: (1) Validate credentials are truly valid, (2) Check which users have local admin rights, (3) Identify best path for lateral movement and privilege escalation.",
          "approach": "Multi-step validation and privilege mapping. First, quick-validate all credentials with Kerbrute to confirm they work. Second, use CrackMapExec to scan entire subnet (192.168.50.0/24) to find which systems each user has admin rights on. Third, identify best pivot point (user with most admin access or access to critical systems like servers). Fourth, use valid credentials for lateral movement.",
          "commands": [
            "kerbrute-validate-creds",
            "crackmapexec-validate-admin",
            "crackmapexec-smb-spray",
            "evil-winrm",
            "psexec"
          ],
          "expected_outcome": "VALIDATION RESULTS: (1) Kerbrute confirms all 3 credentials are valid (pete, jen, dave all authenticate successfully). (2) CrackMapExec subnet scan shows: pete = standard user (no admin anywhere), jen = local admin on 3 workstations (CLIENT74, CLIENT76, CLIENT80), dave = local admin on 15 systems including SERVER01 (Pwn3d!). (3) DECISION: Prioritize dave credentials - has widest access including server. (4) ACTION: Use evil-winrm with dave:Flowers1 to access SERVER01, dump SAM/LSA secrets with secretsdump, find cached Domain Admin credentials or service account with high privileges. LATERAL MOVEMENT PATH: dave@CLIENT75 → dave@SERVER01 (Pwn3d!) → extract credentials → Domain Admin or high-privilege service account → full domain compromise.",
          "why_this_works": "LOCAL ADMIN RIGHTS don't grant domain-wide privileges but allow you to: (1) Execute code with SYSTEM privileges on those machines. (2) Dump local SAM database for additional credentials. (3) Dump LSA secrets for cached domain credentials. (4) Dump LSASS memory for plaintext passwords and Kerberos tickets. (5) Pivot to other systems using extracted credentials. CRITICAL OSCP STRATEGY: A single local admin account on one workstation can lead to domain compromise if that workstation has cached Domain Admin credentials or if you can steal Kerberos tickets for lateral movement. CrackMapExec subnet scan (192.168.50.0/24) shows which systems display (Pwn3d!) for each user. TIME ESTIMATE: Validation (5 seconds) + subnet scan 254 IPs (2-3 minutes) + evil-winrm connection (10 seconds) + secretsdump (30 seconds) = ~4 minutes to full system access."
        }
      ],
      "sections": [
        {
          "title": "Phase 1: Password Policy Discovery - MANDATORY FIRST STEP",
          "notes": "ALWAYS discover password policy BEFORE spraying to avoid account lockouts. Lockout threshold tells you max attempts before lockout. Observation window tells you how long to wait between spray rounds. Lockout duration tells you how long accounts stay locked. CALCULATION: Safe attempts = (threshold - 1) per observation window. Example: 5 threshold, 30min window = spray 4 passwords max, wait 30min, repeat. Without this step you risk locking out accounts and alerting administrators.",
          "commands": [
            "net-accounts-policy",
            "enum4linux-policy",
            "crackmapexec-policy",
            "ldapsearch-policy"
          ]
        },
        {
          "title": "Phase 2: Username Enumeration - Build Target List",
          "notes": "Spray passwords against VALID usernames only to avoid wasting attempts and generating noise. Use Kerbrute for fastest enumeration (thousands of usernames per second). Alternatively use LDAP/SMB enumeration if you have credentials or null session access. Save valid usernames to file for spraying. WORDLIST RECOMMENDATIONS: /usr/share/seclists/Usernames/Names/names.txt (common first names), /usr/share/wordlists/seclists/Usernames/xato-net-10-million-usernames.txt (comprehensive). TIME ESTIMATE: 30-60 seconds for 10k usernames with Kerbrute.",
          "commands": [
            "kerbrute-userenum-ad",
            "enum4linux-users-ad",
            "crackmapexec-rid-cycling",
            "ldapsearch-users-ad"
          ]
        },
        {
          "title": "Phase 3: Password Spraying - Choose Method Based on Context",
          "notes": "METHOD SELECTION GUIDE: (1) External access only (no domain network)? → Use Kerbrute (only option). (2) Windows domain-joined system? → Use Spray-Passwords.ps1 (policy-aware). (3) Linux with network access? → Use Kerbrute for speed/stealth OR CrackMapExec for admin detection. (4) Need to identify local admin rights? → Use CrackMapExec (Pwn3d! indicator). (5) Maximum stealth required? → Use Kerbrute (minimal logging). SAFE SPRAYING: Calculate safe attempts = (lockout_threshold - 1) attempts per (observation_window) minutes. Use conservative password list (3-5 common passwords) rather than extensive wordlist.",
          "commands": [
            "spray-passwords-ldap",
            "crackmapexec-smb-spray",
            "kerbrute-passwordspray",
            "crackmapexec-winrm-spray"
          ]
        },
        {
          "title": "Phase 4: Credential Validation and Admin Rights Discovery",
          "notes": "After finding potential credentials, validate them and check for local admin rights. Kerbrute for quick validation (is password correct?). CrackMapExec for admin detection (does user have local admin anywhere?). SUBNET SCANNING: Use CrackMapExec with CIDR notation to scan entire subnet: crackmapexec smb 192.168.50.0/24 -u USERNAME -p PASSWORD -d DOMAIN. Look for (Pwn3d!) indicator = local admin rights = full system compromise possible. TIME ESTIMATE: Single host validation (5 sec), /24 subnet scan (2-3 min).",
          "commands": [
            "kerbrute-validate-creds",
            "crackmapexec-validate-admin"
          ]
        },
        {
          "title": "Phase 5: Lateral Movement and Privilege Escalation",
          "notes": "Use validated credentials with local admin rights for lateral movement. TOOLS: evil-winrm (WinRM access), psexec (SMB/SYSTEM shell), wmiexec (WMI/SYSTEM shell), smbexec (SMB without touching disk). OBJECTIVES: (1) Dump SAM/LSA secrets for additional credentials. (2) Dump LSASS memory for Kerberos tickets and plaintext passwords. (3) Search for cached Domain Admin credentials. (4) Identify service accounts with high privileges. (5) Look for Kerberoastable accounts. (6) Pivot to additional systems. OSCP TIP: Local admin on workstation → dump credentials → find Domain Admin cached creds or Kerberos tickets → full domain compromise.",
          "commands": [
            "crackmapexec-validate-admin",
            "evil-winrm",
            "psexec",
            "secretsdump",
            "mimikatz"
          ]
        }
      ],
      "tags": [
        "ACTIVE_DIRECTORY",
        "PASSWORD_SPRAY",
        "METHODOLOGY",
        "OSCP:HIGH",
        "WORKFLOW"
      ]
    }
  ]
}
