{
  "cheatsheets": [
    {
      "id": "ad-permission-abuse-hunting",
      "name": "Active Directory Permission Abuse Hunting",
      "description": "Identify and exploit excessive ACL permissions (GenericAll, WriteDACL, WriteOwner, ForceChangePassword) for privilege escalation and lateral movement",
      "educational_header": {
        "how_to_recognize": [
          "You have domain user credentials but need privilege escalation vector",
          "Initial reconnaissance shows complex OU structure (delegated administration)",
          "Looking for non-standard privilege escalation paths (not Kerberoasting)",
          "ACL misconfiguration often occurs in environments with delegated helpdesk/admin roles"
        ],
        "when_to_look_for": [
          "After Kerberoasting yields no crackable hashes",
          "When you control a low-privilege account and need path to Domain Admins",
          "In environments with multiple OUs/departments (delegated permissions common)",
          "OSCP exam: Check ACLs on privileged groups (Domain Admins, Enterprise Admins) and service accounts"
        ]
      },
      "scenarios": [
        {
          "title": "Scenario 1: GenericAll on User Account - Password Reset Path",
          "context": "You compromised 'corp\\helpdesk' account. Initial reconnaissance shows another account 'corp\\sqlservice' exists with local admin rights on multiple servers. You need to pivot to sqlservice account but don't have credentials. ACL enumeration reveals helpdesk has GenericAll permission on sqlservice account.",
          "approach": "GenericAll = Full control over the object. On user accounts, this includes: reset password (without knowing current password), modify account attributes, read all properties. Use Get-ObjectAcl to confirm the permission, then use Set-DomainUserPassword (PowerView) or native PowerShell to reset sqlservice's password. Maintain stealth by recording original password hash first (if possible).",
          "commands": [
            "powerview-get-objectacl-genericall",
            "powerview-convert-sidtoname",
            "powerview-find-interestingdomainacl"
          ],
          "expected_outcome": "Get-ObjectAcl shows: SecurityIdentifier: S-1-5-21-...-1105 (helpdesk), ActiveDirectoryRights: GenericAll, ObjectDN: CN=sqlservice,CN=Users,DC=corp,DC=com. Convert SID to confirm it's your account. You can now reset sqlservice password: $NewPassword = ConvertTo-SecureString 'NewPass123!' -AsPlainText -Force; Set-DomainUserPassword -Identity sqlservice -AccountPassword $NewPassword. Authenticate as sqlservice and gain admin access to target servers.",
          "why_this_works": "Active Directory ACLs control who can perform actions on AD objects. GenericAll is the most permissive ACE - it grants full control equivalent to ownership. On user objects, this includes the 'User-Force-Change-Password' extended right. When you reset a password, AD doesn't require the current password (unlike user-initiated password changes). This is by design for helpdesk scenarios but becomes a privilege escalation vector when over-delegated."
        },
        {
          "title": "Scenario 2: GenericAll on Group - Add Self to Domain Admins",
          "context": "You control 'corp\\backupuser' account. ACL enumeration shows backupuser has GenericAll permission on 'Domain Admins' group (common misconfiguration in environments with backup software that needs admin rights). This is a direct path to Domain Admin.",
          "approach": "GenericAll on a group allows adding/removing members without being a group member yourself. Use Add-DomainGroupMember (PowerView) or native PowerShell (Add-ADGroupMember) to add your account to Domain Admins. Maintain stealth by only keeping membership active for necessary time window, then remove yourself.",
          "commands": [
            "powerview-get-objectacl-group",
            "powerview-find-interestingdomainacl",
            "powerview-get-netgroup-recursive"
          ],
          "expected_outcome": "Get-ObjectAcl -Identity 'Domain Admins' reveals backupuser has GenericAll. Run: Add-DomainGroupMember -Identity 'Domain Admins' -Members 'backupuser'. Verify with: Get-NetGroupMember -GroupName 'Domain Admins'. Your account now has Domain Admin rights. You can now DCSync, access any system, dump NTDS.dit, etc. This is a critical finding - immediate privilege escalation from low-priv user to full domain compromise.",
          "why_this_works": "Group membership controls are governed by ACLs on the group object. GenericAll includes the 'WriteProperty' right on all attributes, including 'member' (group membership). Adding yourself to Domain Admins doesn't require approval or authentication - if the ACL allows it, AD will process the modification. This is why ACL auditing is critical - these permissions are often invisible to administrators who focus on group membership rather than group ACLs."
        },
        {
          "title": "Scenario 3: WriteDACL Permission - Grant Yourself GenericAll",
          "context": "You control 'corp\\auditor' account. Target is 'corp\\admin-svc' (domain admin account). Direct enumeration shows you DON'T have GenericAll on admin-svc. However, you have WriteDACL permission on admin-svc. WriteDACL allows you to modify the ACL itself - you can grant yourself GenericAll, then proceed with password reset.",
          "approach": "WriteDACL is a two-step exploitation: (1) Modify target's ACL to grant yourself GenericAll, (2) Exercise the GenericAll permission (password reset, group addition, etc.). Use Add-DomainObjectAcl (PowerView) to add an ACE granting your account GenericAll, then proceed with standard abuse techniques.",
          "commands": [
            "powerview-get-objectacl-writedacl",
            "powerview-find-interestingdomainacl"
          ],
          "expected_outcome": "Get-ObjectAcl -Identity admin-svc shows auditor has WriteDACL. Run: Add-DomainObjectAcl -TargetIdentity admin-svc -PrincipalIdentity auditor -Rights All. Now re-enumerate: Get-ObjectAcl -Identity admin-svc | Where {$_.SecurityIdentifier -eq (ConvertTo-SID auditor)}. You now have GenericAll. Proceed with password reset or other abuse. This is a stealthier approach than direct GenericAll - many monitoring solutions don't alert on ACL modifications.",
          "why_this_works": "WriteDACL permission allows modifying an object's Discretionary Access Control List (DACL). The DACL defines who can perform what actions on the object. By adding an ACE that grants yourself GenericAll, you're essentially making yourself the owner. This is a common misconfiguration in environments where 'security admins' are granted WriteDACL for delegation purposes but aren't monitored for ACL modifications."
        },
        {
          "title": "Scenario 4: WriteOwner Permission - Take Ownership Then Grant Access",
          "context": "You control 'corp\\developer' account. Target is a privileged group 'ServerAdmins' (local admin on 50+ servers). You have WriteOwner permission on ServerAdmins group. WriteOwner allows changing the object's owner - combine with owner's implicit Full Control to gain access.",
          "approach": "WriteOwner is a three-step exploitation: (1) Take ownership of the object (Set-DomainObjectOwner), (2) As owner, you implicitly have WriteDACL, (3) Grant yourself GenericAll, (4) Add yourself to the group. This is the longest privilege escalation chain but works when you only have WriteOwner.",
          "commands": [
            "powerview-get-objectacl-writeowner",
            "powerview-find-interestingdomainacl"
          ],
          "expected_outcome": "Get-ObjectAcl -Identity ServerAdmins shows developer has WriteOwner. Run: Set-DomainObjectOwner -Identity ServerAdmins -OwnerIdentity developer. You're now the owner. As owner, you implicitly have Full Control. Run: Add-DomainObjectAcl -TargetIdentity ServerAdmins -PrincipalIdentity developer -Rights All. Now add yourself: Add-DomainGroupMember -Identity ServerAdmins -Members developer. You're now a member of ServerAdmins with local admin on 50+ servers.",
          "why_this_works": "WriteOwner permission allows changing the 'Owner' attribute of an AD object. In Windows security model, the owner of an object has implicit Full Control (even if not explicitly listed in the ACL). This is by design - owners need the ability to fix broken ACLs. Once you're the owner, you can modify the DACL (grant yourself GenericAll), then exercise those permissions. This is often exploited in environments with delegated OU administration."
        },
        {
          "title": "Scenario 5: ForceChangePassword Extended Right - Direct Password Reset",
          "context": "You control 'corp\\helpdesk-t2' account. Target is 'corp\\dbadmin' (DBA account with sensitive data access). ACL shows helpdesk-t2 has 'User-Force-Change-Password' extended right on dbadmin (but NOT GenericAll). This specific right allows password resets without full control.",
          "approach": "ForceChangePassword is a targeted privilege - it only allows password resets, not other modifications. Use Set-DomainUserPassword (PowerView) or native Set-ADAccountPassword to reset the target's password. This is stealthier than GenericAll (you're not granting broad permissions) and common in helpdesk delegation scenarios.",
          "commands": [
            "powerview-get-objectacl-forcechangepassword",
            "powerview-find-interestingdomainacl"
          ],
          "expected_outcome": "Get-ObjectAcl -Identity dbadmin | Where {$_.ObjectAceType -eq 'User-Force-Change-Password'} shows helpdesk-t2 has this right. Run: Set-DomainUserPassword -Identity dbadmin -AccountPassword (ConvertTo-SecureString 'NewPass123!' -AsPlainText -Force). Password is now reset. Authenticate as dbadmin and access database servers. This is a common finding in OSCP exams - helpdesk delegation leads to privilege escalation.",
          "why_this_works": "Active Directory supports Extended Rights - specific permissions beyond standard read/write/modify. 'User-Force-Change-Password' (GUID: 00299570-246d-11d0-a768-00aa006e0529) is an extended right that allows password resets without knowing the current password. This is delegated to helpdesk teams for password reset scenarios but becomes a privilege escalation vector when over-delegated. The reset happens server-side (DC) - no client-side validation of current password."
        }
      ],
      "sections": [
        {
          "title": "Phase 1: Broad ACL Enumeration",
          "notes": "Cast wide net - identify ALL interesting ACLs where your account (or groups you're in) has excessive permissions. PowerView's Find-InterestingDomainAcl automates this. Focus on: GenericAll, GenericWrite, WriteDACL, WriteOwner, ForceChangePassword.",
          "commands": [
            "powerview-find-interestingdomainacl",
            "powerview-get-objectacl-genericall"
          ]
        },
        {
          "title": "Phase 2: Targeted ACL Enumeration (High-Value Targets)",
          "notes": "Enumerate ACLs on specific high-value targets: Domain Admins group, Enterprise Admins, privileged users (adminCount=1), sensitive OUs. Even non-interesting permissions might be exploitable in context.",
          "commands": [
            "powerview-get-objectacl-group",
            "powerview-get-objectacl-user",
            "ps-ldapsearch-admins"
          ]
        },
        {
          "title": "Phase 3: SID Resolution & Path Validation",
          "notes": "ACLs reference objects by SID (Security Identifier) not name. Use Convert-SidToName to translate SIDs to usernames/group names. Verify you actually control the principal account. Check for indirect access via group membership (you might be in a group that has the permission).",
          "commands": [
            "powerview-convert-sidtoname",
            "powerview-get-netgroup-recursive"
          ]
        },
        {
          "title": "Phase 4: Permission-Specific Enumeration",
          "notes": "Drill down on specific permission types if broad enumeration is too noisy. Each permission type has unique exploitation path: GenericAll (password reset/group addition), WriteDACL (grant yourself GenericAll), WriteOwner (take ownership first), ForceChangePassword (direct password reset).",
          "commands": [
            "powerview-get-objectacl-genericall",
            "powerview-get-objectacl-writedacl",
            "powerview-get-objectacl-writeowner",
            "powerview-get-objectacl-forcechangepassword"
          ]
        }
      ],
      "tags": [
        "ACTIVE_DIRECTORY",
        "ACL",
        "PERMISSIONS",
        "PRIVILEGE_ESCALATION",
        "GENERICALL",
        "WRITEDACL",
        "WRITEOWNER",
        "OSCP:HIGH"
      ]
    }
  ]
}