{
  "cheatsheets": [
    {
      "id": "ad-service-account-hunting",
      "name": "Active Directory Service Account Hunting (Kerberoasting)",
      "description": "Identify and exploit service accounts with registered SPNs - request TGS tickets encrypted with service account password hash, crack offline for credentials",
      "educational_header": {
        "how_to_recognize": [
          "You have domain user credentials (even low-privilege - any authenticated user can Kerberoast)",
          "Looking for privilege escalation vectors in Active Directory",
          "SPN enumeration reveals accounts with servicePrincipalName attribute",
          "Service accounts often have weak passwords (human-generated, 8-12 chars, never expire)"
        ],
        "when_to_look_for": [
          "After initial domain reconnaissance completes",
          "When you have valid credentials but no admin access",
          "OSCP exam: Always check for Kerberoastable accounts on domain-joined machines",
          "Service accounts frequently have SeImpersonate, SQLAdmin, or local admin rights elsewhere"
        ]
      },
      "scenarios": [
        {
          "title": "Scenario 1: Discovery Phase - Identify Kerberoastable Accounts",
          "context": "You have domain user credentials (corp\\lowpriv) on a Windows 10 workstation. Initial recon showed 250+ domain users. You need to identify which accounts are Kerberoastable (have SPNs registered) before attempting ticket requests. Time-efficient filtering is critical.",
          "approach": "Use setspn.exe (legacy) or PowerView (modern) to query Active Directory for all accounts with servicePrincipalName attribute set. Any domain user can read this attribute - no special permissions required. Focus on user accounts (not computer accounts - those have 128-char random passwords).",
          "commands": [
            "setspn-list-all",
            "powerview-get-netuser-spn"
          ],
          "expected_outcome": "You'll discover 2-5 service accounts like 'sqlservice', 'iis_svc', 'backupuser' with SPNs like 'MSSQLSvc/db01.corp.com:1433'. These are your targets. Computer accounts (ending in $) can be ignored. Focus on human-managed service accounts - they typically have weak, static passwords.",
          "why_this_works": "Active Directory stores SPNs as a multi-valued attribute (servicePrincipalName) on user objects. This attribute must be readable by all authenticated users for Kerberos authentication to function. When a client needs to access a service, it queries AD for the SPN to determine which account to request a ticket for. You're using the same mechanism, but for reconnaissance instead of legitimate access."
        },
        {
          "title": "Scenario 2: Legacy Ticket Request - setspn.exe + Mimikatz",
          "context": "You're on a Windows 7 machine with PowerShell 2.0 (no PowerView available). You discovered 'corp\\sqlservice' has SPN 'MSSQLSvc/db01.corp.com:1433'. You need to request a Kerberos TGS ticket for this account and extract it for offline cracking. Modern tools aren't available.",
          "approach": "Use setspn.exe to list SPNs (confirming target), then use native Windows 'Add-Type -AssemblyName System.IdentityModel' to request TGS tickets. This approach doesn't require external tools and works on any Windows version with PowerShell. Tickets are stored in memory (LSA cache) - extract with Mimikatz or from memory.",
          "commands": [
            "setspn-list-all",
            "ps-ldapsearch-spns"
          ],
          "expected_outcome": "setspn lists SPNs. LDAP query confirms the account exists. After requesting TGS ticket (System.IdentityModel.Tokens.KerberosRequestorSecurityToken), the ticket is cached in memory. Run 'klist' to see cached tickets. TGS ticket is encrypted with sqlservice's NTLM hash (derived from password). You can now extract this ticket with Mimikatz and crack it offline with hashcat.",
          "why_this_works": "Windows Kerberos authentication: (1) User authenticates to KDC, gets TGT. (2) User requests service access, KDC issues TGS ticket encrypted with service account's hash. (3) User presents TGS to service. The vulnerability: ANY domain user can request TGS tickets for ANY SPN without ever accessing the service. The TGS ticket is encrypted with the service account's password hash - crack the ticket offline to recover the password."
        },
        {
          "title": "Scenario 3: PowerView Automated Kerberoasting",
          "context": "You have PowerView loaded and identified 4 Kerberoastable accounts. You want to automate ticket request + extraction in a single command. Output should be hashcat-ready format for immediate offline cracking. This is the OSCP exam scenario - speed matters.",
          "approach": "Use Get-NetUser -SPN to identify targets, then use Invoke-Kerberoast (if available) or manual ticket request. PowerView automates the entire chain: SPN discovery → ticket request → ticket extraction → hashcat format conversion. This is the fastest method for exam scenarios.",
          "commands": [
            "powerview-get-netuser-spn",
            "ps-ldapsearch-spns"
          ],
          "expected_outcome": "Get-NetUser -SPN lists targets like 'sqlservice', 'iis_svc', 'backupuser'. For each account, you'll get output like '$krb5tgs$23$*sqlservice$CORP.COM$MSSQLSvc/db01*$abc123...' (hashcat mode 13100 format). Copy these hashes to your Kali box and run: hashcat -m 13100 kerberoast.txt /usr/share/wordlists/rockyou.txt. Expect 1-2 crackable hashes within 10 minutes.",
          "why_this_works": "PowerView automates what you'd do manually: (1) LDAP query for SPN accounts, (2) Request TGS tickets via System.IdentityModel, (3) Extract tickets from memory, (4) Convert to hashcat format. Each TGS ticket is encrypted with the service account's Kerberos key (derived from password). Since service accounts often have weak passwords (Password123, Summer2023, etc.), these hashes crack quickly."
        }
      ],
      "sections": [
        {
          "title": "Phase 1: SPN Discovery",
          "notes": "Identify which accounts have SPNs registered. Focus on user accounts (not computer accounts). Any authenticated domain user can query this - no special permissions needed.",
          "commands": [
            "setspn-list-all",
            "powerview-get-netuser-spn",
            "ps-ldapsearch-spns"
          ]
        },
        {
          "title": "Phase 2: Ticket Request (Manual PowerShell)",
          "notes": "Request TGS tickets for identified SPNs using native Windows Kerberos APIs. No external tools required. Tickets are cached in memory (viewable with 'klist').",
          "commands": [
            "ps-ldapsearch-spns"
          ]
        },
        {
          "title": "Phase 3: Target Validation",
          "notes": "Before requesting tickets, validate the accounts still exist and are enabled. Check for 'userAccountControl' flags (0x2 = disabled). Prioritize accounts with 'adminCount=1' (privileged accounts).",
          "commands": [
            "ps-ldapsearch-users",
            "ps-ldapsearch-admins",
            "powerview-get-netuser-all"
          ]
        }
      ],
      "tags": [
        "ACTIVE_DIRECTORY",
        "KERBEROASTING",
        "SPN",
        "SERVICE_ACCOUNTS",
        "PRIVILEGE_ESCALATION",
        "OSCP:HIGH",
        "QUICK_WIN"
      ]
    }
  ]
}