{
  "cheatsheets": [
    {
      "id": "metasploit-basics",
      "name": "Metasploit Framework - Basics & Workflow",
      "description": "Foundational Metasploit operations including database setup, workspace management, module discovery, and basic reconnaissance workflow for OSCP-style engagements",
      "educational_header": {
        "how_to_recognize": [
          "Fresh Kali installation requiring Metasploit database initialization",
          "Need to organize multiple target engagements with separate data stores",
          "Searching for modules related to discovered services (SMB, SSH, HTTP)",
          "Managing scan results from nmap and integrating with Metasploit workflow",
          "Requirement to save reconnaissance data for reporting and future reference",
          "Multiple concurrent assessments requiring isolated workspaces"
        ],
        "when_to_look_for": [
          "At the start of any penetration test or OSCP lab engagement (database setup)",
          "When organizing multiple targets or network segments (workspace creation)",
          "After nmap scans complete and you need to import results for analysis",
          "When searching for exploit or auxiliary modules matching service versions",
          "Before running any Metasploit scans to ensure data persistence",
          "When you need to track hosts, services, and vulnerabilities systematically"
        ]
      },
      "scenarios": [
        {
          "title": "Scenario 1: First-Time Metasploit Setup on Kali",
          "context": "Fresh Kali Linux installation. Goal: Initialize Metasploit database for persistent storage of hosts, services, credentials, and loot. Without database, no scan data persists between sessions.",
          "approach": "Step 1: Initialize PostgreSQL database: sudo msfdb init (creates msf user, database schema). Step 2: Start msfconsole to verify: msfconsole. Step 3: Check database status: db_status (should show 'Connected to msf'). Step 4: Create first workspace: workspace -a oscp-lab-1. Step 5: Verify workspace active: workspace (asterisk shows current workspace).",
          "commands": [
            "msf-db-init",
            "msf-console-start",
            "msf-db-status",
            "msf-workspace-add",
            "msf-workspace-list"
          ],
          "expected_outcome": "Database initialization shows: 'Creating database user 'msf', Creating databases 'msf' and 'msf_test', Database creation complete'. db_status confirms 'Connected to msf'. Workspace creation shows '[*] Added workspace: oscp-lab-1'. Time: 2-3 minutes for first-time setup. If db_status fails, database not initialized properly (run msfdb reinit).",
          "why_this_works": "Metasploit uses PostgreSQL backend for persistent storage. msfdb init creates dedicated 'msf' database user with proper permissions, initializes schema for hosts/services/vulns tables. Database enables: Import/export of scan data (db_import), Host and service tracking across sessions, Credential storage (creds command), Automated reporting (db_export). Without database, Metasploit operates in memory-only mode (data lost on exit). OSCP benefit: Organize multi-target engagements, track progress, generate evidence for reports. Database location: /var/lib/postgresql/. Backup command: sudo -u postgres pg_dump msf > msf_backup.sql."
        },
        {
          "title": "Scenario 2: Workspace Organization for Multi-Target Assessment",
          "context": "OSCP lab with 5 targets across 2 subnets (192.168.45.0/24 and 10.10.10.0/24). Goal: Separate data by target to prevent data mixing and enable focused enumeration per host.",
          "approach": "Step 1: Create workspace per target: workspace -a target-web-01, workspace -a target-dc-01, workspace -a target-linux-02. Step 2: Switch to specific workspace: workspace target-web-01. Step 3: Import nmap scan for this target: db_import /path/to/target-web-01_nmap.xml. Step 4: View hosts in workspace: hosts (shows only target-web-01 data). Step 5: Switch workspace to work on different target: workspace target-dc-01. Step 6: List all workspaces to verify organization: workspace.",
          "commands": [
            "msf-workspace-add",
            "msf-workspace-switch",
            "msf-db-import",
            "msf-hosts-list",
            "msf-workspace-list"
          ],
          "expected_outcome": "Each workspace acts as isolated container. hosts command in target-web-01 workspace shows only 192.168.45.100. Switching to target-dc-01 shows only 10.10.10.50. db_export generates separate XML files per workspace. services command shows only ports for current workspace's hosts. Time: 30 seconds per workspace setup. OSCP workflow: 1 workspace per target machine (25-30 total for full lab rotation).",
          "why_this_works": "Workspaces are PostgreSQL database schemas providing logical data separation. Each workspace maintains independent: Host tables (IP, OS, architecture), Service tables (port, protocol, banner), Vulnerability tables (CVEs, exploit links), Credential tables (username/password/hash pairs), Note tables (custom annotations). Benefits: Prevents accidental cross-contamination (running module against wrong target), Enables parallel assessment (multiple terminals, different workspaces), Facilitates reporting (export single workspace for client deliverable), Supports cleanup (delete workspace removes all associated data). Alternative to workspaces: Multiple databases (overkill), Manual note-taking (error-prone). Workspace best practice: Name by hostname or IP (target-192-168-45-100), use descriptive names for network ranges (internal-dmz, external-facing)."
        },
        {
          "title": "Scenario 3: Module Discovery and Selection Workflow",
          "context": "Nmap scan reveals SMB (445) on Windows target running Windows Server 2008 R2. Goal: Find relevant Metasploit modules for SMB enumeration and potential exploitation.",
          "approach": "Step 1: Search for SMB modules: search type:auxiliary platform:windows smb. Step 2: Review results, note scanner/smb/smb_version for version detection. Step 3: Load module: use auxiliary/scanner/smb/smb_version. Step 4: Check required options: show options (note RHOSTS required). Step 5: View detailed description: info (shows references, authors, disclosure dates). Step 6: Check compatible payloads (if exploit): show payloads. Step 7: Search for specific CVE if version vulnerable: search cve:2017 type:exploit smb.",
          "commands": [
            "msf-search-keyword",
            "msf-use-module",
            "msf-show-options",
            "msf-info-module",
            "msf-show-payloads",
            "msf-search-cve"
          ],
          "expected_outcome": "search type:auxiliary smb returns 40+ modules (smb_enumshares, smb_login, smb_version, smb_ms17_010_command). use loads module with auxiliary(scanner/smb/smb_version) prompt. show options reveals RHOSTS (required, no default), RPORT (optional, default 445), THREADS (optional, default 1). info displays module description, references to CVE-2017-0144 (EternalBlue), disclosure date. Time: 1-2 minutes to find and review module. search supports: type:exploit|auxiliary|post, platform:windows|linux|osx, rank:excellent|great, app:server|client.",
          "why_this_works": "Metasploit maintains indexed module database with metadata: Module type (exploit/auxiliary/payload/encoder/nop/post), Target platform and architecture (windows/x64, linux/x86, osx/armle), CVE references and disclosure dates, Reliability ranking (excellent to manual), Author information and references. Search uses regex matching against: Module path (scanner/smb/smb_version), Module name and description, CVE identifiers, Service names and ports. Module types explained: auxiliary = reconnaissance/fuzzing/DoS (no payload), exploit = gain access (requires payload), post = post-exploitation (requires session), payload = code execution after exploit success. Ranking system (highest to lowest): excellent (never crashes, always works), great (rarely crashes), good (sometimes crashes), normal (unreliable), average (often crashes), low (rarely works), manual (requires customization). OSCP tip: Filter by rank:excellent|great for exam stability."
        },
        {
          "title": "Scenario 4: Nmap Integration and Database-Driven Enumeration",
          "context": "Completed nmap scan saved as nmap_output.xml. Contains 3 hosts with 15 total services. Goal: Import into Metasploit, use database queries to filter targets, run targeted scans without manual IP entry.",
          "approach": "Step 1: Import nmap XML: db_import /root/nmap_output.xml. Step 2: View discovered hosts: hosts (shows IP, OS, name). Step 3: Filter services by port: services -p 445 (shows only SMB hosts). Step 4: Use database variables in modules: hosts -c address -p 445 returns IPs, use in RHOSTS. Step 5: Run module against filtered hosts: use auxiliary/scanner/smb/smb_version; set RHOSTS 192.168.45.100 192.168.45.101; run. Step 6: View updated service info: services -p 445 (now shows SMB version from scan). Step 7: Search for hosts by OS: hosts -o 'Windows Server 2008'.",
          "commands": [
            "msf-db-import",
            "msf-hosts-list",
            "msf-services-list",
            "msf-services-filter-port",
            "msf-use-module",
            "msf-set-option"
          ],
          "expected_outcome": "db_import processes XML, shows '[*] Importing nmap data, [*] Import complete, 3 hosts, 15 services'. hosts command displays table: address (IP), mac, name, os_name, os_flavor, purpose. services -p 445 filters to 2 SMB hosts. After running smb_version module, services -p 445 shows updated info column with 'Windows Server 2008 R2 Build 7601 Service Pack 1'. Database enables mass operations: hosts -R sets RHOSTS automatically to all hosts, services -p 80 -R sets RHOSTS to HTTP hosts only. Time saved: 5-10 minutes vs manual IP copying. OSCP benefit: Quickly pivot from reconnaissance to targeted exploitation.",
          "why_this_works": "db_import parses nmap XML, extracts: Host data (IP, MAC, OS detection results), Service data (port, protocol, service name, version), NSE script output (stored in notes table). Database queries enable programmatic targeting: services -p 445 queries service.port = 445, hosts -o 'Windows' queries host.os_name LIKE '%Windows%', services -s 'http' queries service.name = 'http'. RHOSTS auto-population: hosts -R sets RHOSTS to all workspace IPs, services -p 22 -R sets RHOSTS to SSH hosts. Benefits over manual tracking: No typos in IP addresses, Bulk operations (scan all HTTP hosts), Data persistence (revisit weeks later), Reporting integration (db_export). Integration with db_nmap: db_nmap -A <TARGET> runs nmap from msfconsole, auto-imports results. Alternative workflows: Use msfconsole's db_nmap (eliminates separate nmap + import step), Export nmap grepable format + parse manually (less reliable). OSCP exam tip: Import all initial nmap scans immediately, use database filtering to prioritize high-value targets (domain controllers, web servers)."
        }
      ],
      "sections": [
        {
          "title": "Phase 1: Initial Setup (One-Time Configuration)",
          "notes": "Run once per Kali installation. Database persists across reboots. If Metasploit updates break database, run msfdb reinit (preserves data). Estimated time: 3-5 minutes.",
          "commands": [
            {
              "id": "msf-db-init",
              "example": "sudo msfdb init",
              "shows": "Starting database"
            },
            {
              "id": "msf-db-status",
              "example": "db_status",
              "shows": "Connected to msf"
            },
            {
              "id": "msf-console-start",
              "example": "msfconsole -q",
              "shows": "msf6 > prompt appears"
            }
          ]
        },
        {
          "title": "Phase 2: Workspace Management (Per Engagement)",
          "notes": "Create workspace before any scanning. Best practice: 1 workspace per target or network segment. Workspace names are case-sensitive. Delete completed workspaces to reduce database size: workspace -d old-target. Estimated time: 30 seconds per workspace.",
          "commands": [
            {
              "id": "msf-workspace-add",
              "example": "[Command msf-workspace-add not found in database]",
              "shows": "See command documentation"
            },
            {
              "id": "msf-workspace-list",
              "example": "workspace",
              "shows": "Workspace list displayed"
            },
            {
              "id": "msf-workspace-switch",
              "example": "workspace client_pentest_2024",
              "shows": "Workspace: <name> (confirmation message)"
            },
            {
              "id": "msf-workspace-delete",
              "example": "[Command msf-workspace-delete not found in database]",
              "shows": "See command documentation"
            }
          ]
        },
        {
          "title": "Phase 3: Reconnaissance Import (After Nmap)",
          "notes": "Import nmap XML immediately after scanning. Supports nmap XML (-oX), nmap grepable (-oG less reliable). Import updates existing hosts (doesn't duplicate). Estimated time: 10-30 seconds for import, instant query access.",
          "commands": [
            {
              "id": "msf-db-import",
              "example": "db_import /home/kali/scans/network.xml",
              "shows": "Importing data..."
            },
            {
              "id": "msf-hosts-list",
              "example": "[Command msf-hosts-list not found in database]",
              "shows": "See command documentation"
            },
            {
              "id": "msf-services-list",
              "example": "[Command msf-services-list not found in database]",
              "shows": "See command documentation"
            },
            {
              "id": "msf-services-filter-port",
              "example": "[Command msf-services-filter-port not found in database]",
              "shows": "See command documentation"
            }
          ]
        },
        {
          "title": "Phase 4: Module Discovery (Target Selection)",
          "notes": "Search before manual Googling (Metasploit often has ready modules). Combine search filters: search type:exploit platform:linux cve:2021. Module path shows purpose: auxiliary/scanner = enumeration, exploit/windows/smb = exploitation. Estimated time: 1-3 minutes to find relevant module.",
          "commands": [
            {
              "id": "msf-search-keyword",
              "example": "[Command msf-search-keyword not found in database]",
              "shows": "See command documentation"
            },
            {
              "id": "msf-search-type",
              "example": "[Command msf-search-type not found in database]",
              "shows": "See command documentation"
            },
            {
              "id": "msf-search-platform",
              "example": "[Command msf-search-platform not found in database]",
              "shows": "See command documentation"
            },
            {
              "id": "msf-search-cve",
              "example": "[Command msf-search-cve not found in database]",
              "shows": "See command documentation"
            },
            {
              "id": "msf-info-module",
              "example": "info exploit/windows/smb/ms17_010_eternalblue",
              "shows": "Module details displayed (Name, Module, License, Rank, etc)"
            }
          ]
        },
        {
          "title": "Phase 5: Module Configuration (Pre-Execution)",
          "notes": "Always run show options before executing. Required options show 'yes' in Required column, no default value (must set). Optional options have defaults (can override). Use show advanced for rarely-used settings (timeouts, threads). Estimated time: 30-60 seconds to configure.",
          "commands": [
            {
              "id": "msf-use-module",
              "example": "use exploit/multi/handler",
              "shows": "Prompt changes to show module type and path"
            },
            {
              "id": "msf-show-options",
              "example": "show options",
              "shows": "Options table displayed with columns: Name, Current Setti..."
            },
            {
              "id": "msf-set-option",
              "example": "set RHOSTS 192.168.45.100",
              "shows": "OPTION => VALUE confirmation message"
            },
            {
              "id": "msf-show-advanced",
              "example": "[Command msf-show-advanced not found in database]",
              "shows": "See command documentation"
            }
          ]
        }
      ],
      "tags": [
        "METASPLOIT",
        "BASICS",
        "WORKFLOW",
        "DATABASE",
        "WORKSPACE",
        "RECON",
        "OSCP:HIGH"
      ]
    }
  ]
}